{
  "CLOSE": "Tancar",
  "ACCESSIBILITY": {
    "LANGUAGE_BUTTON_LABEL": "Idioma actual {{language}} prem per modificar idioma"
  },
  "TABS": {
    "MICROPYTHON": "MicroPython",
    "MICROBIT": "Micro:bit",
    "MICROIA": "MicroIA",
    "REPOSITORIO": "Repositori"
  },
  "MICROBIT_PAGE": {
    "TITLE": "Projectes Micro:bit",
    "OPEN_PROJECT_PREFIX": "Obrir el projecte ",
    "PROJECTS": {
      "ACCESSIBLE_PROGRAMMING": {
        "TITLE": "Programació Accessible",
        "DESCRIPTION": "Explora la programació de Micro:bit de forma accessible.",
        "img": "assets/img/microbit-a11y.png",
        "alt": ""
      },
      "COUNTDOWN": {
        "TITLE": "El Compte Enrere Final",
        "DESCRIPTION": "Un compte enrere personalitzable.",
        "img": "assets/img/final-countdown.png",
        "alt": ""
      },
      "DUEL": {
        "TITLE": "Duel al Sol",
        "DESCRIPTION": "Un joc de reflexos per a dos jugadors.",
        "img": "assets/img/duel.png",
        "alt": ""
      },
      "STONE_PAPER_SCISSORS": {
        "TITLE": "Pedra, Paper, Tisora",
        "DESCRIPTION": "El clàssic joc, ara a la teva Micro:bit.",
        "img": "assets/img/rps.png",
        "alt": ""
      },
      "SECRET_MESSAGE": {
        "TITLE": "Missatge Secret",
        "DESCRIPTION": "Envia i rep missatges secrets.",
        "img": "assets/img/secret.png",
        "alt": ""
      },
      "HEARTBEAT": {
        "TITLE": "El Batec de la Micro:bit",
        "DESCRIPTION": "Visualitza el batec de la teva placa.",
        "img": "assets/img/heart.png",
        "alt": ""
      }
    }
  },
  "DUEL_PAGE": {
    "TITLE": "Duel al Sol",
    "VIDEO_NOT_SUPPORTED": "El teu navegador no és compatible amb l'etiqueta de vídeo.",
    "INTRODUCTION_TITLE": "Introducció",
    "INTRODUCTION_TEXT": "Aquest projecte t'ensenya a crear un joc de reflexos per a dos jugadors a la Micro:bit. Prepara't per al duel!",
    "MATERIALS_TITLE": "Materials",
    "MATERIALS_LIST": [
      "2 Micro:bits",
      "Ordinador portàtil",
      "Cable de connexió USB-A",
      "Editor de Python"
    ],
    "TARGET": "Objectiu",
    "TARGET_TEXT_1": "Crear un joc de reflexos simple per a dos jugadors utilitzant dues Micro:bits.",
    "TARGET_TEXT_2": "Practicar la programació de bucles, condicionals i interacció entre Micro:bits.",
    "STEPS_TITLE": "Passos per a la Programació",
    "STEP_1_TITLE": "Pas 1: El Lançament del Duel",
    "STEP_1_TEXT": "Començarem programant la lògica bàsica del joc, on els jugadors han de reaccionar ràpidament.",
    "STEP_1_TEXT_1": "Per fer-ho, introduirem una funció de compte enrere i un mecanisme per detectar la pressió dels botons.",
    "STEP_1_TEXT_2": "Aquí teniu el primer fragment de codi per al compte enrere inicial:",
    "STEP_1_TEXT_3": "Aquest codi mostrarà un compte enrere a la pantalla de la Micro:bit i emetrà un so.",
    "STEP_1_TEXT_4": "Després del compte enrere, la Micro:bit ha d'esperar que un dels jugadors premi el botó A o B.",
    "STEP_1_TEXT_5": "El següent fragment de codi gestiona la detecció de la pressió dels botons:",
    "STEP_1_TEXT_6": "Aquestes línies detecten quin botó es prem primer i mostren una fletxa en la direcció corresponent.",
    "STEP_2_TITLE": "Pas 2: Millorant la Interactivitat",
    "STEP_2_TEXT": "Ara afegirem elements per fer el joc més dinàmic i interactiu.",
    "STEP_2_TEXT_1": "Integració de so per a la retroalimentació:",
    "STEP_2_TEXT_2": "El so ajudarà els jugadors a saber quan comença i acaba el compte enrere, i qui ha premut primer.",
    "STEP_2_TEXT_3": "També afegirem una variable per controlar l'estat del joc, com ara si el duel està actiu o no.",
    "STEP_2_TEXT_4": "Aquí teniu el codi actualitzat amb la lògica de so i estat del joc:",
    "STEP_2_TEXT_5": "Aquest pas és crucial per a una experiència de joc accessible.",
    "STEP_3_TITLE": "Pas 3: Connectant les Micro:bits",
    "STEP_3_TEXT": "El duel serà més emocionant si les dues Micro:bits poden comunicar-se entre elles.",
    "STEP_3_TEXT_1": "Utilitzarem el mòdul de ràdio per enviar senyals entre les dues Micro:bits.",
    "STEP_3_TEXT_2": "Primer, configurem el canal de ràdio perquè les Micro:bits es puguin trobar:",
    "STEP_3_TEXT_3": "Aquest fragment de codi inicialitza la ràdio i la configura a un grup específic.",
    "STEP_3_TEXT_4": "Ara, quan un jugador premi un botó, la seva Micro:bit enviarà un missatge a l'altra.",
    "STEP_3_TEXT_5": "El següent codi mostra com enviar i rebre aquests missatges:",
    "STEP_3_TEXT_6": "La Micro:bit que rep el missatge ha de saber que l'altre jugador ha reaccionat.",
    "STEP_3_TEXT_7": "Gestionarem el resultat del duel en funció de qui prem primer i qui rep el missatge.",
    "STEP_3_TEXT_8": "Aquí teniu el codi per a la lògica d'enviament i recepció de missatges:",
    "STEP_3_TEXT_9": "Aquesta lògica determina el guanyador de cada ronda del duel.",
    "STEP_3_TEXT_10": "La comunicació per ràdio és fonamental per a la dinàmica del joc.",
    "STEP_4_TITLE": "Pas 4: Afegint Puntuació i Múltiples Rodes",
    "STEP_4_TEXT": "Per fer el joc més competitiu, afegirem un sistema de puntuació i la possibilitat de jugar diverses rondes.",
    "STEP_4_TEXT_1": "Declararem variables per a les puntuacions de cada jugador i per al nombre de rondes jugades.",
    "STEP_4_TEXT_2": "El joc finalitzarà després d'un nombre predefinit de rondes, i el guanyador serà el que tingui la puntuació més alta.",
    "STEP_4_TEXT_3": "Aquí teniu el codi per gestionar la puntuació i les rondes:",
    "STEP_4_TEXT_4": "Aquestes variables s'actualitzaran després de cada ronda.",
    "STEP_4_TEXT_5": "També necessitem una manera de reiniciar el joc per a una nova partida.",
    "STEP_4_TEXT_6": "La funció de reinici s'encarregarà de restablir les puntuacions i les rondes.",
    "STEP_4_TEXT_7": "Codi per reiniciar el joc:",
    "STEP_4_TEXT_8": "Això permetrà jugar diverses partides sense necessitat de reiniciar les Micro:bits.",
    "STEP_4_TEXT_9": "La puntuació visible en cada Micro:bit ajudarà els jugadors a seguir el progrés.",
    "STEP_4_TEXT_10": "Ajustarem les sortides visuals i sonores per anunciar el guanyador final.",
    "STEP_4_TEXT_11": "El codi final hauria d'integrar totes aquestes parts per a un joc complet i funcional.",
    "STEP_4_TEXT_12": "Aquest sistema de puntuació afegeix un element de competició al duel.",
    "STEP_5_TITLE": "Pas 5: Consideracions d'Accessibilitat",
    "STEP_5_TEXT": "Per fer el 'Duel al Sol' realment accessible, hem de pensar en els usuaris amb diverses necessitats.",
    "STEP_5_TEXT_1": "Implementarem retroalimentació multisensorial, utilitzant no només la pantalla de LEDs sinó també sons clars i distintius per a cada acció i resultat del joc.",
    "STEP_5_TEXT_2": "Per exemple, un so agut per a la victòria i un greu per a la derrota, juntament amb indicadors visuals.",
    "STEP_5_TEXT_3": "També considerarem alternatives als botons físics, com ara la detecció d'inclinació o sacseig de la Micro:bit per a la reacció del jugador.",
    "STEP_5_TEXT_4": "Això permetrà que jugadors amb mobilitat reduïda puguin participar.",
    "STEP_5_TEXT_5": "El codi haurà de tenir en compte aquestes alternatives d'entrada.",
    "STEP_6_TITLE": "Pas 6: Depuració i Proves",
    "STEP_6_TEXT": "Un cop el codi estigui complet, és essencial depurar-lo i provar-lo rigorosament.",
    "STEP_6_TEXT_1": "Realitzarem proves amb ambdues Micro:bits per assegurar-nos que la comunicació per ràdio funciona correctament.",
    "STEP_6_TEXT_2": "Verificarem que el compte enrere, la detecció de botons i la lògica de puntuació funcionen com s'espera.",
    "STEP_6_TEXT_3": "També realitzarem proves d'accessibilitat per garantir que la retroalimentació multisensorial és efectiva.",
    "STEP_6_TEXT_4": "Demana a diferents persones que provin el joc per obtenir feedback variat.",
    "STEP_6_TEXT_5": "Ajustarem qualsevol error o problema d'usabilitat que es detecti durant les proves.",
    "STEP_6_TEXT_6": "La depuració és un pas iteratiu que garanteix la qualitat del joc.",
    "STEP_6_TEXT_7": "Una vegada que estigui tot correctament provat, el teu 'Duel al Sol' estarà llest!",
    "STEP_6_TEXT_8": "Aquest procés de prova és vital per a la qualitat i l'accessibilitat del projecte.",
    "STEP_7_TITLE": "Pas 7: Personalització i Millores",
    "STEP_7_TEXT": "Has construït un joc de duel bàsic. Ara és el moment de personalitzar-lo i afegir les teves pròpies idees.",
    "STEP_7_TEXT_1": "Podries afegir més rondes, diferents tipus de feedback, o fins i tot un mode d'un sol jugador contra la Micro:bit.",
    "STEP_8_TITLE": "Pas 8: Codi Complet",
    "STEP_8_TEXT": "Aquí teniu el codi complet del projecte 'Duel al Sol' per a la Micro:bit.",
    "STEP_8_TEXT_1": "Aquest codi integra totes les funcionalitats descrites en els passos anteriors, des del compte enrere fins a la lògica del duel i la comunicació per ràdio entre dues Micro:bits.",
    "STEP_8_TEXT_2": "Està dissenyat per ser un punt de partida per a experiments i personalitzacions futures.",
    "STEP_8_TEXT_3": "Inclou la configuració del mòdul de ràdio, la gestió de les pressions dels botons per part dels jugadors, i la lògica per determinar el guanyador de cada ronda.",
    "STEP_8_TEXT_4": "També incorpora un sistema bàsic de puntuació per seguir el progrés de la partida i anunciar un guanyador final.",
    "STEP_8_TEXT_5": "Les consideracions d'accessibilitat s'han tingut en compte, proporcionant retroalimentació multisensorial i opcions d'entrada flexibles.",
    "STEP_8_TEXT_6": "Aquest projecte serveix com a excel·lent exemple de com combinar les capacitats de la Micro:bit amb principis de disseny accessibles.",
    "STEP_8_TEXT_7": "Fes-lo teu i explora totes les possibilitats que ofereix!",
    "STEP_9_TITLE": "Pas 9: Descarregar l'Arxiu .hex",
    "STEP_9_TEXT": "Si no vols programar-ho tu mateix, pots descarregar l'arxiu .hex ja compilat per carregar-lo directament a la teva Micro:bit.",
    "STEP_9_TEXT_1": "Aquest arxiu conté el codi del joc 'Duel al Sol' llest per utilitzar.",
    "STEP_9_TEXT_2": "Només has de connectar la Micro:bit a l'ordinador i arrossegar l'arxiu .hex a la unitat que apareix.",
    "STEP_10_TITLE": "Pas 10: Jugant al Duel!",
    "STEP_10_TEXT": "Ara que tens el codi a la teva Micro:bit, és hora de jugar! Troba un amic amb una altra Micro:bit i gaudeix del 'Duel al Sol'.",
    "STEP_11_TITLE": "Pas 11: Suggeriments per a Millores Futures",
    "STEP_11_TEXT": "Aquí teniu algunes idees per portar el vostre 'Duel al Sol' al següent nivell:",
    "STEP_12_TITLE": "Pas 12: Recursos Addicionals",
    "STEP_12_TEXT": "Per aprofundir en la programació amb Micro:bit i l'accessibilitat, consulta els següents recursos:",
    "STEP_12_TEXT_1": "Documentació oficial de Micro:bit: [enllaç a la documentació]",
    "STEP_12_TEXT_2": "Guies d'accessibilitat en programació: [enllaç a guies]",
    "STEPS_TITLE_2": "Codi complet",
    "STEPS_TEXT_2": "Descàrrega de l'arxiu .hex",
    "STEPS_TITLE_3": "Evoluciona el codi",
    "STEP_13_TEXT": "Modifica el codi per crear variacions del joc, afegir nous modes, o integrar-lo amb altres projectes."
  },
  "HEART_PAGE": {
    "TITLE": "El Batec de la Micro:bit",
    "VIDEO_NOT_SUPPORTED": "El teu navegador no suporta l'etiqueta de vídeo.",
    "INTRODUCTION_TITLE": "Introducció",
    "INTRODUCTION_TEXT": [
      "Aquest projecte ens permet visualitzar el batec de la Micro:bit i experimentar amb el ritme cardíac.",
      "Aprendrem a utilitzar la pantalla de LEDs per a representacions visuals i a integrar sons per a una retroalimentació multisensorial.",
      "Descobrirem com es pot variar el ritme del 'batec' utilitzant diferents controls i programació.",
      "Prepara't per sentir el pols de la teva Micro:bit!"
    ],
    "MATERIALS_TITLE": "Materials",
    "MATERIALS_LIST": [
      "1 Micro:bit",
      "Ordinador portàtil",
      "Cable de connexió USB-A",
      "Editor de Python"
    ],
    "STEPS_TITLE": "Passos per a la Programació",
    "STEP_1_TITLE": "Pas 1: El Cor Pren Vida",
    "STEP_1_TITLE_1": "El Batec Bàsic",
    "STEP_1_TEXT": "Començarem programant una animació senzilla d'un cor que batega a la pantalla de LEDs de la Micro:bit.",
    "STEP_1_TITLE_2": "Afegint So al Batec",
    "STEP_1_TEXT_1": "Per fer el batec més realista i accessible, afegirem un so cada vegada que el cor s'il·lumini.",
    "STEP_1_TEXT_2": [
      "Importarem el mòdul 'music' per poder reproduir notes musicals.",
      "El so hauria de ser clar i distintiu, replicant el 'lub-dub' d'un batec real."
    ],
    "STEP_1_TEXT_3": "Aquí teniu el codi per integrar el so amb l'animació del cor:",
    "STEP_1_TITLE_3": "Controlant el Ritme",
    "STEP_1_TEXT_4": "Ara que el cor batega i sona, volem poder controlar el seu ritme. Introduirem una variable 'beats' per ajustar la velocitat del batec.",
    "STEP_1_TEXT_5": [
      "Aquesta variable controlarà el temps d'espera entre cada 'batec' i la durada de les notes musicals.",
      "Experimentarem amb diferents valors per trobar el ritme adequat."
    ],
    "STEP_1_TITLE_4": "Interacció amb Botons",
    "STEP_1_TEXT_6": [
      "Farem que els botons A i B de la Micro:bit permetin als usuaris augmentar o disminuir la velocitat del batec.",
      "Premer el botó A podria accelerar el cor, mentre que el botó B el podria alentir."
    ],
    "STEP_1_TEXT_7": "Codi per a la interacció amb els botons:",
    "STEP_1_TEXT_8": "Això permetrà una experiència interactiva on l'usuari controla el seu 'cor' virtual.",
    "STEP_1_TITLE_5": "Límits de Velocitat",
    "STEP_1_TEXT_9": [
      "Per evitar ritmes de batec irrealment ràpids o lents, establirem uns límits per a la variable 'beats'.",
      "El cor no hauria de poder aturar-se completament ni anar a una velocitat que no pugui ser percebuda."
    ],
    "STEP_1_TEXT_10": [
      "Aquestes restriccions asseguren que el joc es manté dins d'uns paràmetres lògics i jugables.",
      "Implementarem condicionals per assegurar que la variable 'beats' es mantingui dins del rang desitjat."
    ],
    "STEP_1_TITLE_6": "Retroalimentació Visual",
    "STEP_1_TEXT_11": [
      "A més de l'animació del cor, utilitzarem la pantalla de LEDs per mostrar la velocitat actual del batec, o altres indicadors visuals rellevants.",
      "Podríem mostrar un número que representi els batecs per minut (BPM)."
    ],
    "STEP_1_TEXT_12": [
      "Aquesta retroalimentació visual complementa la sonora, fent el projecte més informatiu."
    ],
    "STEP_1_TITLE_7": "Càlcul de BPM",
    "STEP_1_TEXT_13": "Per mostrar els batecs per minut (BPM), haurem de realitzar un petit càlcul basant-nos en la variable 'beats'.",
    "STEP_1_TEXT_14": "La fórmula per calcular els BPM a partir del temps entre batecs (en mil·lisegons) és: BPM = 60000 / temps_entre_batecs.",
    "STEP_1_TITLE_8": "Taula de Freqüències Cardíaques",
    "STEP_1_TEXT_15": "Aquí teniu una taula de referència per a les freqüències cardíaques, útil per ajustar el ritme del vostre 'cor' de Micro:bit:",
    "TABLE_TITLE": "Frecuencia Cardíaca (BPM)",
    "TABLE_HD_1": "Batecs per Minut",
    "TABLE_HD_2": "Temps entre Batecs (segons)",
    "TABLE_HD_3": "Temps entre Batecs (mil·lisegons)",
    "STEP_1_TEXT_16": [
      "Aquesta taula us ajudarà a entendre com els valors de 'beats' es correlacionen amb un ritme cardíac real.",
      "Podeu utilitzar aquests valors per programar ritmes específics o per validar el vostre simulador de batecs."
    ],
    "FORMULA_ALT_TEXT": "Fórmula per calcular la freqüència de batec del cor",
    "FORMULA_ALT_TEXT_2": "Imatge representant el sol",
    "FORMULA_ALT_TEXT_3": "Fórmula de la freqüència cardíaca",
    "STEP_1_TEXT_17": "Aquesta il·lustració mostra la fórmula utilitzada per convertir el temps entre batecs a batecs per minut (BPM).",
    "STEP_1_TITLE_9": "Monitorització de la Salut",
    "STEP_1_TEXT_18": [
      "Podríem afegir una lògica per simular condicions de salut, on el cor canvia de color o emet un so d'alarma si el ritme és massa alt o baix.",
      "Això podria ser un projecte educatiu sobre la salut cardíaca."
    ],
    "STEP_1_TEXT_19": "El codi podria canviar el color del LED o la imatge mostrada si el BPM surt d'un rang saludable.",
    "STEP_1_TITLE_10": "Alertes Sonores i Visuals",
    "STEP_1_TEXT_20": "Implementarem alertes sonores i visuales si el ritme cardíac simulat entra en zones de risc.",
    "STEP_1_TEXT_21": [
      "Per exemple, un so agut i una calavera a la pantalla si el cor 's'atura'.",
      "Aquestes alertes milloren l'accessibilitat i la claredat de la informació."
    ],
    "STEP_1_TITLE_11": "Múltiples Pantalles (Opcional)",
    "STEP_1_TEXT_22": "Si tenim diverses Micro:bits, podríem fer que una actuï com a monitor de cor i l'altra com a interfície de control, comunicant-se per ràdio.",
    "STEP_1_TEXT_23": [
      "Una Micro:bit podria mostrar només el BPM i l'altra la visualització del cor i els controls.",
      "Això introduiria el concepte de comunicació sense fils entre dispositius."
    ],
    "STEP_1_TEXT_24": [
      "La comunicació per ràdio permetria una major complexitat i funcionalitat al projecte.",
      "Aquí teniu un exemple de com es podria estructurar el codi per a aquesta configuració:"
    ],
    "STEP_1_TEXT_25": [
      "Aquest codi distribuiria les tasques entre dues Micro:bits, simulant un sistema de monitorització remot."
    ],
    "STEP_1_TITLE_12": "Finalització del Projecte",
    "STEP_1_TEXT_26": [
      "Un cop totes les funcionalitats estiguin implementades, provarem el projecte a fons per assegurar-nos que tot funciona correctament i que l'experiència d'usuari és òptima.",
      "Farem ajustos fins que el 'batec' sigui perfecte."
    ],
    "STEP_1_TEXT_27": "Assegureu-vos que la retroalimentació visual i sonora estigui ben sincronitzada.",
    "STEP_1_TEXT_28": "El vostre 'Batec de la Micro:bit' està a punt!",
    "STEP_1_TITLE_13": "Personalització Avançada",
    "STEP_1_TEXT_29": "Experimenta amb diferents animacions del cor, sounds personalitzats o afegeix més sensors per a una experiència encara més immersiva.",
    "STEP_2_TITLE": "Pas 2: El Codi",
    "STEP_2_TEXT": "Descàrrega el fitxer .hex ja compilat per carregar-lo directament a la teva Micro:bit.",
    "STEP_3_TITLE": "Pas 3: Evoluciona el Codi",
    "STEP_3_TEXT": "Modifica el codi per crear un ritme musical complet, un joc de reacció al ritme, o connecta-ho a altres projectes!"
  },
  "SECRET_MESSAGE_PAGE": {
    "TITLE": "Missatge Secret",
    "VIDEO_NOT_SUPPORTED": "El teu navegador no suporta l'etiqueta de vídeo.",
    "MORSE_CODE_CAPTION": "Alfabet de Codi Morse",
    "INTRODUCTION_TITLE": "Introducció",
    "INTRODUCTION_TEXT": "Aquest projecte t'ensenya a utilitzar la Micro:bit per enviar i rebre missatges secrets mitjançant el codi Morse.",
    "INTRODUCTION_TEXT_1": "Aprendràs a transformar text en seqüències de llums i sons, i a desxifrar-les de nou. Preparat per a l'espionatge digital?",
    "TARGET_TITLE": "Objectiu",
    "TARGET_TEXT": "Crear un comunicador de codi Morse funcional utilitzant la Micro:bit, capaç d'enviar i rebre missatges d'una manera accessible.",
    "MATERIALS_TITLE": "Materials",
    "MATERIALS_LIST": [
      "2 Micro:bits (per a comunicació entre elles)",
      "Ordinador amb connexió USB",
      "Cable USB de dades",
      "Editor de Python"
    ],
    "STEPS_TITLE": "Passos per a la Programació",
    "STEP_1_TITLE": "Pas 1: Preparació del Codi Morse",
    "STEP_1_TEXT": "Començarem definint l'alfabet de codi Morse a Python. Cada lletra i número tindrà una representació en punts (.) i ratlles (-).",
    "STEP_1_TEXT_1": "Per exemple, la lletra 'A' és '.-', la 'B' és '-...' i el '1' és '.----'.",
    "STEP_1_TEXT_2": "Utilitzarem un diccionari per emmagatzemar aquestes conversions, el que facilitarà la traducció del text a codi Morse i viceversa.",
    "STEP_1_TEXT_3": "Aquí teniu el fragment inicial per construir l'alfabet Morse:",
    "STEP_1_TEXT_4": "Aquest codi estableix les bases per a la codificació i decodificació dels nostres missatges.",
    "STEP_1_TEXT_5": "També afegirem les definicions per als números i alguns signes de puntuació bàsics per enriquir les nostres comunicacions.",
    "STEP_1_TEXT_6": "Aquí el codi complet de l'alfabet Morse:",
    "STEP_1_TEXT_7": "Aquesta és la clau de tot el projecte de missatgeria secreta. És important que tots els caràcters que vulguem utilitzar estiguin correctament definits.",
    "STEP_1_TEXT_8": "Un cop tinguem el diccionari complet, podrem començar a treballar en les funcions de codificació i decodificació.",
    "STEP_1_TEXT_9": "Aquesta primera part és fonamental per a la creació del traductor Morse.",
    "STEP_1_TITLE_2": "Pas 2: Traducció de Text a Codi Morse",
    "STEP_1_TEXT_11": "Ara crearem una funció que agafi un missatge de text i el converteixi a la seva representació en codi Morse. La funció haurà de recórrer cada caràcter del missatge, buscar la seva equivalent en el diccionari Morse i concatenar-la a una cadena resultant.",
    "STEP_1_TEXT_12": "També haurem de considerar com separar els caràcters i les paraules en codi Morse (normalment amb espais entre caràcters i ' / ' entre paraules).",
    "STEP_1_TEXT_13": "Aquí teniu el codi de la funció 'text_to_morse':",
    "STEP_1_TEXT_14": "Aquesta funció serà el cor de la nostra capacitat per enviar missatges secrets.",
    "STEP_1_TEXT_15": "Per provar-la, podem utilitzar un missatge simple com 'HOLA' i veure si la sortida és '.... --- .-.. .-'",
    "STEP_1_TEXT_16": "Aquesta part és crucial per convertir les nostres paraules en el llenguatge secret.",
    "STEP_1_TEXT_17": "Assegureu-vos de provar la funció amb diferents tipus de missatges per verificar-ne la robustesa.",
    "STEP_1_TITLE_3": "Pas 3: Enviament del Codi Morse (Visual i Sonor)",
    "STEP_1_TEXT_18": "Un cop tinguem el missatge en codi Morse, necessitem una manera d'enviar-lo. Per fer-ho accessible, farem servir tant la pantalla de LEDs de la Micro:bit (visual) com el so (auditiu).",
    "STEP_1_TEXT_19": "Una 'ratlla' (-)' es representarà amb un LED encès més llarg i un to de so més llarg. Un 'punt' ('.') amb un LED encès més curt i un to de so més curt. Un espai entre caràcters serà una pausa breu, i un espai entre paraules, una pausa més llarga.",
    "STEP_1_TEXT_20": "Aquí teniu la funció 'send_morse_signal':",
    "STEP_1_TEXT_21": "Aquesta funció farà que la nostra Micro:bit es converteixi en un emissor de senyals Morse multisensorial.",
    "STEP_1_TEXT_22": "És important ajustar els temps de durada per als punts, ratlles i pauses perquè siguin fàcilment diferenciables.",
    "STEP_1_TEXT_23": "La combinació de senyals visuals i auditius millora significativament l'accessibilitat del projecte.",
    "STEP_1_TEXT_24": "Aquesta és la funció que transforma el codi en una experiència interactiva.",
    "STEP_1_TITLE_4": "Pas 4: Recepció i Decodificació del Codi Morse",
    "STEP_1_TEXT_25": "La part més desafiadora és la recepció. Com que la Micro:bit no té una entrada de micròfon per detectar sons Morse, simularem la recepció amb els botons A i B, o amb un sensor de tacte.",
    "STEP_1_TEXT_26": "El botó A pot simular un 'punt' i el botó B una 'ratlla'. Detectarem les pressions dels botons i la durada de cada pressió per reconstruir el codi Morse.",
    "STEP_1_TEXT_27": "També crearem una funció 'morse_to_text' que farà el procés invers: agafar una seqüència de codi Morse i convertir-la de nou en text llegible.",
    "STEP_1_TEXT_28": "Aquí teniu el codi per a la recepció i decodificació:",
    "STEP_1_TEXT_29": "Aquesta lògica ens permetrà 'llegir' els missatges secrets que envien altres Micro:bits.",
    "STEP_1_TEXT_30": "La funció de decodificació utilitzarà el diccionari Morse invers per traduir les seqüències de punts i ratlles a lletres i paraules.",
    "STEP_1_TEXT_31": "És crucial gestionar correctament els temps entre les pressions de botons per diferenciar entre punts, ratlles i espais.",
    "STEP_1_TEXT_32": "Aquesta part és la que ens permet desxifrar els missatges.",
    "STEP_1_TITLE_5": "Pas 5: Interacció Complerta amb Ràdio (Opcional)",
    "STEP_1_TEXT_33": "Per a una experiència de missatgeria secreta completa, dues Micro:bits poden comunicar-se per ràdio. Una enviaria el codi Morse i l'altra el rebria i el decodificaria.",
    "STEP_1_TEXT_34": "La Micro:bit emissora utilitzaria 'radio.send()' i la receptora 'radio.receive()'. Això afegeix un nivell de realisme i funcionalitat al projecte.",
    "STEP_1_TEXT_35": "Aquí teniu l'exemple de com integrar la ràdio:",
    "STEP_1_TEXT_36": "Això permetria una comunicació sense fils entre dispositius.",
    "STEP_1_TEXT_37": "És important assegurar-se que les dues Micro:bits estiguin configurades al mateix grup de ràdio i que la velocitat de transmissió sigui adequada.",
    "STEP_1_TEXT_38": "La comunicació per ràdio obre la porta a moltes altres aplicacions.",
    "STEP_1_TITLE_6": "Pas 6: Millores d'Accessibilitat",
    "STEP_1_TEXT_39": "Per fer el comunicador Morse encara més accessible, podríem afegir:",
    "TRANSFORMANT_LIST": [
      "Vibració: Per a usuaris amb deficiència auditiva, la Micro:bit podria vibrar en lloc de fer un so.",
      "Pantalla ampliada: Mostrar el missatge decodificat en una pantalla externa més gran.",
      "Entrada alternativa: Utilitzar sensors de moviment (acceleròmetre) per simular punts i ratlles, facilitant l'ús a persones amb dificultats motrius fines."
    ],
    "STEP_1_TEXT_40": "Aquestes millores garantirien que el projecte sigui útil per a una gamma més àmplia d'usuaris.",
    "STEP_1_TEXT_41": "La implementació d'aquestes funcions requereix una consideració acurada dels diferents tipus de feedback que es poden proporcionar.",
    "STEP_1_TEXT_42": "La inclusió des del disseny és la clau per a projectes exitosos.",
    "STEP_1_TITLE_7": "Pas 7: Depuració i Proves",
    "STEP_1_TEXT_43": "És vital provar cada part del codi de manera independent i després de manera conjunta. Envia missatges de prova, tant simples com complexos, per assegurar-te que la codificació, l'enviament, la recepció i la decodificació funcionen perfectament.",
    "STEP_1_TEXT_44": "Ajusta els temps i les pauses segons sigui necessari per optimitzar la claredat dels senyals.",
    "STEP_1_TEXT_45": "La depuració és un procés iteratiu que assegura la qualitat del teu comunicador Morse.",
    "STEP_1_TITLE_8": "Pas 8: Codi Complet",
    "STEP_1_TEXT_46": "Aquí teniu el codi complet del projecte 'Missatge Secret' per a la Micro:bit.",
    "STEP_1_TEXT_47": "Aquest codi integra totes les funcionalitats descrites en els passos anteriors, des de la definició de l'alfabet Morse fins a l'enviament i la recepció de missatges.",
    "STEP_1_TEXT_48": "Està dissenyat per ser un punt de partida per a experiments i personalitzacions futures.",
    "STEP_1_TITLE_9": "Pas 9: Descarregar l'Arxiu .hex",
    "STEP_1_TEXT_49": "Si no vols programar-ho tu mateix, pots descarregar l'arxiu .hex ja compilat per carregar-lo directament a la teva Micro:bit.",
    "STEP_1_TEXT_50": "Aquest arxiu conté el codi del joc 'Missatge Secret' llest per utilitzar. Només has de connectar la Micro:bit a l'ordinador i arrossegar l'arxiu .hex a la unitat que apareix.",
    "STEP_1_TEXT_51": "Això et permetrà provar el projecte immediatament.",
    "STEP_2_TITLE": "Pas 10: Evoluciona el Codi",
    "STEP_2_TEXT": "Modifica el codi per crear un xifratge més complex, afegir nous mètodes d'entrada/sortida, o integrar-lo amb altres projectes de comunicació."
  },
  "RPS_PAGE": {
    "TITLE": "Pedra, Paper, Tisora",
    "VIDEO_NOT_SUPPORTED": "El teu navegador no suporta l'etiqueta de vídeo.",
    "INTRODUCTION_TITLE": "Introducció",
    "INTRODUCTION_TEXT": "Aquest projecte t'ensenya a crear el clàssic joc de 'Pedra, Paper, Tisora' a la teva Micro:bit. Prepara't per enfrontar-te a la intel·ligència artificial!",
    "INTRODUCTION_TEXT_1": "Aprendràs a utilitzar la pantalla de LEDs per mostrar les opcions (pedra, paper o tisora) i els botons per fer la teva tria. També incorporarem un generador de nombres aleatoris per a la decisió de la Micro:bit.",
    "MATERIALS_TITLE": "Materials",
    "MATERIALS_LIST": [
      "1 Micro:bit",
      "Ordinador amb connexió USB",
      "Cable USB de dades",
      "Editor de Python"
    ],
    "TARGET_TITLE": "Objectiu",
    "TARGET_TEXT": "Crear un joc de 'Pedra, Paper, Tisora' accessible i funcional amb la Micro:bit, utilitzant senyals visuals i auditius per a la interacció.",
    "STEPS_TITLE": "Passos per a la Programació",
    "STEP_1_TITLE": "Pas 1: Configuració Inicial i Elecció del Jugador",
    "STEP_1_TITLE_2": "Importacions necessàries",
    "STEP_1_TEXT_1": "Primer, importarem els mòduls necessaris per al funcionament de la Micro:bit i la generació de nombres aleatoris.",
    "IMPORTS_LIST": [
      "import microbit",
      "import random"
    ],
    "STEP_1_TEXT_2": "Aquestes línies ens permetran interactuar amb els components de la Micro:bit i obtenir resultats aleatoris.",
    "STEP_1_TITLE_3": "Elecció del jugador amb botons",
    "STEP_1_TEXT_3": "El jugador farà la seva elecció prement els botons A o B. El botó A pot ser 'Pedra' i el botó B pot ser 'Paper'. La 'Tisora' la triarem si es premen ambdós botons.",
    "STEP_1_TEXT_4": "Implementarem una funció que detecti quins botons es premen i assigni un valor numèric (0 per Pedra, 1 per Paper, 2 per Tisora).",
    "STEP_1_TITLE_4": "Definició de les figures",
    "STEP_1_TEXT_5": "Definirem les imatges que representaran la pedra, el paper i la tisora a la pantalla LED de la Micro:bit. Utilitzarem la matriu de LEDs per dibuixar-les de forma senzilla.",
    "STEP_1_TEXT_6": "Aquí teniu com definir les imatges:",
    "CODE_1_LIST": [
      "pedra = microbit.Image.SQUARE",
      "paper = microbit.Image.CHESSBOARD",
      "tisora = microbit.Image.SCISSORS"
    ],
    "STEP_1_TEXT_7": "Aquestes imatges faran el joc més visual i intuïtiu.",
    "STEP_1_TITLE_5": "Lògica del joc: elecció de la Micro:bit",
    "STEP_1_TEXT_8": "La Micro:bit haurà de fer la seva pròpia elecció de forma aleatòria. Utilitzarem la funció 'random.randint(0, 2)' per obtenir un nombre entre 0 i 2, que representaran la pedra, el paper o la tisora.",
    "STEP_1_TEXT_9": "Aquesta elecció es farà cada vegada que el jugador faci la seva tria, assegurant que el joc sigui impredictible.",
    "STEP_1_TEXT_10": "Aquí teniu el codi per a l'elecció de la Micro:bit:",
    "STEP_1_TEXT_11": "Aquesta part és crucial per a la interactivitat del joc.",
    "STEP_1_TITLE_6": "Determinar el guanyador",
    "STEP_1_TEXT_12": "Ara implementarem la lògica per determinar qui guanya la ronda. Recordem les regles: Pedra guanya a Tisora, Tisora guanya a Paper, i Paper guanya a Pedra.",
    "STEP_1_TEXT_13": "Utilitzarem una sèrie de condicionals (if/elif/else) per comparar les eleccions del jugador i de la Micro:bit.",
    "STEP_1_TEXT_14": "Aquí teniu la funció 'determine_winner':",
    "STEP_1_TITLE_7": "Mostrar el resultat",
    "STEP_1_TEXT_15": "Un cop determinat el guanyador, mostrarem el resultat a la pantalla LED de la Micro:bit. Podem utilitzar icones (per exemple, una cara feliç per guanyar, una trista per perdre, i una neutra per empatar).",
    "STEP_1_TEXT_16": "A més de la icona, podem fer que la Micro:bit emeti un so diferent per a cada resultat, millorant l'accessibilitat per a usuaris amb dificultats visuals.",
    "STEP_1_TITLE_8": "Bucle principal del joc",
    "STEP_1_TEXT_17": "El joc es repetirà contínuament fins que l'usuari decideixi aturar-lo. Utilitzarem un bucle 'while True' per mantenir el joc actiu.",
    "STEP_1_TEXT_18": "Dins del bucle, esperarem l'entrada del jugador, farem l'elecció de la Micro:bit, determinarem el guanyador i mostrarem el resultat.",
    "STEP_1_TEXT_19": "Aquí teniu l'estructura bàsica del bucle principal:",
    "STEP_1_TITLE_9": "Retroalimentació multisensorial",
    "STEP_1_TEXT_20": "Per millorar l'accessibilitat, afegirem sons per a cada acció i resultat. Per exemple, un so curt en triar una opció, un so de victòria, un de derrota i un d'empat.",
    "STEP_1_TEXT_21": "Utilitzarem el mòdul 'music' per reproduir melodies senzilles.",
    "STEP_1_TEXT_22": "Això permetrà que els usuaris amb discapacitat visual puguin gaudir plenament del joc.",
    "STEP_1_TITLE_10": "Implementació del so",
    "STEP_1_TEXT_23": "Integrarem les funcions de so a la lògica del joc. Per exemple, quan el jugador guanyi, es reproduirà la melodia de victòria, i així successivament.",
    "STEP_1_TEXT_24": "És important que els sons siguin distintius i fàcils de reconèixer.",
    "STEP_1_TEXT_25": "Aquesta addició augmentarà significativament la immersió i l'accessibilitat del joc.",
    "STEP_1_TITLE_11": "Detecció de gestos (Opcional)",
    "STEP_1_TEXT_26": "Com a alternativa als botons, podríem utilitzar l'acceleròmetre de la Micro:bit per detectar gestos. Per exemple, sacsejar la Micro:bit podria significar una tria aleatòria, o inclinar-la cap a un costat per triar pedra, paper o tisora.",
    "STEP_1_TEXT_27": "Això ofereix una opció d'entrada més accessible per a usuaris amb dificultats motrius.",
    "STEP_1_TITLE_12": "Codi complet amb gestos",
    "STEP_1_TEXT_28": "Aquí teniu un exemple de com podríem integrar la detecció de gestos al nostre joc 'Pedra, Paper, Tisora':",
    "STEP_1_TEXT_29": "Aquest codi substitueix o complementa les entrades dels botons per gestos.",
    "STEP_1_TEXT_30": "La funció 'gest_detection' seria responsable de llegir l'acceleròmetre i traduir els moviments en eleccions de joc.",
    "STEP_1_TEXT_31": "Aquesta funcionalitat faria el joc més versàtil i adaptable a diferents necessitats.",
    "STEP_1_TEXT_32": "Així és com les adaptacions poden millorar l'experiència de joc per a tothom.",
    "STEP_1_TEXT_33": "Considerarem la implementació d'una funció 'on_shake' per detectar el moviment de la Micro:bit.",
    "STEP_1_TEXT_34": "Aquesta funció retornaria una de les tres opcions (Pedra, Paper o Tisora) de forma aleatòria o basada en la intensitat del sacseig.",
    "STEP_1_TEXT_35": "L'ús de l'acceleròmetre permet una interacció més dinàmica i menys dependent dels controls físics.",
    "STEP_1_TEXT_36": "Aquesta és una gran addició per a la inclusió de tots els jugadors.",
    "STEP_1_TITLE_13": "Comunicació amb una altra Micro:bit (Multijugador)",
    "STEP_1_TEXT_37": "Per jugar contra un amic, podem fer que dues Micro:bits es comuniquin per ràdio. Cada jugador faria la seva tria a la seva Micro:bit, i aquesta enviaria la seva elecció a l'altra Micro:bit.",
    "STEP_1_TEXT_38": "La Micro:bit receptora compararia les dues eleccions i mostraria el resultat.",
    "STEP_1_TEXT_39": "Això obre la porta a un mode multijugador interactiu i accessible.",
    "STEP_1_TITLE_14": "Implementació del multijugador",
    "STEP_1_TEXT_40": "Aquí teniu com podríem modificar el codi per permetre el mode multijugador via ràdio:",
    "STEP_1_TEXT_41": "Una Micro:bit enviaria un missatge amb la seva elecció i l'altra rebria el missatge i faria la comparació.",
    "STEP_1_TEXT_42": "És important configurar el mateix grup de ràdio en ambdues Micro:bits.",
    "STEP_1_TEXT_43": "La comunicació per ràdio és una eina potent per a la creació de jocs interactius.",
    "STEP_1_TEXT_44": "Aquesta és la clau per jugar amb amics i familiars.",
    "STEP_1_TITLE_15": "Millores en la interfície d'usuari",
    "STEP_1_TEXT_45": "Per fer la interfície d'usuari més clara i accessible, podríem:",
    "STEP_1_TEXT_46": "Mostrar animacions més elaborades per a la pedra, el paper i la tisora.",
    "STEP_1_TEXT_47": "Utilitzar diferents tons de so per a cada tria del jugador (Pedra, Paper, Tisora).",
    "STEP_1_TEXT_48": "Això faria l'experiència més rica i visualment atractiva.",
    "STEP_1_TITLE_16": "Puntuació i rondes",
    "STEP_1_TEXT_49": "Podríem afegir un sistema de puntuació per dur un registre de qui guanya més rondes. També es podrien implementar múltiples rondes, i el joc finalitzaria quan un jugador arribés a una puntuació predeterminada.",
    "STEP_1_TEXT_50": "Això augmentaria la rejugabilitat i la competitivitat del joc.",
    "STEP_1_TEXT_51": "La puntuació visible en la Micro:bit podria motivar els jugadors.",
    "STEP_1_TITLE_17": "Codi per la puntuació",
    "STEP_1_TEXT_52": "Aquí teniu com podríem implementar la puntuació al nostre joc:",
    "STEP_1_TEXT_53": "Les variables 'player_score' i 'microbit_score' es podrien actualitzar després de cada ronda.",
    "STEP_1_TITLE_18": "Finalització del joc",
    "STEP_1_TEXT_54": "Un cop s'hagin jugat un nombre determinat de rondes, el joc hauria d'anunciar un guanyador final. Podríem fer que la Micro:bit mostri un missatge de 'HAS GUANYAT!' o 'HAS PERDUT!' amb una animació.",
    "STEP_1_TEXT_55": "També es podria reproduir una melodia final diferent per a cada resultat.",
    "STEP_1_TEXT_56": "Això proporciona un final satisfactori al joc.",
    "STEP_1_TITLE_19": "Codi de finalització",
    "STEP_1_TEXT_57": "Aquí teniu un exemple de com gestionar la finalització del joc:",
    "STEP_1_TEXT_58": "Aquesta lògica assegura que el joc tingui un principi i un final clars.",
    "STEP_1_TITLE_20": "Depuració i proves",
    "STEP_1_TEXT_59": "Com amb qualsevol projecte de programació, és essencial depurar i provar el joc a fons. Assegureu-vos que totes les regles funcionen correctament, que els sons i les animacions es reprodueixen com s'espera, i que la interacció amb l'usuari és fluida.",
    "STEP_1_TEXT_60": "La depuració regular garanteix un joc de qualitat.",
    "STEP_2_TITLE": "Pas 2: El Codi Complet",
    "STEP_2_TEXT": "Si no vols programar-ho tu mateix, pots descarregar l'arxiu .hex ja compilat per carregar-lo directament a la teva Micro:bit.",
    "STEP_3_TITLE": "Pas 3: Evoluciona el Codi",
    "STEP_3_TEXT": "Modifica el codi per crear noves opcions de joc, afegir un mode multijugador més avançat, o integrar-lo amb altres projectes de comunicació."
  },
  "COUNTDOWN_PAGE": {
    "TITLE": "El Compte Enrere Final",
    "VIDEO_NOT_SUPPORTED": "El teu navegador no suporta l'etiqueta de vídeo.",
    "INTRODUCTION_H2": "Introducció",
    "INTRODUCTION_P": [
      "Aquest projecte és la programació d’una conta enrere des de 10 fins a 0. La conta enrere es mostrarà a la pantalla de la Micro:bit i anirà acompanyada d’una pulsació, la mateixa que es va fer al projecte El batec de la Micro:bit, per tenir una estimulació sonora a banda d’una visual.",
      "Al projecte es veurà un nou tipus de bucle, un bucle for i es veurà com declarar una variable que utilitzarem per realitzar la conta enrere.",
      "Comencem el conta enrere!"
    ],
    "MATERIALS_H2": "Materials",
    "MATERIAL_MICROBIT": "1 Micro:bit.",
    "MATERIAL_ITEM_1": "Portàtil.",
    "MATERIAL_ITEM_2": "Cable USB-A",
    "MATERIAL_ITEM_3": "Editor de Python.",
    "STEPS_H2": "Passos",
    "STEP_1_H3": "Pas 1: Desenvolupant el Codi",
    "STEP_1_H4": "Declarant una variable",
    "STEP_1_P": [
      "El codi de la conta enrera, és possiblement, més senzill que el codi del projecte anterior, encara que també té les seves peculiaritats. La primera és la declaració d’una variable.",
      "Quan parlem de variables, hem de saber distingir entre una variable d’àmbit global i una d’àmbit local. De moment, l’únic que cal saber és que les variables d’àmbit global, com la que utilitzarem a aquest projecte, és declaren just desprès de la línia dels imports i es fa de la següent manera:"
    ],
    "STEP_1_P_2": "[nom variable] = [valor variable]",
    "STEP_1_P_3": "Un exemple de declaració seria:",
    "STEP_1_P_4": "Dit això, just a l’inici del nostre projecte escriurem:",
    "STEP_1_P_5": "A la línia 6 realitzem la declaració de la variable i i el seu valor: 10.",
    "STEP_1_H4_1": "Bucle for",
    "STEP_1_P_6": "Desprès de la declaració de la variable iniciem el bucle for, que és el bucle principal del projecte.",
    "STEP_1_H4_2": "Explicació del codi",
    "STEP_1_P_7": [
      "A aquest projecte hem d’explicar el bucle for. Un bucle for s’executa un determinat nombre de cops. Per decidir quants cops s’executa una bucle for es tendeix a incloure un algoritme que modifica el valor de la variable que controla el bucle cada cop que s’executa el bucle. En aquest cas es modifica el valor de la variable step.",
      "A la línia 9 declarem el bucle for i establim que s’executarà 11 cops (index in range(11)). Expliquem una mica més aquesta darrera sentència:"
    ],
    "CODE_ITEM_1": "index: Es el valor que s’anirà modificant.",
    "CODE_ITEM_2": "in; vincular index amb el seu rang de valors.",
    "CODE_ITEM_3": "range(): Indica el rang de valors, o els passos a realitzar pel bucle.",
    "CODE_ITEM_4": "11: És el nombre de cops (passos) que s’executarà el bucle for.",
    "STEP_1_P_8": [
      "Les línies 10 i 11 ja les coneixem del projecte anterior. A la línia 12 el que estem fent és reduir en un valor la variable i cada cop que s’executa el bucle for.",
      "Per últim, a la línia 13 fem que el codi s’aturi 1 segon abans de tornar-se a executar el bucle for."
    ],
    "STEP_1_H4_3": "Concepte",
    "STEP_1_P_9": [
      "No ha cridat l’atenció alguna cosa del codi? Us heu fixat que el valor de la variable i és de 10 i executem el bucle for 11 cops? Aquesta “incoherència” es deu a que el 0 és un nombre i per tant s’ha de tenir en compte alhora de programar. Si fem que el bucle for s’executi només 10 cops el darrer nombre que assolirà la variable i serà 1 i no 0.",
      "Feu la prova!"
    ],
    "STEP_2_H3": "Pas 2: El codi",
    "STEP_2_P": "Descàrrega del fitxer hex.",
    "STEP_3_H3": "Pas 3: Evoluciona el codi",
    "STEP_3_P": "Modifica el codi afegint una animació final, o emprant el compte enrere per iniciar algun procès a la Micro:bit. Aquest còmpte enrere pot ser la primera pedra d'un projecte més gran!'"
  },
  "SETTINGS": {
    "TITLE": "Configuració",
    "DESCRIPTION": "Aquí pots ajustar les configuracions de l'aplicació.",
    "THEME_TITLE": "Aparença",
    "DARK_MODE": "Mode Fosc",
    "DARK_MODE_TOGGLE": "Mode Fosc",
    "FONT_FAMILY_SELECT": "Tipus de Lletra",
    "FONT_SIZE_SELECT": "Mida de Lletra",
    "FONT_SIZE_SMALL": "Petita",
    "FONT_SIZE_MEDIUM": "Mitjana",
    "FONT_SIZE_LARGE": "Gran",
    "ANIMATIONS_TOGGLE": "Desactivar Animacions",
    "LANGUAGE_SELECT": "Idioma"
  },
  "ACCESSIBLE_PROGRAMMING": {
    "TITLE": "Programació Accessible",
    "H1": "Programació Accessible amb Micro:bit",
    "INTRO_P1": "La programació amb Micro:bit ofereix una excel·lent oportunitat per introduir persones de totes les edats i habilitats en el món de la tecnologia. No obstant això, per assegurar que sigui veritablement inclusiva, és fonamental considerar l'accessibilitat des de la fase de disseny dels projectes.",
    "INTRO_P2": "L'accessibilitat no pot ser un pegat que s'afegeix al final del projecte per intentar complir amb un requisit o obtenir beneficis.",
    "CREATION_TITLE": "Creació de Projectes Accessibles per a Micro:bit",
    "CREATION_P1": "Per crear projectes accessibles amb Micro:bit, és important tenir en compte diversos aspectes:",
    "CREATION_LI1_TITLE": "Feedback Multisensorial:",
    "CREATION_LI1_TEXT": "Utilitzar no només la pantalla de LEDs, sinó també el so (si el model de Micro:bit ho permet o es connecta a un altaveu) per proporcionar informació. Per exemple, un joc pot emetre un so en encertar i un altre diferent en fallar.",
    "CREATION_LI2_TITLE": "Entrades Alternatives:",
    "CREATION_LI2_TEXT": "Considerar opcions més enllà dels botons A i B. Els pins de la Micro:bit poden connectar-se a sensors externs o polsadors adaptats, facilitant la interacció per a persones amb mobilitat reduïda. Una altra opció és utilitzar l'acceleròmetre de la Micro:bit.",
    "CREATION_LI3_TITLE": "Claritat i Simplicitat:",
    "CREATION_LI3_TEXT": "Mantenir els programes tan simples i clars com sigui possible. Evitar seqüències d'accions complexes que puguin confondre usuaris amb dificultats cognitives o de memòria.",
    "CREATION_LI4_TITLE": "Documentació Clara:",
    "CREATION_LI4_TEXT": "Proporcionar instruccions detallades i fàcils d'entendre, idealment en múltiples formats (text, àudio, pictogrames).",
    "BLOCKLY_TITLE": "Programació per Blocs (Blockly) i Discapacitat",
    "BLOCKLY_P1": "Les interfícies de programació per blocs, com la que utilitza MakeCode per a Micro:bit, són una eina potent per a l'accessibilitat. La seva naturalesa visual e intuitiva redueix barreres importants:",
    "BLOCKLY_OVERCOME_TITLE": "Barreres que Supera:",
    "BLOCKLY_OVERCOME_LI1_TITLE": "Discapacidad visual (baixa visió):",
    "BLOCKLY_OVERCOME_LI1_TEXT": "Encara que les interfícies visuals poden ser un repte, l'ús de blocs amb codis de color permet que els usuaris amb baixa visió reconeguin el tipus de bloc que s'està utilitzant de manera més ràpida i senzilla.",
    "BLOCKLY_OVERCOME_LI2_TITLE": "Mugikortasun-desgaitasuna:",
    "BLOCKLY_OVERCOME_LI2_TEXT": "La manipulació de blocs sol ser més senzilla que l'escriptura de codi, especialment amb adaptacions de ratolí o teclat. La funció d'arrossegar i deixar anar pot ser reemplaçada per la navegació amb teclat per a aquells que no poden usar un ratolí.",
    "BLOCKLY_OVERCOME_LI3_TITLE": "Desgaitasun kognitiboa i ikaskuntzakoa:",
    "BLOCKLY_OVERCOME_LI3_TEXT": "La representació visual del codi redueix la càrrega cognitiva, en no requerir la memorització de sintaxis complexes. Els blocs guien l'usuari en l'estructura lògica del programa.",
    "BLOCKLY_CHALLENGES_TITLE": "Egungo Erronkes:",
    "BLOCKLY_CHALLENGES_LI1_TITLE": "Pantalla-irakurgailuak:",
    "BLOCKLY_CHALLENGES_LI1_TEXT": "Askotan, arrastatu i jaregin interfícies no són completament compatibles amb els lectors de pantalla, la qual cosa dificulta la interacció per a persones cegues o amb baixa visió severa.",
    "BLOCKLY_CHALLENGES_LI2_TITLE": "Navegació per Teclat:",
    "BLOCKLY_CHALLENGES_LI2_TEXT": "La navegació completa i eficient només amb teclat no sempre està implementada a la perfecció en totes les plataformes de programació per blocs.",
    "BLOCKLY_CHALLENGES_LI3_TITLE": "Personalització:",
    "BLOCKLY_CHALLENGES_LI3_TEXT": "La manca d'opcions de personalització (mida de font, contrast de color, eliminació d'animacions) pot afectar usuaris amb diverses necessitats visuals o cognitives.",
    "BLOCKLY_CHALLENGES_LI4_TITLE": "Documentació i Exemples:",
    "BLOCKLY_CHALLENGES_LI4_TEXT": "No sempre es disposa de documentació i exemples de projectes dissenyats específicament amb l'accessibilitat en ment.",
    "PYTHON_TITLE": "Programació per Codi (Editor Micro:bit Python)",
    "PYTHON_P1": "Com a alternativa a la programació per blocs es pot utilitzar la programació per codi (microPython o JavaScript). Aquest tipus de programació, en ser text pla, és altament accessible per als lectors de pantalla.",
    "PYTHON_P2": "El problema d'aquest tipus de programació és que els usuaris han de tenir un coneixement mínim del llenguatge de programació, per la qual cosa se'ls ha d'ensenyar el llenguatge i els conceptes al mateix temps. Això no succeeix amb la programació per blocs, ja que el coneixement del llenguatge no és necessari i els conceptes principals que es treballen són els conceptes de programació com variables, constants, bucles, etc.",
    "PYTHON_P3": "L'únic procediment que existeix actualment per minimitzar aquesta barrera (coneixement del llenguatge) és la creació de blocs de programació on l'alumne només ha de reemplaçar o completar una part del codi. La creació de l'esquelet dels blocs de programació en codi seria l'única opció actual per garantir un accés del 100% mitjançant un lector de pantalla.",
    "PYTHON_P4": "Fomentar la programació accessible non só beneficia ás persoes con discapacidade, sinó que también millora la experiència per a tots els usuaris, promovent una cultura de disseny inclusiu en l'àmbit de la tecnologia.",
    "PYTHON_P5": "A continuació es mostren dos exemples, un exemple on la resposta de la Micro:bit só es realitza a través de la pantalla i un altre, més accessible, on la sortida d'informació es realitza a través de la pantalla i es reforza amb una sortida de so.",
    "MODAL_NON_ACCESSIBLE_TITLE": "Exemple no Accessible",
    "MODAL_CLOSE": "Tancar",
    "MODAL_NON_ACCESSIBLE_H2": "Videoclip (No Accessible)",
    "MODAL_NON_ACCESSIBLE_P": "El videoclip de l'exemple no accessible aniria aquí.",
    "MODAL_VIEW_CODE": "Veure Codi",
    "MODAL_ACCESSIBLE_TITLE": "Exemple Accessible",
    "MODAL_ACCESSIBLE_H2": "Videoclip (Accessible)",
    "MODAL_ACCESSIBLE_P": "El videoclip de l'exemple accessible aniria aquí.",
    "MODAL_CODE_TITLE": "Codi",
    "NON_ACCESSIBLE_EXAMPLE_BUTTON": "Exemple no accessible",
    "ACCESSIBLE_EXAMPLE_BUTTON": "Exemple Accessible"
  },
  "ACCESSIBILITY_EVALUATOR_TITLE": "Avaluador d'accessibilitat",
  "COMPROBAR_ACCESIBILIDAD_TITLE": "Comprovar Accessibilitat (Automàtica)",
  "COMPROBAR_ACCESIBILIDAD_MANUAL_TITLE": "Comprovar Accessibilitat (Manual)",
  "MICROPYTHON_PAGE": {
    "H1": "Curs de Programació en MicroPython per a Micro:bit (Èmfasi en Accessibilitat)",
    "H2_INTRO": "Introducció a MicroPython i Micro:bit",
    "P_INTRO": "Aquest curs t'introduirà al món emocionant de la programació amb MicroPython a la placa Micro:bit. Aprendràs a crear projectes interactius, amb un enfocament especial en com fer-los accessibles per a tots els usuaris, independentment de les seves capacitats. La Micro:bit és una petita computadora programable dissenyada per fer que l'aprenentatge de la programació sigui divertit i accessible. Amb MicroPython, un dialecte optimitzat de Python per a microcontroladors, podràs escriure codi de manera senzilla i eficient.",
    "H2_MODULE1": "Mòdul 1: Primers Passos i Sortides Accessibles",
    "H3_MODULE1_BASIC": "Conceptes Bàsics de MicroPython",
    "P_MODULE1_BASIC": "Lorem ipsum dolor sit amet, consectetur adipiscing elit. Sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercici ullamco laboris nisi ut aliquip ex ea commodo consequat.",
    "H3_MODULE1_LED": "Mostrant Text a la Pantalla LED (amb consideracions d'Accessibilitat)",
    "P_MODULE1_LED": "Aprendrem a usar la matriu de LEDs de la Micro:bit per mostrar missatges. És crucial considerar que els usuaris amb discapacitat visual podrien no percebre aquesta sortida. Més endavant, explorarem mètodes alternatius per comunicar la informació.",
    "H2_MODULE2": "Mòdul 2: Entrades Interactives i Retroalimentació Multisensorial",
    "H3_MODULE2_INPUTS": "Ús de Botons i Entrades Digitals",
    "P_MODULE2_INPUTS": "Explorarem com els botons A i B, així com les entrades digitals, poden ser utilitzats per interactuar amb els nostres programes. Per a l'accessibilitat, considerarem com aquestes entrades poden ser adaptades o complementades.",
    "H3_MODULE2_SOUND": "Integrant So per a Retroalimentació",
    "P_MODULE2_SOUND": "La retroalimentació auditiva és fonamental per a l'accessibilitat. Aprendrem a usar el brunzidor (o altaveu extern) per proporcionar sons que reforcin la informació visual o la substitueixin completament per a usuaris amb discapacitat visual. Per exemple, si un joc requereix que l'usuari premi un botó, una combinació d'una fletxa visual a la pantalla LED i un so distintiu en prémer el botó pot millorar significativament l'experiència per a tots.",
    "H2_MODULE3": "Mòdul 3: Sensors i Adaptacions per a Diversitat Funcional",
    "H3_MODULE3_SENSORS": "Lectura de Sensors (Acceleròmetre, Brúixola, Temperatura)",
    "P_MODULE3_SENSORS": "La Micro:bit compta amb diversos sensors incorporats que ens permeten interactuar amb l'entorn. Aprendrem a llegir dades de l'acceleròmetre (per detectar moviment), la brúixola (per a l'orientació) i el sensor de temperatura.",
    "H3_MODULE3_ADAPTATIONS": "Adaptacions de Sensors per a Accessibilitat",
    "P_MODULE3_ADAPTATIONS": "Analitzarem com les dades dels sensors poden ser utilitzades per crear interaccions alternatives. Per exemple, un programa que s'activa en inclinar la Micro:bit podria ser més accessible per a persones amb mobilitat reduïda que un botó tradicional. A més, veurem com la informació obtinguda dels sensors pot ser traduïda a sortides multisensorials (visual, auditiva, tàctil).",
    "H2_CONCLUSIONS": "Conclusions i Propers Passos",
    "P_CONCLUSIONS": "Aquest curs ha cobert les bases de la programació en MicroPython amb un fort èmfasi en el disseny accessible. Recorda que l'accessibilitat no és una característica addicional, sinó un principi fonamental per crear tecnologia inclusiva. Anima't a explorar més projectes i a seguir aprenent com fer la tecnologia accessible per a tots!"
  },
  "REPOSITORIO_PAGE": {
    "CONTENT": "Contingut de la pàgina del repositori.",
    "HERO": {
      "TITLE": "Projectes de la micro:bit",
      "SUBTITLE": "Aquest repositori trobaràs diferentes projectes aportats per la comunitat. També pots aportar projectes propis i compartir-ho amb la resta pel seu estudi i evolució.",
      "UPLOAD_PROJECT_BUTTON": "Puja el teu projecte"
    },
    "STATS": {
      "PROJECTS_PUBLISHED": "Projectes publicats",
      "TOTAL_DOWNLOADS": "Total de descàrregues",
      "CONTRIBUTORS": "Contribuidors",
      "CATEGORIES": "Categories"
    },
    "FILTERS": {
      "LABEL": "Filtra per:",
      "ALL": "Tot",
      "SEARCH_PLACEHOLDER": "Cercar projectes..."
    },
    "CATEGORIES": {
      "ACCESSIBILITY": "Accessibilitat",
      "SENSORS": "Sensors",
      "COMMUNICATION": "Communicació",
      "EDUCATION": "Educació",
      "ENTERTAINMENT": "Entreteniment"
    },
    "PROJECTS_GRID": {
      "EMPTY_STATE_TITLE": "No s'ha trobat cap projecte'",
      "EMPTY_STATE_SUBTITLE": "Intenta-ho amb altres filtres o sigues el primer en pujar-ne un"
    },
    "UPLOAD_MODAL": {
      "TITLE": "Pujar un Nou Projecte",
      "SUBTITLE": "Comparteix el teu projecte accessible amb la comunitat",
      "PROJECT_TITLE_LABEL": "Nom del Projecte *",
      "PROJECT_TITLE_PLACEHOLDER": "Ex: Joc de pedra, paper i tissota accessible",
      "CATEGORY_LABEL": "Categoria *",
      "SELECT_CATEGORY_PLACEHOLDER": "Selecciona una categoria",
      "DESCRIPTION_LABEL": "Descripció *",
      "DESCRIPTION_PLACEHOLDER": "Descriu el teu projecte, què fa i com ajuda a l'accessibilitat...",
      "AUTHOR_NAME_LABEL": "El teu nom *",
      "AUTHOR_NAME_PLACEHOLDER": "Ex: Jane Doe",
      "TAGS_LABEL": "Etiquetes",
      "TAGS_PLACEHOLDER": "Ex: sons, LED, vibració...",
      "CODE_LABEL": "Codi del Projecte (.py) *",
      "DRAG_FILE_TEXT_BOLD": "Arrosega aquí el teu fitxer .py",
      "HEX_LABEL": "Fitxer HEX (.hex)",
      "DRAG_HEX_TEXT_BOLD": "Arrossega aquí el teu fitxer .hex",
      "INSTRUCTIONS_LABEL": "Instruccions del projecte",
      "DRAG_INSTRUCTIONS_TEXT_BOLD": "Arrossega aquí les teves instruccions",
      "CLICK_TO_SELECT_TEXT": "o pitja per selccionar-ne un",
      "PUBLISH_BUTTON": "Publica el Projecte",
      "LEVEL_LABEL": "Nivell",
      "SELECT_LEVEL_PLACEHOLDER": "Selecciona un nivell",
      "MATERIALS_LABEL": "Materials"
    },
    "LEVELS": {
      "LOW": "Baix",
      "MEDIUM": "Mitjà",
      "HIGH": "Alt"
    },
    "DETAIL_MODAL": {
      "DESCRIPTION_SECTION_TITLE": "Descripció",
      "TAGS_SECTION_TITLE": "Etiuetes",
      "CODE_SECTION_TITLE": "Codi del Projecte",
      "COPY_CODE_BUTTON": "Copiar",
      "COPIED_CODE_BUTTON": "✓ Copiat",
      "DOWNLOAD_FULL_PROJECT_BUTTON": "Desgarrega el projecte sencer"
    },
    "PROJECT_CARD": {
      "DOWNLOAD_BUTTON": "Descarrega",
      "VIEW_CODE_BUTTON": "Veure el codi"
    },
    "TOAST": {
      "PROJECT_PUBLISHED_SUCCESS": "Projecte publicat satisfactoriament! 🎉"
    }
  },
  "TAG_CATEGORIES": {
    "GENERAL": "General",
    "MICROBIT": "Micro:bit",
    "ACCESSIBILITY": "Accessibilitat",
    "LANGUAGES": "Llenguatges",
    "CONNECTIVITY": "Connectivitat"
  },
  "TAGS": {
    "EDUCATION": "Educació",
    "GAME": "Joc",
    "TOOL": "Eina",
    "SCIENCE": "Ciència",
    "ART": "Art",
    "MUSIC": "Música",
    "SPORT": "Esport",
    "LED": "LED",
    "RADIO": "Ràdio",
    "PINS": "Pines",
    "SENSORS": "Sensors",
    "BUTTONS": "Botons",
    "ACCELEROMETER": "Acceleròmetre",
    "COMPASS": "Brúixola",
    "VISUAL": "Visual",
    "AUDITORY": "Auditiva",
    "MOTOR": "Motriu",
    "COGNITIVE": "Cognitiva",
    "EASY_READING": "Lectura Fàcil",
    "AAC": "CAA",
    "MICROPYTHON": "MicroPython",
    "MAKECODE": "MakeCode",
    "SCRATCH": "Scratch",
    "BLUETOOTH": "Bluetooth",
    "IOT": "IoT",
    "NETWORKS": "Xarxes"
  },
  "ACCESSIBILITY_EVALUATOR_PAGE": {
    "H2": "Comprovador d'Accesibilitat del codi",
    "P": "Introdueix el teu codi de MicroPython per la Micro:bit a l'àrea de text. L'editor t'ajudarà a comprovar la seva accessibilitat.",
    "BTN": "Comprova l'Accessibilitat",
    "TEXTAREA_PLACEHOLDER": "Escriu el teu codi MicroPython aquí...",
    "EVALUATION_RESULTS_H3": "Resultat de l'evaluació",
    "SCORE": "Puntuació",
    "IMPROVEMENT": "Millora",
    "REDUNDANCY_DETECTED": "Redundància d'entrada detectada",
    "YES": "Sí",
    "NO": "No",
    "NO_BUTTONS_USED": "No s'utilitzen els botons",
    "ERRORS": "Errors",
    "WARNINGS": "Advertències",
    "CODE_PREVIEW_H3": "Sugeriment de correcció delCodi"
  },
  "VALIDATOR": {
    "AUDIO_FEEDBACK": {
      "SUCCESS_MESSAGE": "Multimodalitat: S'ha detectat la importació d'àudio.",
      "SUCCESS_MESSAGE_2": "Multimodalitat: S'ha detectat la sortida d'àudio.",
      "ERROR_MESSAGE": "Falta sortida de so.",
      "ERROR_SUGGESTION": "Afegeix 'speech.say('[string]')', 'music.play(music.[song])' o 'music.([number])' perquè els usuaris amb discapacitat visual rebin informació.",
      "ERROR_SUGGESTION_2": "Importa 'speech' o 'music' perquè els usuaris amb discapacitat visual rebin informació.",
      "MISSING_AUDIO_OUTPUT_WITH_DISPLAY_SHOW": "Només fas servir display.show() sense sortida d'àudio.",
      "SUGGEST_AUDIO_OUTPUT_WITH_DISPLAY_SHOW": "Afegeix 'import speech' o 'import music' i utilitza 'speech.say()' o 'music.play()' per proporcionar retroalimentació auditiva als usuaris amb discapacitat visual."
    },
    "BLOCKING_LOOPS": {
      "WARNING_MESSAGE": "S'ha detectat un bucle de bloqueig.",
      "WARNING_SUGGESTION": "Fas servir sleep() molt llargs. Això impedeix que la Micro:bit reaccioni ràpidament als botons o a les ordres de veu."
    },
    "INPUT_REDUNDANCY": {
      "SUCCESS_MESSAGE": "Entrada accessible: Utilitzes sensors tàctils o de moviment.",
      "ERROR_MESSAGE": "Només fas servir botons físics.",
      "ERROR_SUGGESTION": "Afegeix 'pin_logo.is_touched()' per facilitar l'ús a persones amb dificultat motriu."
    },
    "COMPLEX_PRESSES": {
      "WARNING_MESSAGE": "S'ha detectat una premuda complexa.",
      "WARNING_SUGGESTION": "Evita sol·licitar la premuda simultània de dos botons o un botó i el logotip, ja que dificulta la interacció per a usuaris amb certes discapacitats motrius.",
      "SUCCESS_MESSAGE": "Premudes simples: No s'han detectat premudes complexes."
    },
    "CODE_SEMANTICS": {
      "SUCCESS_MESSAGE": "Semàntica: Les variables tenen noms descriptius.",
      "WARNING_MESSAGE": "Noms de variables genèrics.",
      "WARNING_SUGGESTION": "Utilitza noms com 'estat_alarma' en lloc de 'a' per facilitar la lectura amb lectors de pantalla."
    }
  },
  "MANUAL_CHECK_MODAL_TITLE": "Verificació Manual d'Accessibilitat",
  "MANUAL_CHECK_MODAL_QUESTION_1": "Els textos o icones en pantalla LED són clars i llegibles",
  "MANUAL_CHECK_MODAL_QUESTION_2": "No depèn únicament de llums o colors per transmetre informació",
  "MANUAL_CHECK_MODAL_QUESTION_3": "La brillantor de la pantalla LED és adequada",
  "MANUAL_CHECK_MODAL_QUESTION_4": "S'ofereixen alternatives a l'ús exclusiu de la pantalla",
  "MANUAL_CHECK_MODAL_QUESTION_5": "Els senyals sonors tenen alternativa visual",
  "MANUAL_CHECK_MODAL_QUESTION_6": "El volum és suficient",
  "MANUAL_CHECK_MODAL_QUESTION_7": "No requereix moviments fins",
  "MANUAL_CHECK_MODAL_QUESTION_8": "Els botons A i B no són l'única forma d'interacció",
  "MANUAL_CHECK_MODAL_QUESTION_9": "Es pot usar amb adaptacions (pulsadors externs, pinces de cocodril, etc.)",
  "MANUAL_CHECK_MODAL_QUESTION_10": "No requereix agitar amb força si usa sensor de moviment",
  "MANUAL_CHECK_MODAL_QUESTION_11": "Les instruccions són clares i simples",
  "MANUAL_CHECK_MODAL_QUESTION_12": "El projecte té retroalimentació immediata",
  "MANUAL_CHECK_MODAL_QUESTION_13": "No sobrecarrega amb massa senyals simultanis",
  "MANUAL_CHECK_MODAL_QUESTION_14": "El comportament del programa és predictible",
  "MANUAL_CHECK_MODAL_QUESTION_15": "Es pot usar assegut/da o amb suport fix",
  "MANUAL_CHECK_MODAL_QUESTION_16": "La documentació explica com adaptar-lo",
  "MANUAL_CHECK_MODAL_QUESTION_17": "Ha estat provat per usuaris amb diferents necessitats",
  "MANUAL_CHECK_MODAL_OPTION_YES": "Sí",
  "MANUAL_CHECK_MODAL_OPTION_PARTIAL": "Parcial",
  "MANUAL_CHECK_MODAL_OPTION_NO": "No",
  "MANUAL_CHECK_MODAL_SUBMIT": "Enviar",
  "MANUAL_CHECK_MODAL_CANCEL": "Cancel·lar",
  "RESULTS_MODAL_TITLE": "Resultats de l'Avaluació d'Accessibilitat",
  "RESULTS_MODAL_SCORE": "Puntuació Total",
  "RESULTS_MODAL_FEEDBACK_0_17": "Necessita millores importants",
  "RESULTS_MODAL_FEEDBACK_18_27": "Accessibilitat mitjana (millorable)",
  "RESULTS_MODAL_FEEDBACK_28_36": "Projecte altament accessible",
  "RESULTS_MODAL_ACCEPT": "Acceptar",
  "MANUAL_CHECK_MODAL_HEADER_QUESTION": "Pregunta"
}
