{
  "TABS": {
    "MICROPYTHON": "MicroPython",
    "MICROBIT": "Micro:bit",
    "MICROIA": "MicroIA",
    "REPOSITORIO": "Repositori"
  },
  "MICROBIT_PAGE": {
    "TITLE": "Projectes Micro:bit",
    "OPEN_PROJECT_PREFIX": "Obrir el projecte ",
    "PROJECTS": {
      "ACCESSIBLE_PROGRAMMING": {
        "TITLE": "Programació Accessible",
        "DESCRIPTION": "Explora la programació de Micro:bit de forma accessible."
      },
      "COUNTDOWN": {
        "TITLE": "El Compte Enrere Final",
        "DESCRIPTION": "Un compte enrere personalitzable."
      },
      "DUEL": {
        "TITLE": "Duel al Sol",
        "DESCRIPTION": "Un joc de reflexos per a dos jugadors."
      },
      "STONE_PAPER_SCISSORS": {
        "TITLE": "Pedra, Paper, Tisora",
        "DESCRIPTION": "El clàssic joc, ara a la teva Micro:bit."
      },
      "SECRET_MESSAGE": {
        "TITLE": "Missatge Secret",
        "DESCRIPTION": "Envia i rep missatges secrets."
      },
      "HEARTBEAT": {
        "TITLE": "El Batec de la Micro:bit",
        "DESCRIPTION": "Visualitza el batec de la teva placa."
      }
    }
  },
  "SECRET_MESSAGE_PAGE": {
    "TITLE": "Missatge Secret",
    "VIDEO_NOT_SUPPORTED": "El teu navegador no suporta l'etiqueta de vídeo.",
    "MORSE_CODE_CAPTION": "Alfabet Morse",
    "INTRODUCTION_TITLE": "Introducció",
    "INTRODUCTION_TEXT": "El codi o alfabet Morse va ser creat per Samuel Morse i es basa en la representació de lletres i números mitjançant senyals emeses de forma intermitent..",
    "INTRODUCTION_TEXT_1": "D’aquesta forma, la lletra A es pot transmetre mitjançant un punt i un guió, tal i com es pot veure a la Imatge següent.",
    "MATERIALS_TITLE": "Materials",
    "MATERIALS_LIST": [
      "2 Micro:bit",
      "Portàtil",
      "Cable de connexió USB-A",
      "Editor de Python"
    ],
    "TARGET_TITLE": "Objectiu",
    "TARGET_TEXT": null,
    "STEPS_TITLE": "Passos",
    "STEP_1_TITLE": "Pas 1: Desenvolupant el Code",
    "STEP_1_TITLE_1": "Primers passos",
    "STEP_1_TEXT": "Per crear el nostre projecte començarem, com sempre, important els mòduls necessaris, que de moment serà el de Micro:bit. Per tant a la primera línia escriurem:.",
    "STEP_1_TEXT_1": "Un cop escrita aquesta línia. Començarem amb el bucle principal del projecte. Aquest bucle serà un bucle de tipus while. Els bucle de tipus while s’executen sempre, de manera contínua quan la condició sigui certa, Per fer que un bucle com aquest s’executi indefinidament hem d’assignar-li una condició True (cert).",
    "STEP_1_TEXT_2": "La segona línia de codi serà de la forma:",
    "STEP_1_TEXT_3": "El següent pas serà assignar una acció als botons A i B de la Micro:bit. Per això utilitzarem un altre tipus de bucle, el bucle if. Es podria dir que els bucles if són bucles de preses de decisions, una cruïlla a un camí. Aquest bucle, com el while, només s’executa si la condició és certa; en cas que la condició no sigui certa, llavors s’agafa l’altre camí, i a diferència dels bucles while, els bucles if només s’executen un vegada, si la condició és certa, o cap, en cas de que la condició sigui falsa.",
    "STEP_1_TEXT_4": "Així doncs, la següent línia del nostre codi serà:",
    "STEP_1_TEXT_5": "El següent pas es escriure el codi que s’executarà en cas de que pitgem el botó A. Si pitgem el botó A de la Micro:bit, volem que es mostri a la pantalla un punt. Per fer-ho escriurem:",
    "STEP_1_TEXT_6": "El valor 0 indica que el led de la Micro:bit situat a la posició tindrà una intensitat 0, o el que és el mateix, no s’il·luminarà. Per contra, el valor 9 indica que el led situat a aquella posició tindrà una intensitat màxima.",
    "STEP_1_TEXT_7": "Al poder assignar diferents intensitats les leds de la pantalla de la Micro:bit, podem realitzar animacions millors i jugar a fer ombres o animacions millors.",
    "STEP_1_TEXT_8": "Per últim, copiarem el bucle if que acabem de crear i substituirem la lletra a per la lletra b a la condició del codi i a la files on hem escrit ‘00900:’ escriurem ‘09990:’ per dibuixar una línia a la pantalla.",
    "STEP_1_TEXT_9": "El codi hauria de ser una cosa semblant al següent:",
    "STEP_1_TEXT_10": "Si ara executem el codi al simulador de la Micro:bit, veurem que quan es pitjar el bitó A apareix un punt al centre de la pantalla, i quan pitgem el B apareix una línia de 3 punts. Hem aconseguit escriure els dos signes generadors del codi mors!",
    "STEP_1_TITLE_2": "Afegint estímuls",
    "STEP_1_TEXT_11": "Anem pel bon camí, però al primer capítol hem dit que es busquen projectes que estimulin més d’un sentit, i ara mateix només estem estimulant el sentit de la vista. Anem a estimular el sentit de l’oïda.",
    "STEP_1_TEXT_12": "Per fer-ho, farem que la Micro:bit emeti un so durant un instant quan pitgem el botó A i el mateix s, el doble de temps, quan pitgem el botó B. El primer de tot, serà importar el mòdul music. Per fer-ho escriurem a sota de l’altre import:",
    "STEP_1_TEXT_13": "Ara que hem importat el mòdul, podem començar a utilitzar els seus mètodes. Per emetre una nota escriurem, dins del primer bucle if:",
    "STEP_1_TEXT_14": "El següent pas serà copiar la línia anterior dins l’altre bucle if modificant a per b per produir una nota diferent i permetre a l’oïda diferenciar entre un punt i un guió.",
    "STEP_1_TEXT_15": "El codi, amb les modificacions hauria de tenir una forma similar al següent:",
    "STEP_1_TEXT_16": "Si executem el codi al simulador, veurem que al pitjar el botons es mostra a pantalla un dels símbols generadors i s’emet un so diferent. Pràcticament ho tenim enllestit. Hi ha un petit però.",
    "STEP_1_TEXT_17": "El però és que el punt i el guio resten a pantalla tota l’estona fins que es pitja un altre cop un dels botons, quan hauria d’estar només un temps limitat.",
    "STEP_1_TITLE_3": "Netejant la pantalla",
    "STEP_1_TEXT_18": "Per netejar la pantalla hem d’incloure, just al final dels dos bucles if, o al final del bucle while, les següents línies:",
    "STEP_1_TEXT_19": "En el meu cas les he afegit al final del bucle while.",
    "STEP_1_TITLE_4": "Creant una constant",
    "STEP_1_TEXT_20": "Les constants són valors que no es modifiquen al llarg d’un codi i es solen escriure en lletres majúscules per diferenciar+-les de les variables. Al igual que les variables, hi ha diferents tipus de constants.",
    "STEP_1_TEXT_21": "En el nostre cas utilitzarem un diccionari. Els diccionaris permeten el retorn d’un valor segons els valor que introdueixis, és a dir, hem d’introduir una clau i un valor.",
    "STEP_1_TEXT_22": "Per exemple:",
    "STEP_1_TEXT_23": "En aquest cas, quan la Micro:bit detecti a que la variable letter te al seu interior el valor .- (punt i guió) ens retornarà la lletra A.",
    "STEP_1_TEXT_24": "El diccionari que necessitarem és el següent:",
    "STEP_1_TITLE_5": "Creant les variables",
    "STEP_1_TEXT_25": "Sobre les variables s’ha de tenir n conte que hi ha variables globals i variables locals. La diferència entre unes i altre és el seu àmbit, el que vindria a ser una espècie de zona d’influència. Les variables globals les declararem sempre a sota de les importacions, i es poden utilitzar a tot el codi del projecte.",
    "STEP_1_TEXT_26": "Una variable local seria aquella que hem declarat a dins d’un bucle, per exemple. Aquest variable només es pot utilitzar a dins d’aquest bucle, ja que fora del mateix la variable delcara no existeix.",
    "STEP_1_TEXT_27": "A sota dels imports escriurem:",
    "STEP_1_TEXT_28": "Les variables que hem creat són del tipus string (cadena),. Als projectes de Micro:bit no cal declarar quin tipus de variable estem utilitzant. Per aquest motiu cal inicialitzar-les. És a dir, donar un valor per defecte a les variables. Al fer-ho s’està indicant, de forma indirecta, quin tipus de variable volem utilitzar.",
    "STEP_1_TEXT_29": "Ara que tenim declarades les variables, anem a utilitzar-les. El primer que farem serà emmagatzemar el valor de · (punt) si pitgem el botó A, o de - (guió) si pitgem el botó B. Per fer-ho, a dins del bucle if del botó A escriurem:",
    "STEP_1_TEXT_30": "I a dins del bucle if del botó b escriurem:",
    "STEP_1_TEXT_31": "Amb això estem emmagatzemant el codi que crearà la lletra a la variable letter. Però no estem convertint els punts i guions en lletres. Per fer-ho primer hem d’indicar a la Micro:bit que ja em introduït el codi d’una lletra.",
    "STEP_1_TITLE_6": "Transformant lletres",
    "STEP_1_TEXT_32": "Per indicar que ja hem codificat una lletra en codi Morse utilitzarem un gest. En aquest cas s’ha decidit utilitzar un d’aquest dos gestos:",
    "TRANSFORMANT_LIST": [
      "tInclinar la Micro:bit cap a la dreta.",
      "Inclinar la Micro:bit cap a l’esquerra."
    ],
    "STEP_1_TEXT_33": "Aquest bucle if l’escriurem just a sota del bucle del botó B un bucle al que s’accedirà tant si girem la Micro:bit cap a la dreta com si la girem cap a l’esquerra. El bucle tindrà la següent forma:",
    "STEP_1_TEXT_34": "Per indicar que el bucle s’executi quan la Micro:bit s’inclini cap a la dreta o cap a l’esquerra hem d’utilitzar l’operador lògic | (o). A l’interior d’aquest bucle declararem un altre bucle if on es comprovarà si existeix el codi Morse a la constant ALPHABET. I en cas de que existeixi afegirem la lletra a la variable word.",
    "STEP_1_TEXT_35": "Per fer-ho escriure:",
    "STEP_1_TEXT_36": "A aquest línia estem indicant que s’afegeixi a la variable word la transcripció del codi Morse a lletra definida a la constant ALPHABET segons la codificació Morse de la variable Letter.",
    "STEP_1_TEXT_37": "Per poder anar introduint lletres a la variable letter, hem de reinicialitzar. Això ho farem assignant-li un valor buit un cop hem afegit la lletra a la variable word de la següent manera:",
    "STEP_1_TEXT_38": "El següent pas serà afegir una indicació sonora en cas de que s’hagi realitzat la transcripció de forma correcte. Per això afegirem un estímul sonor. A sota de la línia anterior afegirem:",
    "STEP_1_TEXT_39": "Ara només ens manca afegir la part del bucle if per si el valor de la variable letter no està continguda al la constant ALPHABET. Per això escriurem:",
    "STEP_1_TEXT_40": "D’aquest forma indicarem que el codi Morse que s’ha introduït no correspon a cap lletra.",
    "STEP_1_TITLE_7": "Mostrar el missatge amagat",
    "STEP_1_TEXT_41": "Ara només ens manca que algú pugui veure si escoltar el missatge amagat que ens han deixat escrit a la Micro:bit. Per mostrar el missatge s’ha triat el gest de sacsejar la Micro:bit. Al fer el gest la Micro:bit ens mostrarà per pantalla el missatge i també en dirà.",
    "STEP_1_TEXT_42": "Per que la Micro:bit parli, al bloc dels imports hem d’importar el mòdul speech.",
    "STEP_1_TEXT_43": "El bucle tindrà la següent forma:",
    "STEP_1_TEXT_44": "Com sempre, al final del bucle netegem la variable word per poder deixar una resposta a la Micro:bit.",
    "STEP_1_TITLE_8": "Imports",
    "STEP_1_TEXT_45": "Als imports que ja teníem afegirem el que permet connectar dues Micro:bit. Així, a sota de la darrera línia del bloc d’imports afegirem:",
    "STEP_1_TEXT_46": "El següent pas serà crear un gest per enviar el missatge escrit. Per fer-ho utilitzarem el gest de sacsejar la Micro:bit.",
    "STEP_1_TITLE_9": "Enviant el missatge",
    "STEP_1_TEXT_47": "Per enviar el missatge esborrarem el codi escrit a dins del bucle per mostrar el missatge i el substituirem per:",
    "STEP_1_TEXT_48": "Amb aquest codi estem enviant el missatge escrit per un usuari i rebent-lo a l’altre Micro:bit. Un cop es rep el missatge la Micro:bit el mostra en pantalla i el llegeix.",
    "STEP_2_TITLE": "Pas 2: El codi",
    "STEP_2_TEXT": "Descàrrega del fitxer hex.",
    "STEP_3_TITLE": "Pas 3: Evolucion el Codi",
    "STEP_3_TEXT": "Hem creat un joc on s'utilitza l'alfabet Morse per enviar un missatge secret. Prova de crear un joc similar utilitzant altres alfabets com el braille."
  },
  "RPS_PAGE": {
    "TITLE": "Pedra, Paper, Tisora",
    "VIDEO_NOT_SUPPORTED": "El teu navegador no suporta l'etiqueta de vídeo.",
    "INTRODUCTION_TITLE": "Introducció",
    "INTRODUCTION_TEXT": "Qui més qui menys al llarg de la seva infantesa ha jugat al joc de pedra, paper, tisora. A aquest projecte volem anar una mica més enllà i jugar al joc amb dues Micro:bit.",
    "INTRODUCTION_TEXT_1": "Per realitzar aquest projecte haurem d’utilitzar els mòduls speech i random de la Micro:bit. La designació del que traurà la Micro:bit per pantalla es farà de forma aleatòria al sacsejar la Micro:bit.",
    "INTRODUCTION_TEXT_2": "Se que tens moltes ganes de començar a jugar. Així doncs: COMENCEM!",
    "MATERIALS_TITLE": "Materials",
    "MATERIALS_LIST": [
      "2 Micro:bit.",
      "Poràtil.",
      "Cable de connexió USB-A.",
      "Editor de Python."
    ],
    "TARGET_TITLE": "Objectiu",
    "TARGAT_TEXT": "",
    "STEPS_TITLE": "Passos",
    "STEP_1_TITLE": "Pas 1: Desenvolupant el Codi",
    "STEP_1_TITLE_2": "Important els mòduls.",
    "STEP_1_TEXT_1": "Com sempre, el primer que farem serà importar els mòduls necessaris per la realització del projecte. Per aquest projecte necessitarem els següents mòduls;",
    "IMPORTS_LIST": [
      "Microbit.",
      "random.",
      "speech."
    ],
    "STEP_1_TEXT_2": "Així doncs, el nostre programa en Python ha de començar de la següent manera:",
    "STEP_1_TITLE_3": "Bucle principal.",
    "STEP_1_TEXT_3": "Un cop tenim els imports declarats, crearem el bucle inicial, que com sempre, a aquesta secció de Programació Bàsica és un del tipus while True. Recordem que aquest és un bucle infinit i que per tant, sempre s’està executant a la Micro:bit.",
    "STEP_1_TEXT_4": "El bucle tindrà la següent forma:",
    "STEP_1_TITLE_4": "Explicació del codi",
    "STEP_1_TEXT_5": "El codi es compon bàsicament d’una sèrie de bucles if niats entre ells que realitzen una acció una altre depenen del valor de la variable tool. La variable tool és una variable de tipus integer (enter) que agafa nombres aleatoris entre 0 i 2 quan es sacseja la Micro:bit. Per obtenir aquesta variable s’utilitza el mètode randint(a,b) del mòdul random de la següent manera:",
    "STEP_1_TEXT_6": "on:",
    "CODE_1_LIST": [
      "a: és el valor mínim que pot agafar la variable tool.",
      "b: és el valor màxim que pot agafar la variable tool."
    ],
    "STEP_1_TEXT_7": "Un cop s’ha calculat el valor de la variable simplement fem que es mostri una figura o una altre a pantalla depenent del seu valor mitjançant un bucle if.",
    "STEP_1_TITLE_5": "Fent el joc més accessible",
    "STEP_1_TEXT_8": "Si executem el codi, veurem que es por jugar sense cap tipus de problema, aparentment. El joc té un problema i és que tal i com està creat només poden jugar aquelles persones que no tenen una discapacitat visual, i que per tant poden veure el gràfic de la pantalla de la Micro:bit.",
    "STEP_1_TEXT_9": "La forma de fer que aquest projecte sigui accessible a les persones a discapacitat visual és afegint-hi un so. En aquest cas afegirem una veu, la veu de la Micro:bit dirà que hem tret a la nostra tirada.",
    "STEP_1_TEXT_10": "Com ja tenim el mòdul speech importat, només ens calen afegir tres línies, una a cada bucle if. Aquestes línies són:",
    "STEP_1_TEXT_11": "Al afegir aquestes línies, fem que la Micro:bit informe el valor de la tirada de cada jugador. Si executem el codi veurem que la veu de la Micro:bit no és molt agradable i que és angles. Això pot dificultar una mica la comprensió del resultat de cada jugador. Per aquest motiu podríem incloure un so diferent per cada resultat.",
    "STEP_1_TITLE_6": "Afegint un so",
    "STEP_1_TEXT_12": "Per afegir un so hem d’importar el mòdul de música. Al bloc dels imports afegirem la següent línia:",
    "STEP_1_TEXT_13": "Ara ja podem reproduir un so diferent per cada tirada. El so el reproduirem desprès de que parli la Micro:bit. Per fer-ho afegirem les següents línies:",
    "STEP_1_TEXT_14": "Ara desprès de dir el que s’ha tret a la tirada s’emetrà un so diferent.",
    "STEP_1_TITLE_7": "Important el mòdul radio",
    "STEP_1_TEXT_15": "Com sempre que volem utilitzar un mòdul de la Micro:bit que encara no hem utilitzar, hem d’importar-ho al bloc dels import. A aquest bloc afegirem la següent línia:",
    "STEP_1_TEXT_16": "Un cop importat aquest mòdul, ja el podem utilitzar per connectar les dues Micro:bit.",
    "STEP_1_TITLE_8": "Creant un grup",
    "STEP_1_TEXT_17": "Per poder connectar dues o més Micro:bit hem de crear un grup de connexió. La creació d’un grup fa que només les Micro:bit que pertanyin al grup es connectin entre elles, deixant a la resta fora del grup i evitant interferències. D’aquesta forma es poden realitzar partides simultànies si modifiquem el nom del grup.",
    "STEP_1_TEXT_18": "Els grups s’anomenen amb un número; per tant, utilitzant un símil a radiofònic, es podria dir que modifiquem la freqüència d’emissió i recepció utilitzant diferents canals. Per crear un grup escriurem, just a sota de l’inicia del bucle principal while el següent:",
    "STEP_1_TEXT_19": "En aquest cas hem assignat el número 12, però es pot assignar qualsevol altre número entre 0 i 255.",
    "STEP_1_TITLE_9": "Enviant i rebent informació",
    "STEP_1_TEXT_20": "Ara que hem establint un grup, podem connectar les Micro:bit. Per fer-ho, just desprès del darrer bucle if escriurem:",
    "STEP_1_TEXT_21": "A la línia 30 estem enviant la variable tool a l’altre Micro:bit; a la 31 estem rebent l’enviament de l’altre Micro:bit i assignant el valor a una nova variable anomenada recieved. A la darrera línia creem una nova variable buida anomenada result que utilitzarem més endavant. Recordem que aquestes noves variables son locals.",
    "STEP_1_TEXT_22": "El següent pas és la creació de bucles if niats per la pressa de decisions depenent dels valors de les variables tool i recieved.",
    "STEP_1_TITLE_10": "Pressa de decisions",
    "STEP_1_TEXT_23": "Per la pressa de decisions niarem diferents bucles if. Al bucle if més extern valorarem la variable tool i a l’interna la variable recieved de la següent manera:",
    "STEP_1_TEXT_24": "En aquest cas no podem utilitzar l’operador lògic & per resoldre la presa de decisions degut a que la variable tool és un integer (enter) i la variable recieved és un string (cadena). Per aquest motiu no es pot realitzar una comparació de variables.",
    "STEP_1_TEXT_25": "Com veiem al codi anterior, la nova variable result està prenent el valor del resultat de la comparació entre les variables tool i recieved.",
    "STEP_1_TITLE_11": "Tria del guanyador",
    "STEP_1_TEXT_26": "Ara amb el valor de la variable result mostrarem a pantalla i amb so qui dels dos jugadors ha guanyat. Per realitzar això utilitzarem un bucle if de la següent manera:",
    "STEP_1_TEXT_27": "Amb aquest darrer bucle tindríem un projecte operatiu. Si veiem el codi, aquest és ara mateix una mica confús i brut. Així que anem a netejar-ho.",
    "STEP_1_TITLE_12": "Netejant el codi",
    "STEP_1_TEXT_28": "El primer que farem serà esborrar les línies on reproduïm un so quan apareix el resultat a pantalla, és a dir, les línies 18, 22 i 26. Ara ja no cal que s’emeti un so diferent depenent del valor de la tirada. Realment també podríem treure les línies 17, 21 i 25; però les deixarem per que el jugador sàpiga quin és el valor de la seva tirada.",
    "STEP_1_TEXT_29": "Una altre cosa que es pot realitzar per netejar el codi i fer-ho més entenedor és crear funcions per agrupa diferents blocs de codi. D’aquesta forma crearem una funció anomenada Trie( ) a la que se li passarà la variable tool.",
    "STEP_1_TEXT_30": "La definició de la funció es realitzarà abans del bucle while de la següent manera:",
    "STEP_1_TEXT_31": "Al lloc on estava aquest bloc de codi cridarem a la funció:",
    "STEP_1_TEXT_32": "Podem fer el mateix amb els altres dos bucles i crear dues noves funcions, que anomenarem Comparison( ) i Winner( ). A la primera funció realitzarem la comparació de les variable i retornarem el valor de la variable result.",
    "STEP_1_TEXT_33": "Aquesta primera funció l’escriurem just a sota de la funció Tries(tool) i serà:",
    "STEP_1_TEXT_34": "Com podem veure a la definició de la funció, se li passen dues variables: tool i recieved. El més important d’aquest funció és retorn de la variable result. Aquesta variable es retorna al final de la funció.",
    "STEP_1_TEXT_35": "Com que la funció Comparison(tool, recieved) retorna un valor, al cridar a la funció des del bucle principal while, s’ha d’assignar aquest valor a una variable a l’hora de realitzar la crida. Per aquest motiu, la funció es cridarà de la següent forma:",
    "STEP_1_TEXT_36": "Al cridar-se d’aquesta forma, el valor de la variable retornada s’assigna a la variable de nova definició result. En aquest punt s’ha de fer un incís, encara que les variables es diuen igual: result, són dues variables diferents. La variable result que es defineix a dins de la funció Comparison(tool, recieved) només existeix dins de la funció, no fora de la mateixa. Per contra, la variable result que es defineix a l’interior del bucle while, només existeix a l’interior d’aquest bucle, i a cap lloc més. És el cicle de vida de les variable el que ens permet fer aquesta acció. Per aquest motiu s’ha de tenir sempre molt ben establert i definit quan una variable és global i quan local i quan utilitzar una variable local o una global.",
    "STEP_1_TITLE_13": "Enviant la resposta",
    "STEP_1_TEXT_37": "Tal i com està definit el codi, la resposta s’envia automàticament desprès de fer la tirada, i a vegades, si no s’ha fet alhora o ha passat molt de temps entre una i una altre es poden produir errors. Per aquest motiu, modificarem el codi per enviar el resultat de la tirada amb un gest. En aquesta ocasió s’ha triat el gest de tocar el logo de Micro:bit.",
    "STEP_1_TEXT_38": "Per poder fer això la variació que hem de fer al codi, es la crida a les funció d’enviament mitjançant un bucle if:",
    "STEP_1_TEXT_39": "Amb aquestes modificacions ja tenim el codi més polit i entenedor, però tenim un gran problema: podem fer trampes!",
    "STEP_1_TITLE_14": "Evitant les trampes",
    "STEP_1_TEXT_40": "Tal i com tenim definit el codi del projecte hi ha la possibilitat de realitzar trampes i enviar una tirada que sabem que guanyarà. Per evitar això podem utilitzar un bucle if. El que farem serà crear una nova variable global anomenada turns que definirem just abans que el bloc de funcions.",
    "STEP_1_TEXT_41": "El següent pas es modificar el bucle if on es realitza la tirada de la següent manera:",
    "STEP_1_TEXT_42": "D’aquesta manera el bucle if només s’executarà si les dues condicions són certes. Ara, per molt que es realitzi el moviment per una nova tirada, la Micro:bit no donarà cap nou resultat.",
    "STEP_1_TEXT_43": "El següent pas es treure tot el bucle if on es mira la condició de si s’ha tocat el logo de Micro:bit fora del bucle de la tirada. Al fer-ho sens marcarà que no existeix la variable tool. Això es deu a que aquesta variable és una variable local. La solució és fer que la variable passi a ser global definint-la just a sota de la variable turn.",
    "STEP_1_TEXT_44": "Amb aquestes modificacions el nostre joc ja funciona de forma correcta, però hi ha un petit inconvenient, només podem jugar una partida. Si es vol fer una segona partida s’ha de reiniciar la Micro:bit. Anem a solucionar-ho!",
    "STEP_1_TITLE_15": "Més d’una partida",
    "STEP_1_TEXT_45": "Per solucionar aquest fet, el més senzill és crear una nova funció que anomenarem Clean( ) on reiniciarem totes les variables.",
    "STEP_1_TEXT_46": "A sota la darrera funció definida escriurem:",
    "STEP_1_TEXT_47": "Com es veu, ja aprofitem la nova funció per reiniciar totes les variables al seu valor inicial.",
    "STEP_1_TEXT_48": "Ara només manca cridar a aquesta funció al final del tot el bucle on enviem la tirada al nostre oponent. Abans de la crida farem que hi hagi una pausa d’uns 2 segons per que els jugadors puguin discutir el resultat de la tirada.",
    "STEP_1_TITLE_16": "Substituint el bucle if accelerometer.was_gesture('shake') & turn",
    "STEP_1_TEXT_49": "El primer que hem de fer és agafar tot el que hi ha dins el bucle on iniciem la tirada i crear tres (3) bucle nous.",
    "STEP_1_TEXT_50": "Els bucles nous miraran si s’ha pitjat el botó A, el B o el logo de la Micro:bit per veure quina tirada ha decidit efectuar el jugador. Els bucles tindran la següent forma:",
    "STEP_1_TEXT_51": "Amb aquesta modificació estem fent que el jugador trii la seva jugada i que no sigui l’atzar qui la trii per ell.",
    "STEP_1_TITLE_17": "Modificant la condició d’enviament",
    "STEP_1_TEXT_52": "La següent modificació a realitzar serà el gest d’enviament. Al projecte anterior utilitzàvem el gest de tocar el logo de la Micro:bit; ara aquest gest és triar les tisores com tirada. Al tenir disponible el gest de sacsejar la Micro:bit, utilitzarem aquest gest per enviar la nostra tirada al contrincant. Per tant la condició del bucle quedarà de la següent manera:",
    "STEP_1_TEXT_53": "Amb això ja tindríem finalitzat el nostre projecte. Però realitzar una única partida és una mica trist, així que anem a desenvolupar una mica més el codi per que guanyi el millor a 5 tirades.",
    "STEP_1_TITLE_18": "Afegint un comptador",
    "STEP_1_TEXT_54": "El que farem per afegir dos comptadors. Per això crearem dues noves variables: count i points. A la primera variable es contaran les tirades que no són empats i a la segona les tirades que em guanyat.",
    "STEP_1_TEXT_55": "Un cop creades les variables, a dins del bucle on enviem la tirada i abans d’esborrar totes les variables, funció Clean( ), escriurem:",
    "STEP_1_TEXT_56": "Amb aquest bucle estem incrementant el valor de la variable count quan no es produeix un empatat.",
    "STEP_1_TITLE_19": "Contant tirades guanyades",
    "STEP_1_TEXT_57": "Les tirades guanyadores, les anirem sumant a la variable points. Per fer-ho crearem un bucle a dins del bucle on s’envia la tirada a l’oponent.",
    "STEP_1_TEXT_58": "Ara, si guanyem sumarem un punt al nostre marcador.",
    "STEP_1_TITLE_20": "Proclamant un guanyador",
    "STEP_1_TEXT_59": "El següent pas serà anunciar el guanyador de la partida. Per fer-ho es mirarà qui té més de 3 victòries un cop s’han realitzat les 5 tirades. Això es farà mitjançant un bucle if dins del bucle on es valora que la variable count ha arribat a 5, de la següent manera:",
    "STEP_1_TEXT_60": "Com podem observar, estem utilitzant imatges i sons que hem utilitzat dins la funció Winner( ). Aquest fet és contraproduent pels usuaris, ja que al rebre una informació diferent amb el mateix so i la mateixa imatge que una victòria parcial, pot pensar que simplement ha guanyat la tirada i no la partida. Per aquest fet, s’han de modificar els sons i les imatges dins la funció Winner( ).",
    "STEP_2_TITLE": "Pas 2: El codi",
    "STEP_2_TEXT": "Descàrrega del fitxer hex.",
    "STEP_3_TITLE": "Pas 3: Evoluciona el codi",
    "STEP_3_TEXT": "Aquest joc tradicional es pot jugar amb Micro:bit, pensa en altres jocs tradicionals i crea el codi per poder jugar amb les Micro:bit!"
  },
  "HEART_PAGE": {
    "TITLE": "El Batec de la Micro:bit",
    "VIDEO_NOT_SUPPORTED": "El teu navegador no suporta l'etiqueta de vídeo.",
    "INTRODUCTION_TITLE": "Introducció",
    "INTRODUCTION_TEXT": [
      "A molts quaderns de programació de Micro:bit el primer programa a realitzar és la animació del bateig d’un cor. Aquesta activitat té un problema des del punt de vista de l’accessibilitat. El problema és que només hi ha un estímul visual, i per tant, les persones amb una discapacitat visual no poden gaudir plenament l’experiència.",
      "A aquesta activitat, a banda de mostrar un cor bategant a la pantalla de la Micro:bit, s’emetrà un so de bateig, creant d’aquesta forma un estímul sonor que permetrà als discapacitats visuals gaudir més de l’experiència.",
      "Comencem a programar!"
    ],
    "MATERIALS_TITLE": "Materials",
    "MATERIALS_LIST": [
      "1 Micro:bit.",
      "Portàtil.",
      "Cable USB-A",
      "Editor de Python."
    ],
    "STEPS_TITLE": "Passos",
    "STEP_1_TITLE": "Pas 1: Desenvolupant el Codi",
    "STEP_1_TITLE_1": "Codi inicial",
    "STEP_1_TEXT": "El codi bàsic d’aquest projecte és el següent:",
    "STEP_1_TITLE_2": "Emetent batecs",
    "STEP_1_TEXT_1": "Modificarem aquest codi per que la Micro:bit també emeti un so amb les animacions del cor bategant. Per això escriurem la següent línia:",
    "STEP_1_TEXT_2": [
      "Aquesta línia la inserirem a sota de la línia de la importació inicial, és a dir, serà la línia 3 del nostre codi.",
      "Ara només hem d’afegir una línia a sota de la línia de codi on es mostra el cor gran. La línia que hem d’afegir és:"
    ],
    "STEP_1_TEXT_3": "La línia s’inserirà a la posició 8 del codi. Amb tot el codi del projecte quedarà de la següent forma:",
    "STEP_1_TITLE_3": "Explicació del codi",
    "STEP_1_TEXT_4": "Ara que hem vist quina pinta té el codi, anem a explicar que fa cada línia:",
    "STEP_1_TEXT_5": [
      "A les línies 1 i 5 introduïm comentaris per explicar que estem fent a les línies següents. A Python els comentaris van precedit del símbol #. Tot el que hi hagi escrit a una línia darrere d’aquest símbol no serà compilat i es considerarà un comentari.",
      "A les línies 2 i 3 importem les llibreries necessàries per que es pugui compilar el codi que estem escrivint. En aquest cas hem importat dues llibreries: \n\ta.\tMicro:bit. Per poder utilitzar les llibreries pròpies de Micro:bit. \n\tb.\tMusic. Per poder emetre sons mitjançant la Micro:bit.",
      "A la línia 6 s’inicia un bucle while. Aquest bucle finalitza a la línia 11. Els bucles while serveix per executar de forma contínua una part de codi sempre que la condició que els executa sigui certa. En aquest cas hem dit while True. Aquesta condició serà sempre certa i per tant, hem creat un bucle infinit que s’executarà de forma contínua.",
      "A les línies 7 i 10 es crida al classe display que conté el mètode show(). A aquest mètode serveix per mostrar una imatge a la pantalla de la Micro:bit, En aquest exemple es passa la imatge d’un cor gran (a la línia 7) i un cor petit a la línia 10.",
      "A la línia 8 es crida a la classe music per utilitzar el mètode play(). A aquest mètode se li ha de passar un nombre sencer. En aquest cas li passem el valor 100. Això fa que la Micro:bit emeti una nota a una freqüència de 100Hz.",
      "A les línia 9 i 11 s’imposa un temps d’espera de 500 mil·lisegons. Aquest temps d’espera entre imatge i imatge és el que crea l’animació de batec, al passar contínuament d’un cor gran a un petit i d’un cor petit a un gran."
    ],
    "STEP_1_TITLE_4": "Modificació del Codi",
    "STEP_1_TEXT_6": [
      "La primera modificació que realitzarem serà la definició de dues variables: a i b. La definició de les variables sempre la farem a la part superior del codi, just a sota de les importacions de les diferents llibreries.",
      "Així doncs afegirem les següents línies:"
    ],
    "STEP_1_TEXT_7": "Si mirem el codi antic, ens adonarem que a pren el mateix valor que el valor que es va introduir al mètode sleep( ) i que b pren el valor que es passa al mètode play( ). Així doncs hem de substituir el valor de 500 per a i el de 100 per b dins del mètodes, quedant de la següent forma les línies:",
    "STEP_1_TEXT_8": "Si ara testem el codi a l’emulador, veurem que no hi ha cap modificació en el comportament. El cor continua bategant i el so es continua produint. El següent pas és modificar el valor de a quan l’usuari realitza alguna acció concreta.",
    "STEP_1_TITLE_5": "Pitjant botons",
    "STEP_1_TEXT_9": [
      "L’acció triada per modificar els valors de a, en aquest cas, ha sigut la de pitjar el botó A de la Micro:bit. Per això utilitzarem un bucle if.",
      "A la línia 17 introduirem el següent codi, dins del bucle while:"
    ],
    "STEP_1_TEXT_10": [
      "Mitjançant aquest bucle estem indicant a la Micro:bit que cada cop que l’usuari pitgi el botó A de la Micro:bit el valor d’a s’incrementarà en 50. Si ara testem el codi veurem que al anar pitjant el botó A el batec del cor es va accelerant de forma uniforme.",
      "Ja estem més a prop d’aconseguir un atac al cor. El següent pas serà la modificació del bucle while."
    ],
    "STEP_1_TITLE_6": "Modificant la condició de while",
    "STEP_1_TEXT_11": [
      "Ara hem de modificar la condició del bucle while de tal forma que quan a arribi a un valor donat es surti del bucle. En aquest cas hem triat quan a sigui inferior a 50.",
      "Ho farem de la següent forma:"
    ],
    "STEP_1_TEXT_12": [
      "D’aquesta manera s’està indicant que quan el valor d’a sigui superior a 50 s’executi el codi a l’interior del bucle while, però que quan sigui inferior es surti del bucle.",
      "Si ara testem el codi, veurem que quan a assoleix el valor de 50 s’atura l’execució del codi. Ara només ens manca introduir un codi que digui que la Micro:bit ha mort. Per fer això introduirem codi fora del bucle while, que s’executarà quan el valor d’a sigui inferior a 50."
    ],
    "STEP_1_TITLE_7": "Codi de mort",
    "STEP_1_TEXT_13": "Fora del bucle while només ens manca incorporar 3 línies de codi per indicar que la Micro:bit ha mort. A partir de la línia 20 escriurem:",
    "STEP_1_TEXT_14": "Al codi modifiquem el cor que aparegui a la Micro:bit, per una calavera per indicar que la Micro:bit ha mort d’un atac al cor.",
    "STEP_1_TITLE_8": "El cor",
    "STEP_1_TEXT_15": "El cor humà fa, de mitja, entre 60 i 100 batecs per minut. Per tant, el primer que farem és modificar el ritme cardiaqui del nostre projecte. Al projecte estàvem fent que el cor bateguès cada 500 mil·lisegons, això és 2 batecs cada segon. Volem que el cor ara bategui 80 cops per minut, és a dir, 1.3 cops per segon o 1.3 cada 1000 mil·lisegons.",
    "TABLE_TITLE": "Batecs de cor per minut, segon i freqüència.",
    "TABLE_HD_1": "Batecs/Minut",
    "TABLE_HD_2": "Batecs/Segons",
    "TABLE_HD_3": "Freqüència",
    "STEP_1_TEXT_16": [
      "Al codi no podem dir que aparegui 1.3 cops cada 1000 mil·lisegons. Per tant, hem de realitzar una conversió. Podem fer que aquesta conversió la realitzi la Micro:bit si la codifiquem al nostre codi. Però per fer-ho, abans hem de pensar en l’algoritme (funció) necessari. Pensem!",
      "Tenim 1.3 batecs cada 1000 mil·lisegons i volem saber cada quants mil·lisegons es realitza 1 batec. Per tant:"
    ],
    "FORMULA_ALT_TEXT": "Fórmula per calcular la freqüència de batec del cor: 1,33 batexs entre 1000 mil·lisegons és igual a 1 batec entre X mil·lisegons.",
    "FORMULA_ALT_TEXT_2": "X mil·lisegons és igual a 1000 mil·lisegons entre 1,33 batecs.",
    "FORMULA_ALT_TEXT_3": "Feqüència de batecs.",
    "STEP_1_TEXT_17": "És a dir, la Micro:bit farà 1 batec cada 769.23 mil·lisegons.",
    "STEP_1_TITLE_9": "Modificant el codi",
    "STEP_1_TEXT_18": [
      "El primer pas serà la modificació del valor de les variables per simular el batec d’un cor a la Micro:bit segons el batec d’un cor humà.",
      "Tal i com hem vist al punt anterior, el nou valor de la variable a ha d’ésser 769.23 i b 75, que és la freqüència corresponent a 80 batecs/minut. D’aquesta forma hem replicat el batec d’un cor humà a la nostre Micro:bit.",
      "Així doncs, les línies 6 i 7 quedaran de la forma:"
    ],
    "STEP_1_TEXT_19": "El següent pas serà crear un nou bucle per reduir el batec del cor si l’usuari pitja el botó B de la Micro:bit.",
    "STEP_1_TITLE_10": "Reduint el batec",
    "STEP_1_TEXT_20": "Per reduir el batec del cor crearem un bucle if molt similar al que es va crear per botó A de la Micro:bit (línia 17). A la línia 21 escriurem:",
    "STEP_1_TEXT_21": [
      "Aquest bucle if s’ha d’escriure dins el buecle while, i el que fa es augmentar el valor de la variable a i per tant s’ampliarà el temps entre batecs, reduint-se la freqüència.",
      "Si testem ara el projecte veurem que podem incrementar la velocitat de batec fins a un màxim però que per contre, no hi ha un límit per reduir la velocitat de batec."
    ],
    "STEP_1_TITLE_11": "Modificant la condició del bucle while",
    "STEP_1_TEXT_22": "Per introduir una nova condició per que s’executi el bucle while, crearem una nova variable anomenada lives. Aquesta variable la crearem de tipus booleà.",
    "STEP_1_TEXT_23": [
      "Les variable de tipus booleà són unes variables que només poden agafar dos valors: cert (True) o fals (False).",
      "Amb aquesta nova variable definida, fem la següent modificació al bucle while:"
    ],
    "STEP_1_TEXT_24": [
      "Aquest bucle if és una mica diferent als que hem utilitzat amb anterioritat. En ell s’està dient que si el valor de la variable a és inferior (<) a 598.80 o (or) és superior a 1000 el valor de la variable lives serà False.",
      "Si ara testem el codi del projecte, veurem que el cor de la Micro:bit deixa de bategar si accelerem molt el seu batec o si el disminuïm. Ja podem dir que hem simulat el batec de un cor humà a una Micro:bit, però anem a fer una darrera millora al codi del nostre projecte."
    ],
    "STEP_1_TEXT_25": [
      "Aquest bucle if és una mica diferent als que hem utilitzat amb anterioritat. En ell s’està dient que si el valor de la variable a és inferior (<) a 598.80 o (or) és superior a 1000 el valor de la variable lives serà False.",
      "Si ara testem el codi del projecte, veurem que el cor de la Micro:bit deixa de bategar si accelerem molt el seu batec o si el disminuïm. Ja podem dir que hem simulat el batec de un cor humà a una Micro:bit, però anem a fer una darrera millora al codi del nostre projecte."
    ],
    "STEP_1_TITLE_12": "Darreres modificacions",
    "STEP_1_TEXT_26": [
      "Emprant la mateixa lògica que hem utilitzat al darrer bucle if que hem vist, anem a modificar els bucles if que controlen la modificació de la variable a, de manera que es pugui incrementar o disminuir el seu valor prement els botons de la Micro:bit o realitzant un altre gest. En aquest cas s’ha triat que al sacsejar la Micro:bit s’incrementarà la velocitat de batec i al acaronar el logotip de la Micro:bit es redueix la velocitat de batec.",
      "Per tant, la línia 18 quedarà de la següent forma:"
    ],
    "STEP_1_TEXT_27": "i la línia 21:",
    "STEP_1_TEXT_28": "Ara, podem comprovar que al realitzar qualsevol dels 4 gestos descrits es modifica la velocitat de batec del cor de la Micro:bit.",
    "STEP_1_TITLE_13": "Comentaris",
    "STEP_1_TEXT_29": "Com s’ha vist, un atac al cor no implica que un cor acceleri molt el seu batec o el disminueixi. L’atac no implica que la freqüència cardíaca augmenti o disminueixi de forma considerable, o perceptible. Així que si es vol fer el joc més divertit, es poden modificar els límits de la variable a i establir-ho a 100 i 1500 per veure com estem augmentant i disminuint el batec al realitzar els diferents gestos.",
    "STEP_2_TITLE": "Pas 2: El codi",
    "STEP_2_TEXT": "Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum.",
    "STEP_3_TITLE": "Pas 3: Lorem ipsum",
    "STEP_3_TEXT": "Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat."
  },
  "DUEL_PAGE": {
    "TITLE": "Duel al Sol",
    "VIDEO_NOT_SUPPORTED": "El teu navegador no suporta l'etiqueta de vídeo.",
    "INTRODUCTION_TITLE": "Introducció",
    "INTRODUCTION_TEXT": "Ets el més ràpid a aquesta banda del riu Llobregat? Anem a veure-ho. Prepara els teus dits per veure qui desenfunda més ràpid.",
    "MATERIALS_TITLE": "Materials",
    "MATERIALS_LIST": [
      "2 Micro:bit",
      "Portàtil",
      "Cable de connexió USB-A",
      "Editor de Python"
    ],
    "TARGET": "Objectiu",
    "TARGET_TEXT_1": "Aquest primer projecte amb Python per Micro:bit és un senzill codi que ens permetrà crear un joc per a dos jugador amb una única Micro:bit. El joc consisteix en veure qui pitja de forma més ràpida el botó de la Micro:bit. Un temporitzador valorarà si el jugador A ha pitjar el botó A abans que el jugador B pitgi el botó B de la Micro:bit.",
    "TARGET_TEXT_2": "Llestos. A les seves marques. Ja!",
    "STEPS_TITLE": "Passos",
    "STEP_1_TITLE": "Pas 1: Importació de mòduls",
    "STEP_1_TEXT": "Per crear el nostre projecte començarem, com sempre, important els mòduls necessaris, que en aquest cas serà només el de Micro:bit.",
    "STEP_1_TEXT_1": "Un cop importat el mòdul començarem el bucle de l’aplicació amb un bucle while de la següent manera:",
    "STEP_1_TEXT_2": "Els bucles while s’executen sempre que la condició sigui certa. D’aquest forma, si creem un bucle while True, estem creant un bucle infinit ja que la condició d’inicialització del bucle sempre serà certa.",
    "STEP_1_TEXT_3": "Un cop creat el bucle que controlarà l’execució del projecte, hem de crear dos bucles if. Un pel botó A i un altre pel botó B. El bucle pel botó serà:",
    "STEP_1_TEXT_4": "Segons aquest bucle, quan es pitgi el botó A apareixerà en pantalla un fletxa indicant que el botó A ha sigut el primer en ser pitjat.",
    "STEP_1_TEXT_5": "Pel botó B farem el mateix bucle modificant que el botó a pitjat és el B i el sentit de la fletxa. El bucle serà de la forma:",
    "STEP_1_TEXT_6": "Si executem ara el codi del projecte veurem que apareix una fletxa indicant quin botó ha sigut el que s’ha pitjat abans, i per tant, al guanyador. Però aquest codi té una gran mancança ara mateix, i és que la indicació és només visual. Anem a incorporar una senyal sonora de forma que emeti un so diferent quan es pitja el botó A o el botó B.",
    "STEP_2_TITLE": "Incorporant sons",
    "STEP_2_TEXT": "Per incorporar un so primer haurem d’importar un nou mòdul, D’aquesta manera, a sota de l’import del mòdul de Micro:bit escriurem:",
    "STEP_2_TEXT_1": "Al importar aquest mòdul, ara podrem fer que la Micro:bit emeto diferents sons. Per que emeti un so al pitjar el botó A, escriurem, dins del bucle del botó A la següent línia:",
    "STEP_2_TEXT_2": "A dins del bucle pel botó B escriurem el mateix però en lloc d’a escriurem b de la següent manera:",
    "STEP_2_TEXT_3": "Ara de forma sonora s’està indicant qui ha sigut el primer en pitjar un botó.",
    "STEP_2_TEXT_4": "El joc ha millorat força. Tot i això continua havent-hi un petit problema. Quin?",
    "STEP_2_TEXT_5": "Que un dels jugadors, o els dos jugadors, ha de realitzar una conta enrere per que comenci el joc. Però podem fer que això ho faci la Micro:bit per nosaltres, anem a veure com fer-ho.",
    "STEP_3_TITLE": "Afegint un compte enrere",
    "STEP_3_TEXT": "El primer que hem de fer és afegir la declaració d’una variable a sota del bloc dels imports, però iniciant la variable a 3. D’aquesta forma escriurem:",
    "STEP_3_TEXT_1": "El següent pas serà escriure el bucle for dins del bucle while de la següent forma:",
    "STEP_3_TEXT_2": "Si executem el codi del projecte veurem que el compte enrere és infinit, i un cop s’arriba al zero es continua comptant en nombre negatius.",
    "STEP_3_TEXT_3": "Per que això no succeeixi s’ha de fer segon bucle while niat, és a dir, un bucle while dins un altre bucle while. El codi anterior quedarà de la següent forma:",
    "STEP_3_TEXT_4": "Al niar un bucle while, estem fent que el bucle for s’executi dins el segon bucle while. Aquest segon bucle while només s’executarà quan el valor d’i sigui superior a menys 1 (–1). En el moment en que el valor de la variable sigui zero (0), es mostrarà el valor en pantalla, s’emetrà un so i es sortirà d’aquest bucle while; continuant-se l’execució del bucle while inicial.",
    "STEP_3_TEXT_5": "Una cosa que ens em de fixar és que ara el rang de i és tres (3) i no quatre (4) com abans. El rang s’ha disminuït en un valor per evitar una superposició de dos sons al arribar al valor de zero (0). Amb aquesta modificació s’evita que el zero faci el so de a conta enrere.",
    "STEP_3_TEXT_6": "Si es vol que el zero (0) formi part de la conta enrere, llavors al bucle if, en lloc de mostrar-se el valor de zero (0) es podria mostrar un text que digués JA quan s’emeti el so d’inici del joc.",
    "STEP_3_TEXT_7": "Ja tenim creada la conta enrere. Si enganxem el codi del projecte a fora del segon bucle while però a dins del primer, ja tindrem el nostre projecte executant-se de forma adient.",
    "STEP_3_TEXT_8": "El bucle principal del projecte hauria de tenir la següent forma:",
    "STEP_3_TEXT_9": "Si executem ara el codi del nostre projecte ens cridarà l’atenció que al pitjar el botó A o B de la Micro:bit la fletxa es mostra tota l’estona i si es torna a pitjar una altre cop, la fletxa modifica el seu sentit depenent del botó pitjar, és a dir, no es torna a realitzar una conta enrere.",
    "STEP_3_TEXT_10": "El que es vol és que es torni a iniciar el conta enrere per tornar a jugar. Anem a veure com ho podem fer.",
    "STEP_4_TITLE": "Reiniciant el compte enrere",
    "STEP_4_TEXT": "El primer que hem de fer és redefinir el bucle while intern i convertir-lo en una funció. Les funcions són blocs de codi que es poden utilitzar i que s’han de declarar abans de la seva utilització. Si es declara desprès de la seva utilització el programa ens retornarà un error.",
    "STEP_4_TEXT_1": "Dit això, declararem la funció abans del primer bucle while de la següent forma:",
    "STEP_4_TEXT_2": "Ara que tenim la funció definida, expliquem-la. Per definir una funció sempre s’utilitzarà la paraula reservada def seguida del nom de la funció. En el cas anterior seria def countdown( ). Desprès dels parèntesis s’han d’escriure dos punts ( : ) que indiquen l’inici de la definició de la funció, de igual manera que es fa amb un bucle while, per exemple.",
    "STEP_4_TEXT_3": "A dins d’aquesta funció s’ha inserit tot el bucle while que estava niat. Per fer que s’executi la funció la hem de cridar al bucle principal. Per fer-ho escriurem el nom de la funció just a sota de l’inic del bucle while i dins d’un bucle if de la següent manera:",
    "STEP_4_TEXT_4": "El bucle if és necessari per evitar que la funció countdown( ) sigui cridada infinitament. El mateix passa amb la igualtat i = 0. Sense aquestes dues línies la funció seria cridada una vegada i un altre fent-se un conte enrere des de 3 fins a 0 de forma infinita.",
    "STEP_4_TEXT_5": "Ara, per saber si s’ha pitjar el botó A o B de la Micro:bit definirem una funció a la que se li passarà un valor de 0, si s’ha pitjat el botó A o un valor 1 si s’ha pitjat el botó B. Degut que a aquesta funció se li passa un paràmetre, entre els parèntesis s’ha d’escriure una variable que agafarà el valor que se li passa a la funció.",
    "STEP_4_TEXT_6": "La definició de la funció serà de la següent manera:",
    "STEP_4_TEXT_7": "A la variable l’hem anomenat btn, i depenent del valor de btn s’executarà un o altre bloc del bucle if. Ara només ens cal cridar a la funció a dins del bucle while principal. Al cridar la funció haurem de passar el valor que es vol que adquireixi la variable btn. La crida la farem dins d’un bucle if contingut al bucle principal while de la següent manera:",
    "STEP_4_TEXT_8": "Si estudiem aquest bloc de codi, veiem que quan es pitja el botó A la funció btn_pressed( ) se li passa el valor 0, i si es pitja el botó B se li passa el valor 1. D’aquesta forma, la variable btn agafa un valor o un altre depenent del botó que es pitgi.",
    "STEP_4_TEXT_9": "Encara hem de realitzar una modificació. Si intentem cridar a les funcions ja creades de forma reiterativa es veurà com el bucle principal s’executa de forma indefinidament. Per evitar això hem de crear una nova funció que s’activi quan els jugadors realitzin una acció sobre la Micro:bit. En aquest cas s’ha triat un sacseig de la mateixa.",
    "STEP_4_TEXT_10": "La definició de la funció seria:",
    "STEP_4_TEXT_11": "A aquesta funció se li passa un valor que és agafat per la variable i. A la funció es crida a la funció countdown( ). Aquesta crida es realitzarà si el valor de la variable i és superior a 0. Un cop la variable assoleix el valor de 0 es produeix el so i es surt de la funció.",
    "STEP_4_TEXT_12": "Al haver-se creat aquesta nova funció, ara hem de cridar-la des de l’interior del bucle while principal de la següent manera:",
    "STEP_5_TITLE": "Bucle while principal",
    "STEP_5_TEXT": "Amb totes aquestes modificacions el bucle while principal he de tenir la següent forma:",
    "STEP_5_TEXT_1": "Tal i com està ara mateix el bucle principal del nostre projecte estem fent que el joc sigui infinit. Per modificar aquest comportament hem de crear una variable nova que anirà sumant o restant valors cada cop que s’executi el bucle. D’aquesta forma podrem fer que el bucle s’executi un nombre determinar de vegades.",
    "STEP_5_TEXT_2": "Així doncs, definim una variable global:",
    "STEP_5_TEXT_3": "I modificar la condició d’execució del bucle while segons el valor de la nova variable:",
    "STEP_5_TEXT_4": "Ara, per fer que el bucle finalitzi hem de sumar un valor cada cop que executem el bucle sencer. Ara, dins de cada bucle if, al final, escrivim la sentència: turns = turns -1. D’aquesta forma, cada cop que pitgem un dels botons de la Micro:bit es reduirà en 1 el valor de la variable turns.",
    "STEP_5_TEXT_5": "Ara, per fer que el bucle finalitzi hem de sumar un valor cada cop que executem el bucle sencer. Ara, dins de cada bucle if, al final, escrivim la sentència: turns = turns -1. D’aquesta forma, cada cop que pitgem un dels botons de la Micro:bit es reduirà en 1 el valor de la variable turns.",
    "STEP_6_TITLE": "Dient el guanyador",
    "STEP_6_TEXT": "El joc ja és funcional i es poden jugar 5 torns, però no hi ha un marcador ni un guanyador. Anem a afegir-ho.",
    "STEP_6_TEXT_1": "El primer que farem serà importar el mòdul speech per fer que la Micro:bit digui qui ha guanyat. Al bloc dels imports afegirem:",
    "STEP_6_TEXT_2": "També hem d’afegir dues variables al bloc de les variables.",
    "STEP_6_TEXT_3": "A aquestes dues variables guardarem el marcador del jugador a (player_a) i el del jugador b (player_b).",
    "STEP_6_TEXT_4": "Ara, només ens manca incrementar el marcador del jugador més ràpid en cada torn. Per fer-lo a l’interior del bucle if del botó A afegirem:",
    "STEP_6_TEXT_5": "I a dins del bucle if del botó B:",
    "STEP_6_TEXT_6": "Amb això ja hem aconseguit el nostre marcador. Ara només manca que es mostri al finalitzar la partida.",
    "STEP_6_TEXT_7": "Per fer-ho modificarem el darrer bucle, on es finalitza la partida, afegint les següents línies:",
    "STEP_6_TEXT_8": "Les partides han estat programades per 5 torn. Si volem jugar més torns només hem d’incrementar el valor de la variable turns.",
    "STEP_7_TITLE": "Connexió per ràdio",
    "STEP_7_TEXT": "Per poder connectar dues Micro:bits per ràdio el primer que s’ha de fer és importar el mòdul de ràdio. Per aquest motiu, al bloc dels imports escriurem:",
    "STEP_7_TEXT_1": "Ara ja podem utilitzar el mòdul per connectar les Micro:bits. Per fer-ho definirem una nova funció a sota de la darrera funció i just abans del bucle principal.",
    "STEP_8_TITLE": "Connectant les Micro:bits",
    "STEP_8_TEXT": "La funció per connectar les Micro:bits estarà composta de dues línies i serà de la forma:",
    "STEP_8_TEXT_1": "A aquest funció estem encenent la ràdio i creant un grup de connexió. En aquest cas al grup li hem donat l’identificador de 4, però no vol dir que s’hagin de vincular 4 Micro:bits al grup. El nombre vindria a ser el canal de connexió del grup de Micro:bits.",
    "STEP_8_TEXT_2": "Ara ja tenim les Micro:bits aparellades. A aquesta funció no la cridarem des de el bucle while principal, la cridarem des de la funció on_shake( ). Que ara serà de la forma:",
    "STEP_8_TEXT_3": "Com podem veure, hi ha una nova variable anomenada press i s’han eliminat les variables: game, turns player_a i player_b. També s’ha eliminat la funció btn_pressed(btn, result).",
    "STEP_8_TEXT_4": "Al haver modificat la funció on_shake(3, press) i retornar una variable, es cridarà a la funció assignant-li el valor de la variable retornada segons:",
    "STEP_8_TEXT_5": "També modificarem els bucles if quan es pitja un dels botons. Esborrarem els dos bucles anteriors i definirem un únic que s’activarà es cas de pitjar un o un altre botó.",
    "STEP_8_TEXT_6": "Aquest bucle s’executarà si es pitjar el botó A o B i sempre i quan s’hagi sacsejat la Micro:bit un cop. Aquesta acció es controla mitjançant el valor de la variable press. Quan aquesta és certa (True) es pot executar el bucle; si no ho és, no es podrà executar el bucle.",
    "STEP_8_TEXT_7": "A dins del bucle escriurem el següent bloc de codi:",
    "STEP_8_TEXT_8": "Com es pot observar al bloc de codi superior, hi ha noves variables. Anem a veure les seves funcions.",
    "STEP_9_TITLE": "Les noves variables",
    "STEP_9_TEXT": "La variable press ja l’hem explicat. Aquesta variable ens permet bloquejar la funció de pitjar els botons A i B.",
    "STEP_9_TEXT_1": "La variable msg és una nova variable, que hem de declarar just a sota de la variable press i que se li assignarà un valor de True. Aquesta variable fa que no es pugui tornar a sacsejar la Micro:bit per realitzar una altre tirada fins que no s’hagi finalitzat la tirada actual.",
    "STEP_9_TEXT_2": "Per últim, la variable winner, que es defineix amb un valor inicial de False, la definició es realitza sota de la variable msg. Aquesta variable serveix per enviar un missatge de Micro:bit a Micro:bit i bloquejar l’enviament en cas de rebre un missatge. Això ho veurem al següent bloc.",
    "STEP_10_TITLE": "Rebent un missatge",
    "STEP_10_TEXT": "El següent bloc de codi el que fa es veure si hem rebut un missatge. En cas de rebre el missatge, el primer que es fa és bloquejar el codi per evitar que l’altre jugador pugui enviar un missatge. Això es farà modificant el valor de la variable msg. El següent pas es mirar el valor de la variable press i depenent del mateix mostrarà una cara i emetrà un so o un altre",
    "STEP_11_TITLE": "Guanyador de la tirada",
    "STEP_11_TEXT": "Al bloc on es mostra que s’ha guanyat la partida s’accedeix depenent del valor de la variable winner. El que farà aquest bloc és mostrar una cara somrient y una música alegra.",
    "STEP_12_TITLE": "Reiniciant el joc",
    "STEP_12_TEXT": "Ara ja tenim el joc funcionant i es pot decidir qui ha guanyat la tirada, però hauríem de fer un joc més llarg, on hi hagin al mínim cinc (5) tirades i dir qui és el guanyador la partida. EL guanyador, serà el primer que arribi a tres (3) tirades guanyadores.",
    "STEP_12_TEXT_1": "Per tant, el que hem de fer es emmagatzemar alguns valors i reiniciar algunes variables per poder tornar a executar el joc. La reinicialització es realitzarà si es porten menys de cinc (5) tirades.",
    "STEP_12_TEXT_2": "Ara ja només ens queda gravar el codi a dues Micro:bits i iniciar una partida!",
    "STEPS_TITLE_2": "Pas 2: El codi",
    "STEPS_TITLE_3": "Pas 3: Evoluciona el codi",
    "STEP_13_TEXT": "Ja has vist com crear un joc per a dos jugador, ara pensa com evolucionar i afegir només opcions, com triar el nombre de partides, o afegir un tercer jugador. L imaginació no té límits!"
  },
  "COUNTDOWN_PAGE": {
    "TITLE": "La Cuenta Atrás Final",
    "VIDEO_NOT_SUPPORTED": "El teu navegador no suporta l'etiqueta de vídeo.",
    "INTRODUCTION_H2": "Introducció",
    "INTRODUCTION_P": "Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum.",
    "MATERIALS_H2": "Materials",
    "MATERIAL_MICROBIT": "Micro:bit",
    "MATERIAL_ITEM_1": "Lorem ipsum dolor sit amet",
    "MATERIAL_ITEM_2": "Consectetur adipiscing elit",
    "STEPS_H2": "Passos",
    "STEP_1_H3": "Pas 1: Lorem ipsum",
    "STEP_1_P": "Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat.",
    "STEP_2_H3": "Pas 2: El codi",
    "STEP_2_P": "Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum.",
    "STEP_3_H3": "Pas 3: Lorem ipsum",
    "STEP_3_P": "Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat."
  },
  "SETTINGS": {
    "TITLE": "Configuració",
    "DESCRIPTION": "Aquí pots ajustar les configuracions de l'aplicació.",
    "THEME_TITLE": "Aparença",
    "DARK_MODE": "Mode Fosc",
    "DARK_MODE_TOGGLE": "Mode Fosc",
    "FONT_FAMILY_SELECT": "Tipus de Lletra",
    "FONT_SIZE_SELECT": "Mida de Lletra",
    "FONT_SIZE_SMALL": "Petita",
    "FONT_SIZE_MEDIUM": "Mitjana",
    "FONT_SIZE_LARGE": "Gran",
    "ANIMATIONS_TOGGLE": "Desactivar Animacions",
    "LANGUAGE_SELECT": "Idioma"
  },
  "ACCESSIBLE_PROGRAMMING": {
    "TITLE": "Programació Accessible",
    "H1": "Programació Accessible amb Micro:bit",
    "INTRO_P1": "La programació amb Micro:bit ofereix una excel·lent oportunitat per introduir a persones de totes les edats i habilitats en el món de la tecnologia. No obstant això, per assegurar que sigui realment inclusiva, és fonamental considerar l'accessibilitat des del disseny dels projectes.",
    "INTRO_P2": "L'accessibilitat no pot ser un pedaç que s'afegeix al final del projecte per intentar complir amb un expedient o obtenir beneficis.",
    "CREATION_TITLE": "Creació de Projectes Accessibles per a Micro:bit",
    "CREATION_P1": "Per crear projectes de Micro:bit que siguin accessibles, és important tenir en compte diversos aspectes:",
    "CREATION_LI1_TITLE": "Retroalimentació Multisensorial:",
    "CREATION_LI1_TEXT": "Utilitza no només la pantalla LED, sinó també el so (si el model de Micro:bit ho permet o es connecta a un altaveu) per proporcionar informació. Per exemple, un joc pot emetre un so quan s'encerta i un altre diferent quan es falla.",
    "CREATION_LI2_TITLE": "Entrades Alternatives:",
    "CREATION_LI2_TEXT": "Considera opcions més enllà dels botons A i B. Els pins de la Micro:bit poden connectar-se a sensors externs o interruptors adaptats, facilitant la interacció per a persones amb mobilitat reduïda. Una altra opció és utilitzar l'acceleròmetre de la Micro:bit.",
    "CREATION_LI3_TITLE": "Claredat i Simplicitat:",
    "CREATION_LI3_TEXT": "Mantingues els programes el més senzills i clars possible. Evita seqüències d'accions complexes que puguin confondre a usuaris amb dificultats cognitives o de memòria.",
    "CREATION_LI4_TITLE": "Documentació Clara:",
    "CREATION_LI4_TEXT": "Proporciona instruccions detallades i fàcils d'entendre, idealment en múltiples formats (text, àudio, pictogrames).",
    "BLOCKLY_TITLE": "Programació per Blocs (Blockly) i Discapacitat",
    "BLOCKLY_P1": "Les interfícies de programació per blocs, com la que utilitza MakeCode per a Micro:bit, són una eina poderosa per a l'accessibilitat. La seva naturalesa visual i intuitiva redueix barreres significatives:",
    "BLOCKLY_OVERCOME_TITLE": "Barreres Superades:",
    "BLOCKLY_OVERCOME_LI1_TITLE": "Discapacitat visual (baixa visió):",
    "BLOCKLY_OVERCOME_LI1_TEXT": "Encara que les interfícies visuals poden ser un repte, l'ús d'una codificació de blocs segons colors fa que els usuaris amb una baixa visió puguin reconèixer de forma més ràpida i senzilla la tipologia de bloc que està utilitzant.",
    "BLOCKLY_OVERCOME_LI2_TITLE": "Discapacitat motriu:",
    "BLOCKLY_OVERCOME_LI2_TEXT": "La manipulació de blocs és sovint més senzilla que teclejar codi, especialment com adaptacions de ratolí o teclat. La funció d'arrossegar i deixar anar pot ser substituïda per navegació per teclat per a aquells que no poden usar un ratolí.",
    "BLOCKLY_OVERCOME_LI3_TITLE": "Discapacidad cognitiva i d'aprenentatge:",
    "BLOCKLY_OVERCOME_LI3_TEXT": "La representació visual del codi redueix la càrrega cognitiva, al no requerir memoritzar sintaxi complexa. Els blocs guien a l'usuari a través de l'estructura lògica del programa.",
    "BLOCKLY_CHALLENGES_TITLE": "Desafiaments Actuals:",
    "BLOCKLY_CHALLENGES_LI1_TITLE": "Lectors de Pantalla:",
    "BLOCKLY_CHALLENGES_LI1_TEXT": "Sovint, les interfícies d'arrossegar i deixar anar no són totalment compatibles amb els lectors de pantalla, la qual cosa dificulta la interacció per a persones cegues o amb baixa visió severa.",
    "BLOCKLY_CHALLENGES_LI2_TITLE": "Navegació per Teclat:",
    "BLOCKLY_CHALLENGES_LI2_TEXT": "La navegació completa i eficient només amb teclat no sempre està implementada a la perfecció en totes les plataformes de programació per blocs.",
    "BLOCKLY_CHALLENGES_LI3_TITLE": "Personalització:",
    "BLOCKLY_CHALLENGES_LI3_TEXT": "La manca d'opcions de personalització (mida de font, contrast de color, eliminació d'animacions) pot afectar a usuaris amb diverses necessitats visuals o cognitives.",
    "BLOCKLY_CHALLENGES_LI4_TITLE": "Documentació i Exemples:",
    "BLOCKLY_CHALLENGES_LI4_TEXT": "No sempre es disposa de documentació i exemples de projectes que estiguin dissenyats específicament pensant en l'accessibilitat.",
    "PYTHON_TITLE": "Programació per Codi (Micro:bit Python Editor)",
    "PYTHON_P1": "Enfront de la programació mitjançant blocs pot utilitzar-se la programació mitjançant codi (microPython o JavaScript). Aquesta programació, en tractar-se de text pla, és altament accessible per als lectors de pantalla.",
    "PYTHON_P2": "El problema que representa aquesta programació és que els usuaris han de tenir un coneixement mínim del llenguatge de programació, per la qual mara se'ls ha d'ensenyar el llenguatge i els conceptes alhora. Això no succeeix amb la programació per blocs en no ser necessari un coneixement del llenguatge i on es treballen principalment els conceptes de programació com variables, constants, bucles, etcètera.",
    "PYTHON_P3": "L'únic procediment en l'actualitat per minimitzar aquesta frontera (coneixement del llenguatge) és la creació de blocs de programació on l'alumne només hagi de substituir o completar part de codi. La creació en codi de l'esquelet dels blocs de programació seria l'única opció actual per assegurar un accés del 100% mitjançant un lector de pantalla.",
    "PYTHON_P4": "Fomentar la programació accessible no només beneficia a les persones amb discapacitat, sinó que millora l'experiència per a tots els usuaris, promovent una cultura de disseny inclusiu en l'àmbit de la tecnologia.",
    "PYTHON_P5": "A continuació es mostren dos exemples, un exemple on la resposta de la Micro:bit només es fa mitjançant el display i un altre, més accessible, on la sortida de la informació es realitza mitjançant el display i es reforça amb una sortida sonora.",
    "MODAL_NON_ACCESSIBLE_TITLE": "Exemple No Accessible",
    "MODAL_CLOSE": "Tancar",
    "MODAL_NON_ACCESSIBLE_H2": "Videoclip (No Accessible)",
    "MODAL_NON_ACCESSIBLE_P": "Aquí aniria el videoclip de l'exemple no accessible.",
    "MODAL_VIEW_CODE": "Veure Codi",
    "MODAL_ACCESSIBLE_TITLE": "Exemple Accessible",
    "MODAL_ACCESSIBLE_H2": "Videoclip (Accessible)",
    "MODAL_ACCESSIBLE_P": "Aquí aniria el videoclip de l'exemple accessible.",
    "MODAL_CODE_TITLE": "Codi"
  },
  "ACCESSIBILITY_EVALUATOR_TITLE": "Evaluador de accesibilidad",
  "MICROPYTHON_PAGE": {
    "H1": "Curso de Programación en MicroPython para Micro:bit (Énfasis en Accesibilidad)",
    "H2_INTRO": "Introducción a MicroPython y Micro:bit",
    "P_INTRO": "Este curso te introducirá al emocionante mundo de la programación con MicroPython en la placa Micro:bit. Aprenderás a crear proyectos interactivos, con un enfoque especial en cómo hacerlos accesibles para todos los usuarios, independientemente de sus capacidades. La Micro:bit es una pequeña computadora programable diseñada para hacer que el aprendizaje de la programación sea divertido y accesible. Con MicroPython, un dialecto optimizado de Python para microcontroladores, podrás escribir código de manera sencilla y eficiente.",
    "H2_MODULE1": "Módulo 1: Primeros Pasos y Salidas Accesibles",
    "H3_MODULE1_BASIC": "Conceptos Básicos de MicroPython",
    "P_MODULE1_BASIC": "Lorem ipsum dolor sit amet, consectetur adipiscing elit. Sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat.",
    "H3_MODULE1_LED": "Mostrando Texto en la Pantalla LED (con consideraciones de Accesibilidad)",
    "P_MODULE1_LED": "Aprenderemos a usar la matriz de LEDs de la Micro:bit para mostrar mensajes. Es crucial considerar que los usuarios con discapacidad visual podrían no percibir esta salida. Más adelante, exploraremos métodos alternativos para comunicar la información.",
    "H2_MODULE2": "Módulo 2: Entradas Interactivas y Retroalimentación Multisensorial",
    "H3_MODULE2_INPUTS": "Uso de Botones y Entradas Digitales",
    "P_MODULE2_INPUTS": "Exploraremos cómo los botones A y B, así como las entradas digitales, pueden ser utilizados para interactuar con nuestros programas. Para la accesibilidad, consideraremos cómo estas entradas pueden ser adaptadas o complementadas.",
    "H3_MODULE2_SOUND": "Integrando Sonido para Retroalimentación",
    "P_MODULE2_SOUND": "La retroalimentación auditiva es fundamental para la accesibilidad. Aprenderemos a usar el zumbador (o altavoz externo) para proporcionar sonidos que refuercen la información visual o la sustituyan completamente para usuarios con discapacidad visual. Por ejemplo, si un juego requiere que el usuario presione un botón, una combinación de una flecha visual en la pantalla LED y un sonido distintivo al presionar el botón puede mejorar significativamente la experiencia para todos.",
    "H2_MODULE3": "Módulo 3: Sensores y Adaptaciones para Diversidad Funcional",
    "H3_MODULE3_SENSORS": "Lectura de Sensores (Acelerómetro, Brújula, Temperatura)",
    "P_MODULE3_SENSORS": "La Micro:bit cuenta con varios sensores incorporados que nos permiten interactuar con el entorno. Aprenderemos a leer datos del acelerómetro (para detectar movimiento), la brújula (para la orientación) y el sensor de temperatura.",
    "H3_MODULE3_ADAPTATIONS": "Adaptaciones de Sensores para Accesibilidad",
    "P_MODULE3_ADAPTATIONS": "Analizaremos cómo los datos de los sensores pueden ser utilizados para crear interacciones alternativas. Por ejemplo, un programa que se activa al inclinar la Micro:bit podría ser más accesible para personas con movilidad reducida que un botón tradicional. Además, veremos cómo la información obtenida de los sensores puede ser traducida a salidas multisensoriales (visual, auditiva, táctil).",
    "H2_CONCLUSIONS": "Conclusiones y Próximos Pasos",
    "P_CONCLUSIONS": "Este curso ha cubierto las bases de la programación en MicroPython con un fuerte énfasis en el diseño accesible. Recuerda que la accesibilidad no es una característica adicional, sino un principio fundamental para crear tecnología inclusiva. ¡Anímate a explorar más proyectos y a seguir aprendiendo cómo hacer la tecnología accesible para todos!"
  },
  "REPOSITORIO_PAGE": {
    "CONTENT": "Contenido de la página Repositorio."
  },
  "ACCESSIBILITY_EVALUATOR_PAGE": {
    "H2": "Editor de Código MicroPython con Énfasis en Accesibilidad",
    "P": "Introduce tu código MicroPython para Micro:bit en el área de texto. El editor te ayudará a visualizar cómo se ve el código y te permitirá comprobar su accesibilidad.",
    "TEXTAREA_PLACEHOLDER": "Escribe tu código MicroPython aquí...",
    "EVALUATION_RESULTS_H3": "Resultado de la evaluación",
    "SCORE": "Puntuación",
    "IMPROVEMENT": "Mejora",
    "REDUNDANCY_DETECTED": "Redundancia de entrada detectada",
    "YES": "Sí",
    "NO": "No",
    "ERRORS": "Errores",
    "WARNINGS": "Advertencias",
    "CODE_PREVIEW_H3": "Previsualización del Código",
    "NO_BUTTONS_USED": "No s'utilitzen els botons"
  },
  "VALIDATOR": {
    "AUDIO_FEEDBACK": {
      "SUCCESS_MESSAGE": "Multimodalidad: S'ha detectat la importació d'àudio.",
      "SUCCESS_MESSAGE_2": "Multimodalidad: S'ha detectat la sortida d'àudio.",
      "ERROR_MESSAGE": "Falta sortida de so.",
      "ERROR_SUGGESTION": "Afegeix 'speech.say('[string]')', 'music.play(music.[song])' o 'music.([number])' perquè els usuaris amb discapacitat visual rebin informació.",
      "ERROR_SUGGESTION_2": "Importa 'speech' o 'music' perquè els usuaris amb discapacitat visual rebin informació.",
      "MISSING_AUDIO_OUTPUT_WITH_DISPLAY_SHOW": "Només fas servir display.show() sense sortida d'àudio.",
      "SUGGEST_AUDIO_OUTPUT_WITH_DISPLAY_SHOW": "Afegeix 'import speech' o 'import music' i utilitza 'speech.say()' o 'music.play()' per proporcionar retroalimentació auditiva als usuaris amb discapacitat visual."
    },
    "BLOCKING_LOOPS": {
      "WARNING_MESSAGE": "S'ha detectat un bucle de bloqueig.",
      "WARNING_SUGGESTION": "Fas servir sleep() molt llargs. Això impedeix que la Micro:bit reaccioni ràpidament als botons o a les ordres de veu."
    },
    "INPUT_REDUNDANCY": {
      "SUCCESS_MESSAGE": "Entrada accessible: Utilitzes sensors tàctils o de moviment.",
      "ERROR_MESSAGE": "Només fas servir botons físics.",
      "ERROR_SUGGESTION": "Afegeix 'pin_logo.is_touched()' per facilitar l'ús a persones amb dificultat motriu."
    },
    "COMPLEX_PRESSES": {
      "WARNING_MESSAGE": "S'ha detectat una premuda complexa.",
      "WARNING_SUGGESTION": "Evita sol·licitar la premuda simultània de dos botons o un botó i el logotip, ja que dificulta la interacció per a usuaris amb certes discapacitats motrius.",
      "SUCCESS_MESSAGE": "Premudes simples: No s'han detectat premudes complexes."
    },
    "CODE_SEMANTICS": {
      "SUCCESS_MESSAGE": "Semàntica: Les variables tenen noms descriptius.",
      "WARNING_MESSAGE": "Noms de variables genèrics.",
      "WARNING_SUGGESTION": "Utilitza noms com 'estat_alarma' en lloc de 'a' per facilitar la lectura amb lectors de pantalla."
    }
  }
}
