{
  "CLOSE": "Close",
  "ACCESSIBILITY": {
    "LANGUAGE_BUTTON_LABEL": "Current language {{language}} press to change language"
  },
  "TABS": {
    "MICROPYTHON": "MicroPython",
    "MICROBIT": "Micro:bit",
    "MICROIA": "MicroIA",
    "REPOSITORIO": "Repository"
  },
  "MICROBIT_PAGE": {
    "TITLE": "Micro:bit Projects",
    "OPEN_PROJECT_PREFIX": "Open project ",
    "PROJECTS": {
      "ACCESSIBLE_PROGRAMMING": {
        "TITLE": "Accessible Programming",
        "DESCRIPTION": "Explore Micro:bit programming in an accessible way.",
        "img": "assets/img/microbit-a11y.png",
        "alt": ""
      },
      "COUNTDOWN": {
        "TITLE": "The Final Countdown",
        "DESCRIPTION": "A customizable countdown.",
        "img": "assets/img/final-countdown.png",
        "alt": ""
      },
      "DUEL": {
        "TITLE": "Duel in the Sun",
        "DESCRIPTION": "A reflex game for two players.",
        "img": "assets/img/duel.png",
        "alt": ""
      },
      "STONE_PAPER_SCISSORS": {
        "TITLE": "Rock, Paper, Scissors",
        "DESCRIPTION": "The classic game, now on your Micro:bit.",
        "img": "assets/img/rps.png",
        "alt": ""
      },
      "SECRET_MESSAGE": {
        "TITLE": "Secret Message",
        "DESCRIPTION": "Send and receive secret messages.",
        "img": "assets/img/secret.png",
        "alt": ""
      },
      "HEARTBEAT": {
        "TITLE": "The Micro:bit's Heartbeat",
        "DESCRIPTION": "Visualize your board's heartbeat.",
        "img": "assets/img/heart.png",
        "alt": ""
      }
    }
  },
  "DUEL_PAGE": {
    "TITLE": "Duel in the Sun",
    "VIDEO_NOT_SUPPORTED": "Your browser does not support the video tag.",
    "INTRODUCTION_TITLE": "Introduction",
    "INTRODUCTION_TEXT": "This project teaches you how to create a reflex game for two players on the Micro:bit. Get ready for the duel!",
    "MATERIALS_TITLE": "Materials",
    "MATERIALS_LIST": [
      "2 Micro:bits",
      "Laptop",
      "USB-A connection cable",
      "Python Editor"
    ],
    "TARGET": "Objective",
    "TARGET_TEXT_1": "Create a simple reflex game for two players using two Micro:bits.",
    "TARGET_TEXT_2": "Practice programming loops, conditionals, and interaction between Micro:bits.",
    "STEPS_TITLE": "Programming Steps",
    "STEP_1_TITLE": "Step 1: The Start of the Duel",
    "STEP_1_TEXT": "We will start by programming the basic game logic, where players must react quickly.",
    "STEP_1_TEXT_1": "To do this, we will introduce a countdown function and a mechanism to detect button presses.",
    "STEP_1_TEXT_2": "Here is the first code snippet for the initial countdown:",
    "STEP_1_TEXT_3": "This code will display a countdown on the Micro:bit's screen and emit a sound.",
    "STEP_1_TEXT_4": "After the countdown, the Micro:bit must wait for one of the players to press button A or B.",
    "STEP_1_TEXT_5": "The following code snippet handles button press detection:",
    "STEP_1_TEXT_6": "These lines detect which button is pressed first and display an arrow in the corresponding direction.",
    "STEP_2_TITLE": "Step 2: Improving Interactivity",
    "STEP_2_TEXT": "Now we will add elements to make the game more dynamic and interactive.",
    "STEP_2_TEXT_1": "Sound integration for feedback:",
    "STEP_2_TEXT_2": "The sound will help players know when the countdown begins and ends, and who pressed first.",
    "STEP_2_TEXT_3": "We will also add a variable to control the game state, such as whether the duel is active or not.",
    "STEP_2_TEXT_4": "Here is the updated code with the sound and game state logic:",
    "STEP_2_TEXT_5": "This step is crucial for an accessible gaming experience.",
    "STEP_3_TITLE": "Step 3: Connecting the Micro:bits",
    "STEP_3_TEXT": "The duel will be more exciting if the two Micro:bits can communicate with each other.",
    "STEP_3_TEXT_1": "We will use the radio module to send signals between the two Micro:bits.",
    "STEP_3_TEXT_2": "First, we configure the radio channel so that the Micro:bits can find each other:",
    "STEP_3_TEXT_3": "This code snippet initializes the radio and configures it to a specific group.",
    "STEP_3_TEXT_4": "Now, when a player presses a button, their Micro:bit will send a message to the other.",
    "STEP_3_TEXT_5": "The following code shows how to send and receive these messages:",
    "STEP_3_TEXT_6": "The Micro:bit that receives the message must know that the other player has reacted.",
    "STEP_3_TEXT_7": "We will manage the duel result based on who presses first and who receives the message.",
    "STEP_3_TEXT_8": "Here is the code for sending and receiving messages logic:",
    "STEP_3_TEXT_9": "This logic determines the winner of each duel round.",
    "STEP_3_TEXT_10": "Radio communication is fundamental for the game's dynamic.",
    "STEP_4_TITLE": "Step 4: Adding Scoring and Multiple Rounds",
    "STEP_4_TEXT": "To make the game more competitive, we will add a scoring system and the possibility of playing multiple rounds.",
    "STEP_4_TEXT_1": "We will declare variables for each player's scores and for the number of rounds played.",
    "STEP_4_TEXT_2": "The game will end after a predefined number of rounds, and the winner will be the one with the highest score.",
    "STEP_4_TEXT_3": "Here is the code to manage scoring and rounds:",
    "STEP_4_TEXT_4": "These variables will be updated after each round.",
    "STEP_4_TEXT_5": "We also need a way to restart the game for a new match.",
    "STEP_4_TEXT_6": "The reset function will be responsible for resetting scores and rounds.",
    "STEP_4_TEXT_7": "Code to restart the game:",
    "STEP_4_TEXT_8": "This will allow playing several games without having to restart the Micro:bits.",
    "STEP_4_TEXT_9": "The visible score on each Micro:bit will help players follow the progress.",
    "STEP_4_TEXT_10": "We will adjust the visual and auditory outputs to announce the final winner.",
    "STEP_4_TEXT_11": "The final code should integrate all these parts for a complete and functional game.",
    "STEP_4_TEXT_12": "This scoring system adds a competitive element to the duel.",
    "STEP_5_TITLE": "Step 5: Accessibility Considerations",
    "STEP_5_TEXT": "To make 'Duel in the Sun' truly accessible, we must think about users with various needs.",
    "STEP_5_TEXT_1": "We will implement multisensory feedback, using not only the LED screen but also clear and distinctive sounds for each action and game outcome.",
    "STEP_5_TEXT_2": "For example, a high-pitched sound for victory and a low-pitched sound for defeat, along with visual indicators.",
    "STEP_5_TEXT_3": "We will also consider alternatives to physical buttons, such as tilt or shake detection of the Micro:bit for player reaction.",
    "STEP_5_TEXT_4": "This will allow players with reduced mobility to participate.",
    "STEP_5_TEXT_5": "The code will need to account for these alternative inputs.",
    "STEP_6_TITLE": "Step 6: Debugging and Testing",
    "STEP_6_TEXT": "Once the code is complete, it is essential to debug and test it rigorously.",
    "STEP_6_TEXT_1": "We will perform tests with both Micro:bits to ensure that radio communication works correctly.",
    "STEP_6_TEXT_2": "We will verify that the countdown, button detection, and scoring logic work as expected.",
    "STEP_6_TEXT_3": "We will also perform accessibility tests to ensure that multisensory feedback is effective.",
    "STEP_6_TEXT_4": "Ask different people to test the game to get varied feedback.",
    "STEP_6_TEXT_5": "We will adjust any errors or usability issues detected during testing.",
    "STEP_6_TEXT_6": "Debugging is an iterative step that guarantees the quality of the game.",
    "STEP_6_TEXT_7": "Once everything is properly tested, your 'Duel in the Sun' will be ready!",
    "STEP_6_TEXT_8": "This testing process is vital for the quality and accessibility of the project.",
    "STEP_7_TITLE": "Step 7: Customization and Improvements",
    "STEP_7_TEXT": "You have built a basic duel game. Now it's time to customize it and add your own ideas.",
    "STEP_7_TEXT_1": "You could add more rounds, different types of feedback, or even a single-player mode against the Micro:bit.",
    "STEP_8_TITLE": "Step 8: Complete Code",
    "STEP_8_TEXT": "Here is the complete code for the 'Duel in the Sun' project for the Micro:bit.",
    "STEP_8_TEXT_1": "This code integrates all the functionalities described in the previous steps, from the countdown to the duel logic and radio communication between two Micro:bits.",
    "STEP_8_TEXT_2": "It is designed to be a starting point for future experiments and customizations.",
    "STEP_8_TEXT_3": "It includes the configuration of the radio module, the management of button presses by players, and the logic to determine the winner of each round.",
    "STEP_8_TEXT_4": "It also incorporates a basic scoring system to track game progress and announce a final winner.",
    "STEP_8_TEXT_5": "Accessibility considerations have been taken into account, providing multisensory feedback and flexible input options.",
    "STEP_8_TEXT_6": "This project serves as an excellent example of how to combine the capabilities of the Micro:bit with accessible design principles.",
    "STEP_8_TEXT_7": "Make it your own and explore all the possibilities it offers!",
    "STEP_9_TITLE": "Step 9: Download the .hex File",
    "STEP_9_TEXT": "If you don't want to program it yourself, you can download the already compiled .hex file to upload it directly to your Micro:bit.",
    "STEP_9_TEXT_1": "This file contains the 'Duel in the Sun' game code ready to use.",
    "STEP_9_TEXT_2": "You just need to connect the Micro:bit to the computer and drag the .hex file to the drive that appears.",
    "STEP_10_TITLE": "Step 10: Playing the Duel!",
    "STEP_10_TEXT": "Now that you have the code on your Micro:bit, it's time to play! Find a friend with another Micro:bit and enjoy the 'Duel in the Sun'.",
    "STEP_11_TITLE": "Step 11: Suggestions for Future Improvements",
    "STEP_11_TEXT": "Here are some ideas to take your 'Duel in the Sun' to the next level:",
    "STEP_12_TITLE": "Step 12: Additional Resources",
    "STEP_12_TEXT": "To delve deeper into Micro:bit programming and accessibility, consult the following resources:",
    "STEP_12_TEXT_1": "Official Micro:bit documentation: [link to documentation]",
    "STEP_12_TEXT_2": "Accessibility guides in programming: [link to guides]",
    "STEPS_TITLE_2": "Complete code",
    "STEPS_TEXT_2": "Download the .hex file",
    "STEPS_TITLE_3": "Evolve the code",
    "STEP_13_TEXT": "Modify the code to create game variations, add new modes, or integrate it with other projects."
  },
  "HEART_PAGE": {
    "TITLE": "The Micro:bit's Heartbeat",
    "VIDEO_NOT_SUPPORTED": "Your browser does not support the video tag.",
    "INTRODUCTION_TITLE": "Introduction",
    "INTRODUCTION_TEXT": [
      "This project allows us to visualize the Micro:bit's heartbeat and experiment with heart rate.",
      "We will learn to use the LED screen for visual representations and to integrate sounds for multisensory feedback.",
      "We will discover how the 'beat' rhythm can be varied using different controls and programming.",
      "Get ready to feel the pulse of your Micro:bit!"
    ],
    "MATERIALS_TITLE": "Materials",
    "MATERIALS_LIST": [
      "1 Micro:bit",
      "Laptop",
      "USB-A connection cable",
      "Python Editor"
    ],
    "STEPS_TITLE": "Programming Steps",
    "STEP_1_TITLE": "Step 1: The Heart Comes to Life",
    "STEP_1_TITLE_1": "The Basic Beat",
    "STEP_1_TEXT": "We will start by programming a simple animation of a beating heart on the Micro:bit's LED screen.",
    "STEP_1_TITLE_2": "Adding Sound to the Beat",
    "STEP_1_TEXT_1": "To make the beat more realistic and accessible, we will add a sound every time the heart lights up.",
    "STEP_1_TEXT_2": [
      "We will import the 'music' module to be able to play musical notes.",
      "The sound should be clear and distinctive, replicating the 'lub-dub' of a real heartbeat."
    ],
    "STEP_1_TEXT_3": "Here is the code to integrate sound with the heart animation:",
    "STEP_1_TITLE_3": "Controlling the Rhythm",
    "STEP_1_TEXT_4": "Now that the heart beats and sounds, we want to be able to control its rhythm. We will introduce a 'beats' variable to adjust the beat speed.",
    "STEP_1_TEXT_5": [
      "This variable will control the waiting time between each 'beat' and the duration of musical notes.",
      "We will experiment with different values to find the right rhythm."
    ],
    "STEP_1_TITLE_4": "Button Interaction",
    "STEP_1_TEXT_6": [
      "We will make the Micro:bit's A and B buttons allow users to increase or decrease the beat speed.",
      "Pressing button A could speed up the heart, while button B could slow it down."
    ],
    "STEP_1_TEXT_7": "Code for button interaction:",
    "STEP_1_TEXT_8": "This will allow an interactive experience where the user controls their virtual 'heart'.",
    "STEP_1_TITLE_5": "Speed Limits",
    "STEP_1_TEXT_9": [
      "To avoid unrealistically fast or slow beat rhythms, we will set limits for the 'beats' variable.",
      "The heart should not be able to stop completely or go at a speed that cannot be perceived."
    ],
    "STEP_1_TEXT_10": [
      "These restrictions ensure that the game stays within logical and playable parameters.",
      "We will implement conditionals to ensure that the 'beats' variable remains within the desired range."
    ],
    "STEP_1_TITLE_6": "Visual Feedback",
    "STEP_1_TEXT_11": [
      "In addition to the heart animation, we will use the LED screen to display the current beat speed, or other relevant visual indicators.",
      "We could display a number representing beats per minute (BPM)."
    ],
    "STEP_1_TEXT_12": [
      "This visual feedback complements the auditory one, making the project more informative."
    ],
    "STEP_1_TITLE_7": "BPM Calculation",
    "STEP_1_TEXT_13": "To display beats per minute (BPM), we will need to perform a small calculation based on the 'beats' variable.",
    "STEP_1_TEXT_14": "The formula to calculate BPM from the time between beats (in milliseconds) is: BPM = 60000 / time_between_beats.",
    "STEP_1_TITLE_8": "Heart Rate Table",
    "STEP_1_TEXT_15": "Here is a reference table for heart rates, useful for adjusting the rhythm of your Micro:bit 'heart':",
    "TABLE_TITLE": "Heart Rate (BPM)",
    "TABLE_HD_1": "Beats per Minute",
    "TABLE_HD_2": "Time between Beats (seconds)",
    "TABLE_HD_3": "Time between Beats (milliseconds)",
    "STEP_1_TEXT_16": [
      "This table will help you understand how 'beats' values correlate with a real heart rate.",
      "You can use these values to program specific rhythms or to validate your beat simulator."
    ],
    "FORMULA_ALT_TEXT": "Formula for calculating heart rate.",
    "FORMULA_ALT_TEXT_2": "Image representing the sun",
    "FORMULA_ALT_TEXT_3": "Heart rate formula",
    "STEP_1_TEXT_17": "This illustration shows the formula used to convert time between beats to beats per minute (BPM).",
    "STEP_1_TITLE_9": "Health Monitoring",
    "STEP_1_TEXT_18": [
      "We could add logic to simulate health conditions, where the heart changes color or emits an alarm sound if the rhythm is too high or low.",
      "This could be an educational project on heart health."
    ],
    "STEP_1_TEXT_19": "The code could change the LED color or the displayed image if the BPM goes out of a healthy range.",
    "STEP_1_TITLE_10": "Auditory and Visual Alerts",
    "STEP_1_TEXT_20": "We will implement auditory and visual alerts if the simulated heart rate enters risk zones.",
    "STEP_1_TEXT_21": [
      "For example, a high-pitched sound and a skull on the screen if the heart 'stops'.",
      "These alerts improve accessibility and clarity of information."
    ],
    "STEP_1_TITLE_11": "Multiple Screens (Optional)",
    "STEP_1_TEXT_22": "If we have several Micro:bits, we could have one act as a heart monitor and the other as a control interface, communicating by radio.",
    "STEP_1_TEXT_23": [
      "One Micro:bit could display only the BPM and the other the heart visualization and controls.",
      "This would introduce the concept of wireless communication between devices."
    ],
    "STEP_1_TEXT_24": [
      "Radio communication would allow greater complexity and functionality to the project.",
      "Here is an example of how the code could be structured for this setup:"
    ],
    "STEP_1_TEXT_25": [
      "This code would distribute tasks between two Micro:bits, simulating a remote monitoring system."
    ],
    "STEP_1_TITLE_12": "Project Completion",
    "STEP_1_TEXT_26": [
      "Once all functionalities are implemented, we will thoroughly test the project to ensure that everything works correctly and that the user experience is optimal.",
      "We will make adjustments until the 'beat' is perfect."
    ],
    "STEP_1_TEXT_27": "Ensure that visual and auditory feedback is well synchronized.",
    "STEP_1_TEXT_28": "Your 'Micro:bit Heartbeat' is ready!",
    "STEP_1_TITLE_13": "Advanced Customization",
    "STEP_1_TEXT_29": "Experiment with different heart animations, custom sounds or add more sensors for an even more immersive experience.",
    "STEP_2_TITLE": "Step 2: The Code",
    "STEP_2_TEXT": "Download the already compiled .hex file to upload it directly to your Micro:bit.",
    "STEP_3_TITLE": "Step 3: Evolve the Code",
    "STEP_3_TEXT": "Modify the code to create a complete musical rhythm, a rhythm reaction game, or connect it to other projects!"
  },
  "SECRET_MESSAGE_PAGE": {
    "VIDEO_NOT_SUPPORTED": "Your browser does not support the video tag.",
    "MORSE_CODE_CAPTION": "Morse Code Alphabet",
    "INTRODUCTION_TITLE": "Introduction",
    "INTRODUCTION_TEXT": "This project teaches you how to use the Micro:bit to send and receive secret messages using Morse code.",
    "INTRODUCTION_TEXT_1": "You will learn to transform text into sequences of lights and sounds, and decipher them again. Ready for digital espionage?",
    "TARGET_TITLE": "Objective",
    "TARGET_TEXT": "Create a functional and accessible Morse code communicator using the Micro:bit, capable of sending and receiving messages in an accessible way.",
    "MATERIALS_TITLE": "Materials",
    "MATERIALS_LIST": [
      "2 Micro:bits (for communication between them)",
      "Computer with USB connection",
      "USB data cable",
      "Python Editor"
    ],
    "STEPS_TITLE": "Programming Steps",
    "STEP_1_TITLE": "Step 1: Morse Code Preparation",
    "STEP_1_TEXT": "We will start by defining the Morse code alphabet in Python. Each letter and number will have a representation in dots (.) and dashes (-).",
    "STEP_1_TEXT_1": "For example, the letter 'A' is '.-', 'B' is '-...' and '1' is '.----'.",
    "STEP_1_TEXT_2": "We will use a dictionary to store these conversions, which will facilitate the translation of text to Morse code and vice versa.",
    "STEP_1_TEXT_3": "Here is the initial snippet to build the Morse alphabet:",
    "STEP_1_TEXT_4": "This code establishes the bases for encoding and decoding our messages.",
    "STEP_1_TEXT_5": "We will also add definitions for numbers and some basic punctuation marks to enrich our communications.",
    "STEP_1_TEXT_6": "Here is the complete Morse alphabet code:",
    "STEP_1_TEXT_7": "This is the key to the entire secret messaging project. It is important that all characters we want to use are correctly defined.",
    "STEP_1_TEXT_8": "Once we have the complete dictionary, we can start working on the encoding and decoding functions.",
    "STEP_1_TEXT_9": "This first part is fundamental for creating the Morse translator.",
    "STEP_1_TITLE_2": "Step 2: Text to Morse Code Translation",
    "STEP_1_TEXT_11": "Now we will create a function that takes a text message and converts it to its Morse code representation. The function will have to go through each character of the message, find its equivalent in the Morse dictionary and concatenate it to a resulting string.",
    "STEP_1_TEXT_12": "We will also have to consider how to separate characters and words in Morse code (normally with spaces between characters and ' / ' between words).",
    "STEP_1_TEXT_13": "Here is the code for the 'text_to_morse' function:",
    "STEP_1_TEXT_14": "This function will be the heart of our ability to send secret messages.",
    "STEP_1_TEXT_15": "To test it, we can use a simple message like 'HOLA' and see if the output is '.... --- .-.. .-'",
    "STEP_1_TEXT_16": "This part is crucial for converting our words into the secret language.",
    "STEP_1_TEXT_17": "Be sure to test the function with different types of messages to verify its robustness.",
    "STEP_1_TITLE_3": "Step 3: Sending Morse Code (Visual and Auditory)",
    "STEP_1_TEXT_18": "Once we have the message in Morse code, we need a way to send it. To make it accessible, we will use both the Micro:bit's LED screen (visual) and sound (auditory).",
    "STEP_1_TEXT_19": "A 'dash' (-)' will be represented by a longer lit LED and a longer sound tone. A 'dot' ('.') by a shorter lit LED and a shorter sound tone. A space between characters will be a brief pause, and a space between words, a longer pause.",
    "STEP_1_TEXT_20": "Here is the 'send_morse_signal' function:",
    "STEP_1_TEXT_21": "This function will turn our Micro:bit into a multisensory Morse signal emitter.",
    "STEP_1_TEXT_22": "It is important to adjust the duration times for dots, dashes and pauses so that they are easily distinguishable.",
    "STEP_1_TEXT_23": "The combination of visual and auditory signals significantly improves the accessibility of the project.",
    "STEP_1_TEXT_24": "This is the function that transforms the code into an interactive experience.",
    "STEP_1_TITLE_4": "Step 4: Receiving and Decoding Morse Code",
    "STEP_1_TEXT_25": "The most challenging part is reception. Since the Micro:bit does not have a microphone input to detect Morse sounds, we will simulate reception with buttons A and B, or with a touch sensor.",
    "STEP_1_TEXT_26": "Button A can simulate a 'dot' and button B a 'dash'. We will detect button presses and the duration of each press to reconstruct the Morse code.",
    "STEP_1_TEXT_27": "We will also create a 'morse_to_text' function that will do the inverse process: take a Morse code sequence and convert it back into readable text.",
    "STEP_1_TEXT_28": "Here is the code for reception and decoding:",
    "STEP_1_TEXT_29": "This logic will allow us to 'read' the secret messages sent by other Micro:bits.",
    "STEP_1_TEXT_30": "The decoding function will use the inverse Morse dictionary to translate the sequences of dots and dashes into letters and words.",
    "STEP_1_TEXT_31": "It is crucial to correctly manage the times between button presses to differentiate between dots, dashes and spaces.",
    "STEP_1_TEXT_32": "This part is what allows us to decipher the messages.",
    "STEP_1_TITLE_5": "Step 5: Complete Interaction with Radio (Optional)",
    "STEP_1_TEXT_33": "For a complete secret messaging experience, two Micro:bits can communicate by radio. One would send the Morse code and the other would receive and decode it.",
    "STEP_1_TEXT_34": "The transmitting Micro:bit would use 'radio.send()' and the receiving one 'radio.receive()'. This adds a level of realism and functionality to the project.",
    "STEP_1_TEXT_35": "Here is an example of how to integrate the radio:",
    "STEP_1_TEXT_36": "This would allow wireless communication between devices.",
    "STEP_1_TEXT_37": "It is important to ensure that both Micro:bits are configured to the same radio group and that the transmission speed is appropriate.",
    "STEP_1_TEXT_38": "Radio communication opens the door to many other applications.",
    "STEP_1_TITLE_6": "Step 6: Accessibility Improvements",
    "STEP_1_TEXT_39": "To make the Morse communicator even more accessible, we could add:",
    "TRANSFORMANT_LIST": [
      "Vibration: For users with hearing impairment, the Micro:bit could vibrate instead of making a sound.",
      "Enlarged display: Show the decoded message on a larger external screen.",
      "Alternative input: Use motion sensors (accelerometer) to simulate dots and dashes, facilitating use for people with fine motor difficulties."
    ],
    "STEP_1_TEXT_40": "These improvements would ensure that the project is useful for a wider range of users.",
    "STEP_1_TEXT_41": "The implementation of these functions requires careful consideration of the different types of feedback that can be provided.",
    "STEP_1_TEXT_42": "Inclusion by design is the key to successful projects.",
    "STEP_1_TITLE_7": "Step 7: Debugging and Testing",
    "STEP_1_TEXT_43": "It is vital to test each part of the code independently and then together. Send test messages, both simple and complex, to ensure that encoding, sending, receiving and decoding work perfectly.",
    "STEP_1_TEXT_44": "Adjust times and pauses as necessary to optimize signal clarity.",
    "STEP_1_TEXT_45": "Debugging is an iterative process that ensures the quality of your Morse communicator.",
    "STEP_1_TITLE_8": "Step 8: Complete Code",
    "STEP_1_TEXT_46": "Here is the complete code for the 'Secret Message' project for the Micro:bit.",
    "STEP_1_TEXT_47": "This code integrates all the functionalities described in the previous steps, from the definition of the Morse alphabet to the sending and receiving of messages.",
    "STEP_1_TEXT_48": "It is designed to be a starting point for future experiments and customizations.",
    "STEP_1_TITLE_9": "Step 9: Download the .hex File",
    "STEP_1_TEXT_49": "If you don't want to program it yourself, you can download the already compiled .hex file to upload it directly to your Micro:bit.",
    "STEP_1_TEXT_50": "This file contains the 'Secret Message' game code ready to use. You just need to connect the Micro:bit to the computer and drag the .hex file to the drive that appears.",
    "STEP_1_TEXT_51": "This will allow you to test the project immediately.",
    "STEP_2_TITLE": "Step 10: Evolve the Code",
    "STEP_2_TEXT": "Modify the code to create more complex encryption, add new input/output methods, or integrate it with other communication projects."
  },
  "RPS_PAGE": {
    "TITLE": "Rock, Paper, Scissors",
    "VIDEO_NOT_SUPPORTED": "Your browser does not support the video tag.",
    "INTRODUCTION_TITLE": "Introduction",
    "INTRODUCTION_TEXT": "This project teaches you how to create the classic 'Rock, Paper, Scissors' game on your Micro:bit. Get ready to face artificial intelligence!",
    "INTRODUCTION_TEXT_1": "You will learn to use the LED screen to display the options (rock, paper or scissors) and the buttons to make your choice. We will also incorporate a random number generator for the Micro:bit's decision.",
    "MATERIALS_TITLE": "Materials",
    "MATERIALS_LIST": [
      "1 Micro:bit",
      "Computer with USB connection",
      "USB data cable",
      "Python Editor"
    ],
    "TARGET_TITLE": "Objective",
    "TARGET_TEXT": "Create an accessible and functional 'Rock, Paper, Scissors' game with the Micro:bit, using visual and auditory signals for interaction.",
    "STEPS_TITLE": "Programming Steps",
    "STEP_1_TITLE": "Step 1: Initial Setup and Player Choice",
    "STEP_1_TITLE_2": "Necessary imports",
    "STEP_1_TEXT_1": "First, we will import the necessary modules for the Micro:bit's operation and random number generation.",
    "IMPORTS_LIST": [
      "import microbit",
      "import random"
    ],
    "STEP_1_TEXT_2": "These lines will allow us to interact with the Micro:bit's components and obtain random results.",
    "STEP_1_TITLE_3": "Player choice with buttons",
    "STEP_1_TEXT_3": "The player will make their choice by pressing buttons A or B. Button A can be 'Rock' and button B can be 'Paper'. 'Scissors' will be chosen if both buttons are pressed.",
    "STEP_1_TEXT_4": "We will implement a function that detects which buttons are pressed and assigns a numeric value (0 for Rock, 1 for Paper, 2 for Scissors).",
    "STEP_1_TITLE_4": "Definition of figures",
    "STEP_1_TEXT_5": "We will define the images that will represent rock, paper and scissors on the Micro:bit's LED screen. We will use the LED matrix to draw them simply.",
    "STEP_1_TEXT_6": "Here's how to define the images:",
    "CODE_1_LIST": [
      "rock = microbit.Image.SQUARE",
      "paper = microbit.Image.CHESSBOARD",
      "scissors = microbit.CISSORS"
    ],
    "STEP_1_TEXT_7": "These images will make the game more visual and intuitive.",
    "STEP_1_TITLE_5": "Game logic: Micro:bit's choice",
    "STEP_1_TEXT_8": "The Micro:bit will have to make its own choice randomly. We will use the 'random.randint(0, 2)' function to get a number between 0 and 2, which will represent rock, paper or scissors.",
    "STEP_1_TEXT_9": "This choice will be made every time the player makes their choice, ensuring the game is unpredictable.",
    "STEP_1_TEXT_10": "Here is the code for the Micro:bit's choice:",
    "STEP_1_TEXT_11": "This part is crucial for the interactivity of the game.",
    "STEP_1_TITLE_6": "Determine the winner",
    "STEP_1_TEXT_12": "Now we will implement the logic to determine who wins the round. Remember the rules: Rock beats Scissors, Scissors beats Paper, and Paper beats Rock.",
    "STEP_1_TEXT_13": "We will use a series of conditionals (if/elif/else) to compare the choices of the player and the Micro:bit.",
    "STEP_1_TEXT_14": "Here is the 'determine_winner' function:",
    "STEP_1_TITLE_7": "Show the result",
    "STEP_1_TEXT_15": "Once the winner is determined, we will display the result on the Micro:bit's LED screen. We can use icons (for example, a happy face for winning, a sad one for losing, and a neutral one for a tie).",
    "STEP_1_TEXT_16": "In addition to the icon, we can make the Micro:bit emit a different sound for each result, improving accessibility for users with visual impairments.",
    "STEP_1_TITLE_8": "Main game loop",
    "STEP_1_TEXT_17": "The game will repeat continuously until the user decides to stop it. We will use a 'while True' loop to keep the game active.",
    "STEP_1_TEXT_18": "Inside the loop, we will wait for player input, make the Micro:bit's choice, determine the winner, and display the result.",
    "STEP_1_TEXT_19": "Here is the basic structure of the main loop:",
    "STEP_1_TITLE_9": "Multisensory feedback",
    "STEP_1_TEXT_20": "To improve accessibility, we will add sounds for each action and result. For example, a short sound when choosing an option, a victory sound, a defeat sound and a tie sound.",
    "STEP_1_TEXT_21": "We will use the 'music' module to play simple melodies.",
    "STEP_1_TEXT_22": "This will allow visually impaired users to fully enjoy the game.",
    "STEP_1_TITLE_10": "Sound implementation",
    "STEP_1_TEXT_23": "We will integrate sound functions into the game logic. For example, when the player wins, the victory melody will be played, and so on.",
    "STEP_1_TEXT_24": "It is important that the sounds are distinctive and easy to recognize.",
    "STEP_1_TEXT_25": "This addition will significantly increase the immersion and accessibility of the game.",
    "STEP_1_TITLE_11": "Gesture detection (Optional)",
    "STEP_1_TEXT_26": "As an alternative to buttons, we could use the Micro:bit's accelerometer to detect gestures. For example, shaking the Micro:bit could mean a random choice, or tilting it to one side to choose rock, paper or scissors.",
    "STEP_1_TEXT_27": "This offers a more accessible input option for users with fine motor difficulties.",
    "STEP_1_TITLE_12": "Complete code with gestures",
    "STEP_1_TEXT_28": "Here is an example of how we could integrate gesture detection into our 'Rock, Paper, Scissors' game:",
    "STEP_1_TEXT_29": "This code replaces or complements button inputs with gestures.",
    "STEP_1_TEXT_30": "The 'gest_detection' function would be responsible for reading the accelerometer and translating movements into game choices.",
    "STEP_1_TEXT_31": "This functionality would make the game more versatile and adaptable to different needs.",
    "STEP_1_TEXT_32": "This is how adaptations can improve the gaming experience for everyone.",
    "STEP_1_TEXT_33": "We will consider implementing an 'on_shake' function to detect Micro:bit movement.",
    "STEP_1_TEXT_34": "This function would return one of the three options (Rock, Paper or Scissors) randomly or based on the intensity of the shake.",
    "STEP_1_TEXT_35": "The use of the accelerometer allows for more dynamic interaction and less dependence on physical controls.",
    "STEP_1_TEXT_36": "This is a great addition for the inclusion of all players.",
    "STEP_1_TITLE_13": "Communication with another Micro:bit (Multiplayer)",
    "STEP_1_TEXT_37": "To play against a friend, we can have two Micro:bits communicate by radio. Each player would make their choice on their Micro:bit, and it would send their choice to the other Micro:bit.",
    "STEP_1_TEXT_38": "The receiving Micro:bit would compare the two choices and display the result.",
    "STEP_1_TEXT_39": "This opens the door to an interactive and accessible multiplayer mode.",
    "STEP_1_TITLE_14": "Multiplayer implementation",
    "STEP_1_TEXT_40": "Here's how we could modify the code for multiplayer mode via radio:",
    "STEP_1_TEXT_41": "One Micro:bit would send a message with its choice and the other would receive the message and make the comparison.",
    "STEP_1_TEXT_42": "It is important to configure the same radio group on both Micro:bits.",
    "STEP_1_TEXT_43": "Radio communication is a powerful tool for creating interactive games.",
    "STEP_1_TEXT_44": "This is the key to playing with friends and family.",
    "STEP_1_TITLE_15": "User interface improvements",
    "STEP_1_TEXT_45": "To make the user interface clearer and more accessible, we could:",
    "STEP_1_TEXT_46": "Display more elaborate animations for rock, paper and scissors.",
    "STEP_1_TEXT_47": "Use different sound tones for each player's choice (Rock, Paper, Scissors).",
    "STEP_1_TEXT_48": "This would make the experience richer and more visually appealing.",
    "STEP_1_TITLE_16": "Scoring and rounds",
    "STEP_1_TEXT_49": "We could add a scoring system to keep track of who wins more rounds. Multiple rounds could also be implemented, and the game would end when a player reached a predetermined score.",
    "STEP_1_TEXT_50": "This would increase the replayability and competitiveness of the game.",
    "STEP_1_TEXT_51": "The visible score on the Micro:bit could motivate players.",
    "STEP_1_TITLE_17": "Code for scoring",
    "STEP_1_TEXT_52": "Here's how we could implement scoring in our game:",
    "STEP_1_TEXT_53": "The 'player_score' and 'microbit_score' variables could be updated after each round.",
    "STEP_1_TITLE_18": "Game over",
    "STEP_1_TEXT_54": "Once a certain number of rounds have been played, the game should announce a final winner. We could have the Micro:bit display a 'YOU WIN!' or 'YOU LOSE!' message with an animation.",
    "STEP_1_TEXT_55": "A different final melody could also be played for each result.",
    "STEP_1_TEXT_56": "This provides a satisfying end to the game.",
    "STEP_1_TITLE_19": "Completion code",
    "STEP_1_TEXT_57": "Here's an example of how to handle game completion:",
    "STEP_1_TEXT_58": "This logic ensures the game has a clear beginning and end.",
    "STEP_1_TITLE_20": "Debugging and testing",
    "STEP_1_TEXT_59": "As with any programming project, it is essential to debug and test the game thoroughly. Make sure all rules work correctly, that sounds and animations play as expected, and that user interaction is fluid.",
    "STEP_1_TEXT_60": "Regular debugging ensures a quality game.",
    "STEP_2_TITLE": "Step 2: The Complete Code",
    "STEP_2_TEXT": "If you don't want to program it yourself, you can download the already compiled .hex file to upload it directly to your Micro:bit.",
    "STEP_3_TITLE": "Step 3: Evolve the Code",
    "STEP_3_TEXT": "Modify the code to create new game options, add a more advanced multiplayer mode, or integrate it with other Micro:bit projects."
  },
  "COUNTDOWN_PAGE": {
    "TITLE": "The Final Countdown",
    "VIDEO_NOT_SUPPORTED": "Your browser does not support the video tag.",
    "INTRODUCTION_H2": "Introduction",
    "INTRODUCTION_P": [
      "This project is about programming a countdown from 10 to 0. The countdown will be displayed on the Micro:bit screen and will be accompanied by a pulse, similar to the one in 'The Micro:bit's Heartbeat' project, to provide both sound and visual stimulation.",
      "In this project, you will learn about a new type of loop, a for loop, and how to declare a variable that we will use to perform the countdown.",
      "Let the countdown begin!"
    ],
    "MATERIALS_H2": "Materials",
    "MATERIAL_MICROBIT": "1 Micro:bit.",
    "MATERIAL_ITEM_1": "Laptop.",
    "MATERIAL_ITEM_2": "USB-A Cable",
    "MATERIAL_ITEM_3": "Python Editor.",
    "STEPS_H2": "Steps",
    "STEP_1_H3": "Step 1: Developing the Code",
    "STEP_1_H4": "Declaring a variable",
    "STEP_1_P": [
      "The countdown code is possibly simpler than the previous project's code, although it also has its peculiarities. The first is the declaration of a variable.",
      "When we talk about variables, we must know how to distinguish between a global scope variable and a local scope variable. For now, all that needs to be known is that global scope variables, like the one we will use in this project, are declared just after the imports line and are done as follows:"
    ],
    "STEP_1_P_2": "[variable name] = [variable value]",
    "STEP_1_P_3": "An example of declaration would be:",
    "STEP_1_P_4": "That said, at the very beginning of our project we will write:",
    "STEP_1_P_5": "On line 6 we declare the variable i and its value: 10.",
    "STEP_1_H4_1": "For loop",
    "STEP_1_P_6": "After the variable declaration, we start the for loop, which is the main loop of the project.",
    "STEP_1_H4_2": "Code explanation",
    "STEP_1_P_7": [
      "In this project we have to explain the for loop. A for loop executes a certain number of times. To decide how many times a for loop executes, an algorithm that modifies the value of the variable that controls the loop each time the loop executes is usually included. In this case, the value of the step variable is modified.",
      "On line 9 we declare the for loop and establish that it will execute 11 times (index in range(11)). Let's explain this last statement a little more:",
      "index: It is the value that will be modified.",
      "in; link index with its range of values.",
      "range(): Indicates the range of values, or the steps to be performed by the loop.",
      "11: It is the number of times (steps) that the for loop will execute."
    ],
    "STEP_1_P_8": [
      "Lines 10 and 11 are already known from the previous project. On line 12 what we are doing is reducing the variable i by one value each time the for loop executes.",
      "Finally, on line 13 we make the code stop for 1 second before executing the for loop again."
    ],
    "STEP_1_H4_3": "Concept",
    "STEP_1_P_9": [
      "Has something about the code not caught your attention? Have you noticed that the value of variable i is 10 and we execute the for loop 11 times? This “inconsistency” is due to the fact that 0 is a number and therefore must be taken into account when programming. If we make the for loop execute only 10 times, the last number that variable i will reach will be 1 and not 0.",
      "Try it!"
    ],
    "STEP_2_H3": "Step 2: The code",
    "STEP_2_P": "Download the hex file.",
    "STEP_3_H3": "Step 3: Evolve the code",
    "STEP_3_P": "Modify the code by adding a final animation, or by using the countdown to start a process on the Micro:bit. This countdown can be the first stone of a larger project!'"
  },
  "SETTINGS": {
    "TITLE": "Settings",
    "DESCRIPTION": "Here you can adjust the application settings.",
    "THEME_TITLE": "Appearance",
    "DARK_MODE": "Dark Mode",
    "DARK_MODE_TOGGLE": "Dark Mode",
    "FONT_FAMILY_SELECT": "Font Family",
    "FONT_SIZE_SELECT": "Font Size",
    "FONT_SIZE_SMALL": "Small",
    "FONT_SIZE_MEDIUM": "Medium",
    "FONT_SIZE_LARGE": "Large",
    "ANIMATIONS_TOGGLE": "Disable Animations",
    "LANGUAGE_SELECT": "Language"
  },
  "ACCESSIBLE_PROGRAMMING": {
    "TITLE": "Accessible Programming",
    "H1": "Accessible Programming with Micro:bit",
    "INTRO_P1": "Programming with Micro:bit offers an excellent opportunity to introduce people of all ages and abilities to the world of technology. However, to ensure it is truly inclusive, it is essential to consider accessibility from the project design stage.",
    "INTRO_P2": "Accessibility cannot be a patch that is added at the end of the project to try to meet a requirement or obtain benefits.",
    "CREATION_TITLE": "Creating Accessible Projects for Micro:bit",
    "CREATION_P1": "To create accessible Micro:bit projects, it is important to consider several aspects:",
    "CREATION_LI1_TITLE": "Multisensory Feedback:",
    "CREATION_LI1_TEXT": "Use not only the LED screen, but also sound (if the Micro:bit model allows it or is connected to a speaker) to provide information. For example, a game can emit one sound when you get it right and a different one when you get it wrong.",
    "CREATION_LI2_TITLE": "Alternative Inputs:",
    "CREATION_LI2_TEXT": "Consider options beyond buttons A and B. The Micro:bit's pins can be connected to external sensors or adapted switches, facilitating interaction for people with reduced mobility. Another option is to use the Micro:bit's accelerometer.",
    "CREATION_LI3_TITLE": "Clarity and Simplicity:",
    "CREATION_LI3_TEXT": "Keep the programs as simple and clear as possible. Avoid complex action sequences that may confuse users with cognitive or memory difficulties.",
    "CREATION_LI4_TITLE": "Clear Documentation:",
    "CREATION_LI4_TEXT": "Provide detailed and easy-to-understand instructions, ideally in multiple formats (text, audio, pictograms).",
    "BLOCKLY_TITLE": "Block-Based Programming (Blockly) and Disability",
    "BLOCKLY_P1": "Block-based programming interfaces, like the one used by MakeCode for Micro:bit, are a powerful tool for accessibility. Their visual and intuitive nature reduces significant barriers:",
    "BLOCKLY_OVERCOME_TITLE": "Barriers Overcome:",
    "BLOCKLY_OVERCOME_LI1_TITLE": "Visual impairment (low vision):",
    "BLOCKLY_OVERCOME_LI1_TEXT": "Although visual interfaces can be a challenge, the use of color-coded blocks allows users with low vision to recognize the type of block being used more quickly and easily.",
    "BLOCKLY_OVERCOME_LI2_TITLE": "Motor impairment:",
    "BLOCKLY_OVERCOME_LI2_TEXT": "Manipulating blocks is often easier than typing code, especially with mouse or keyboard adaptations. The drag-and-drop function can be replaced by keyboard navigation for those who cannot use a mouse.",
    "BLOCKLY_OVERCOME_LI3_TITLE": "Cognitive and learning disabilities:",
    "BLOCKLY_OVERCOME_LI3_TEXT": "The visual representation of the code reduces the cognitive load, as it does not require memorizing complex syntax. The blocks guide the user through the logical structure of the program.",
    "BLOCKLY_CHALLENGES_TITLE": "Current Challenges:",
    "BLOCKLY_CHALLENGES_LI1_TITLE": "Screen Readers:",
    "BLOCKLY_CHALLENGES_LI1_TEXT": "Often, drag-and-drop interfaces are not fully compatible with screen readers, which makes interaction difficult for blind or severely low-vision individuals.",
    "BLOCKLY_CHALLENGES_LI2_TITLE": "Keyboard Navigation:",
    "BLOCKLY_CHALLENGES_LI2_TEXT": "Full and efficient keyboard-only navigation is not always perfectly implemented in all block-based programming platforms.",
    "BLOCKLY_CHALLENGES_LI3_TITLE": "Customization:",
    "BLOCKLY_CHALLENGES_LI3_TEXT": "The lack of customization options (font size, color contrast, removal of animations) can affect users with various visual or cognitive needs.",
    "BLOCKLY_CHALLENGES_LI4_TITLE": "Documentation and Examples:",
    "BLOCKLY_CHALLENGES_LI4_TEXT": "Documentation and examples of projects specifically designed with accessibility in mind are not always available.",
    "PYTHON_TITLE": "Code-Based Programming (Micro:bit Python Editor)",
    "PYTHON_P1": "As an alternative to block-based programming, code-based programming (microPython or JavaScript) can be used. This type of programming, being plain text, is highly accessible to screen readers.",
    "PYTHON_P2": "The problem with this type of programming is that users must have a minimum knowledge of the programming language, so they have to be taught the language and the concepts at the same time. This does not happen with block-based programming, as knowledge of the language is not necessary and the main concepts worked on are programming concepts such as variables, constants, loops, etc.",
    "PYTHON_P3": "The only procedure currently available to minimize this barrier (language knowledge) is the creation of programming blocks where the student only has to replace or complete part of the code. The creation of the skeleton of the programming blocks in code would be the only current option to ensure 100% access via a screen reader.",
    "PYTHON_P4": "Promoting accessible programming not only benefits people with disabilities, but also improves the experience for all users, promoting a culture of inclusive design in the field of technology.",
    "PYTHON_P5": "Below are two examples, one example where the Micro:bit's response is only done through the display and another, more accessible, where the information output is done through the display and is reinforced with a sound output.",
    "MODAL_NON_ACCESSIBLE_TITLE": "Non-Accessible Example",
    "MODAL_CLOSE": "Close",
    "MODAL_NON_ACCESSIBLE_H2": "Video Clip (Non-Accessible)",
    "MODAL_NON_ACCESSIBLE_P": "The video clip of the non-accessible example would go here.",
    "MODAL_VIEW_CODE": "View Code",
    "MODAL_ACCESSIBLE_TITLE": "Accessible Example",
    "MODAL_ACCESSIBLE_H2": "Video Clip (Accessible)",
    "MODAL_ACCESSIBLE_P": "The video clip of the accessible example would go here.",
    "MODAL_CODE_TITLE": "Code",
    "NON_ACCESSIBLE_EXAMPLE_BUTTON": "Non-accessible example",
    "ACCESSIBLE_EXAMPLE_BUTTON": "Accessible example"
  },
  "ACCESSIBILITY_EVALUATOR_TITLE": "Accessibility Evaluator",
  "COMPROBAR_ACCESIBILIDAD_TITLE": "Check Accessibility (Automatic)",
  "COMPROBAR_ACCESIBILIDAD_MANUAL_TITLE": "Check Accessibility (Manual)",
  "MICROPYTHON_PAGE": {
    "H1": "MicroPython Programming Course for Micro:bit (Emphasis on Accessibility)",
    "H2_INTRO": "Introduction to MicroPython and Micro:bit",
    "P_INTRO": "This course will introduce you to the exciting world of programming with MicroPython on the Micro:bit board. You will learn to create interactive projects, with a special focus on how to make them accessible to all users, regardless of their abilities. The Micro:bit is a small programmable computer designed to make learning to code fun and accessible. With MicroPython, an optimized dialect of Python for microcontrollers, you can write code simply and efficiently.",
    "H2_MODULE1": "Module 1: First Steps and Accessible Outputs",
    "H3_MODULE1_BASIC": "Basic Concepts of MicroPython",
    "P_MODULE1_BASIC": "Lorem ipsum dolor sit amet, consectetur adipiscing elit. Sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat.",
    "H3_MODULE1_LED": "Displaying Text on the LED Screen (with Accessibility Considerations)",
    "P_MODULE1_LED": "We will learn to use the Micro:bit's LED matrix to display messages. It is crucial to consider that visually impaired users may not perceive this output. Later, we will explore alternative methods for communicating information.",
    "H2_MODULE2": "Module 2: Interactive Inputs and Multisensory Feedback",
    "H3_MODULE2_INPUTS": "Using Buttons and Digital Inputs",
    "P_MODULE2_INPUTS": "We will explore how buttons A and B, as well as digital inputs, can be used to interact with our programs. For accessibility, we will consider how these inputs can be adapted or supplemented.",
    "H3_MODULE2_SOUND": "Integrating Sound for Feedback",
    "P_MODULE2_SOUND": "Auditory feedback is essential for accessibility. We will learn to use the buzzer (or external speaker) to provide sounds that reinforce visual information or replace it completely for visually impaired users. For example, if a game requires the user to press a button, a combination of a visual arrow on the LED screen and a distinctive sound when the button is pressed can significantly improve the experience for everyone.",
    "H2_MODULE3": "Module 3: Sensors and Adaptations for Functional Diversity",
    "H3_MODULE3_SENSORS": "Reading Sensors (Accelerometer, Compass, Temperature)",
    "P_MODULE3_SENSORS": "The Micro:bit has several built-in sensors that allow us to interact with the environment. We will learn to read data from the accelerometer (to detect movement), the compass (for orientation), and the temperature sensor.",
    "H3_MODULE3_ADAPTATIONS": "Sensor Adaptations for Accessibility",
    "P_MODULE3_ADAPTATIONS": "We will analyze how sensor data can be used to create alternative interactions. For example, a program that is activated by tilting the Micro:bit could be more accessible for people with reduced mobility than a traditional button. In addition, we will see how the information obtained from the sensors can be translated into multisensory outputs (visual, auditory, tactile).",
    "H2_CONCLUSIONS": "Conclusions and Next Steps",
    "P_CONCLUSIONS": "This course has covered the basics of MicroPython programming with a strong emphasis on accessible design. Remember that accessibility is not an additional feature, but a fundamental principle for creating technology inclusive. We encourage you to explore more projects and continue learning how to make technology accessible to everyone!"
  },
  "REPOSITORIO_PAGE": {
    "CONTENT": "Repository page content.",
    "HEADER": {
      "HOME": "Home",
      "REPOSITORY": "Repository",
      "DOCUMENTATION": "Documentation",
      "COMMUNITY": "Community"
    },
    "HERO": {
      "TITLE": "Accessible Projects Repository",
      "SUBTITLE": "Explore, share and learn with Micro:bit projects designed with accessibility in mind",
      "UPLOAD_PROJECT_BUTTON": "Upload Your Project"
    },
    "STATS": {
      "PROJECTS_PUBLISHED": "Projects published",
      "TOTAL_DOWNLOADS": "Total downloads",
      "CONTRIBUTORS": "Contributors",
      "CATEGORIES": "Categories"
    },
    "FILTERS": {
      "LABEL": "Filter by:",
      "ALL": "All",
      "SEARCH_PLACEHOLDER": "Search projects..."
    },
    "CATEGORIES": {
      "ACCESSIBILITY": "Accessibility",
      "SENSORS": "Sensors",
      "COMMUNICATION": "Communication",
      "EDUCATION": "Education",
      "ENTERTAINMENT": "Entertainment"
    },
    "PROJECTS_GRID": {
      "EMPTY_STATE_TITLE": "No projects found",
      "EMPTY_STATE_SUBTITLE": "Try with other filters or be the first to upload a project"
    },
    "UPLOAD_MODAL": {
      "TITLE": "Upload New Project",
      "SUBTITLE": "Share your accessible project with the community",
      "PROJECT_TITLE_LABEL": "Project title *",
      "PROJECT_TITLE_PLACEHOLDER": "Ex: Accessible sound traffic light",
      "CATEGORY_LABEL": "Category *",
      "SELECT_CATEGORY_PLACEHOLDER": "Select a category",
      "DESCRIPTION_LABEL": "Description *",
      "DESCRIPTION_PLACEHOLDER": "Describe your project, what it does and how it helps accessibility...",
      "AUTHOR_NAME_LABEL": "Your name *",
      "AUTHOR_NAME_PLACEHOLDER": "Ex: Maria Garcia",
      "TAGS_LABEL": "Tags (press Enter to add)",
      "TAGS_PLACEHOLDER": "Ex: sound, LED, vibration...",
      "CODE_LABEL": "Project code (.py) *",
      "HEX_CODE_LABEL": ".HEX file",
      "INSTRUCTIONS_LABEL": "Upload instructions (.txt, .pdf)",
      "DRAG_FILE_TEXT_BOLD": "Drag your .py file here",
      "DRAG_HEX_FILE_TEXT_BOLD": "Drag your .hex file here",
      "DRAG_INSTRUCTIONS_FILE_TEXT_BOLD": "Drag your instructions here",
      "CLICK_TO_SELECT_TEXT": "or click to select",
      "PUBLISH_BUTTON": "Publish Project",
      "HEX_FILE_UPLOADED": ".hex file uploaded",
      "INSTRUCTIONS_FILE_UPLOADED": "Instructions uploaded",
      "LEVEL_LABEL": "Level",
      "SELECT_LEVEL_PLACEHOLDER": "Select a level",
      "MATERIALS_LABEL": "Materials"
    },
    "LEVELS": {
      "LOW": "Low",
      "MEDIUM": "Medium",
      "HIGH": "High"
    },
    "DETAIL_MODAL": {
      "DESCRIPTION_SECTION_TITLE": "Description",
      "TAGS_SECTION_TITLE": "Tags",
      "CODE_SECTION_TITLE": "Project code",
      "COPY_CODE_BUTTON": "Copy",
      "COPIED_CODE_BUTTON": "✓ Copied",
      "DOWNLOAD_FULL_PROJECT_BUTTON": "Download full project"
    },
    "PROJECT_CARD": {
      "DOWNLOAD_BUTTON": "Download",
      "DOWNLOAD_HEX_BUTTON": "Download HEX",
      "DOWNLOAD_INSTRUCTIONS_BUTTON": "Download instructions",
      "VIEW_CODE_BUTTON": "View code"
    },
    "TOAST": {
      "PROJECT_PUBLISHED_SUCCESS": "Project published successfully! 🎉",
      "HEX_FILE_UPLOAD_ERROR": "Error uploading .hex file",
      "INSTRUCTIONS_FILE_UPLOAD_ERROR": "Error uploading instructions",
      "HEX_DOWNLOAD_ERROR": "Error downloading .hex file",
      "INSTRUCTIONS_DOWNLOAD_ERROR": "Error downloading instructions"
    }
  },
  "TAG_CATEGORIES": {
    "GENERAL": "General",
    "MICROBIT": "Micro:bit",
    "ACCESSIBILITY": "Accessibility",
    "LANGUAGES": "Languages",
    "CONNECTIVITY": "Connectivity"
  },
  "TAGS": {
    "EDUCATION": "Education",
    "GAME": "Game",
    "TOOL": "Tool",
    "SCIENCE": "Science",
    "ART": "Art",
    "MUSIC": "Music",
    "SPORT": "Sport",
    "LED": "LED",
    "RADIO": "Radio",
    "PINS": "Pins",
    "SENSORS": "Sensors",
    "BUTTONS": "Buttons",
    "ACCELEROMETER": "Accelerometer",
    "COMPASS": "Compass",
    "VISUAL": "Visual",
    "AUDITORY": "Auditory",
    "MOTOR": "Motor",
    "COGNITIVE": "Cognitive",
    "EASY_READING": "Easy Reading",
    "AAC": "AAC",
    "MICROPYTHON": "MicroPython",
    "MAKECODE": "MakeCode",
    "SCRATCH": "Scratch",
    "BLUETOOTH": "Bluetooth",
    "IOT": "IoT",
    "NETWORKS": "Networks"
  },
  "ACCESSIBILITY_EVALUATOR_TITLE": "Accessibility Evaluator",
  "COMPROBAR_ACCESIBILIDAD_TITLE": "Check Accessibility (Automatic)",
  "COMPROBAR_ACCESIBILIDAD_MANUAL_TITLE": "Check Accessibility (Manual)",
  "MICROPYTHON_PAGE": {
    "H1": "MicroPython Programming Course for Micro:bit (Emphasis on Accessibility)",
    "H2_INTRO": "Introduction to MicroPython and Micro:bit",
    "P_INTRO": "This course will introduce you to the exciting world of programming with MicroPython on the Micro:bit board. You will learn to create interactive projects, with a special focus on how to make them accessible to all users, regardless of their abilities. The Micro:bit is a small programmable computer designed to make learning to code fun and accessible. With MicroPython, an optimized dialect of Python for microcontrollers, you can write code simply and efficiently.",
    "H2_MODULE1": "Module 1: First Steps and Accessible Outputs",
    "H3_MODULE1_BASIC": "Basic Concepts of MicroPython",
    "P_MODULE1_BASIC": "Lorem ipsum dolor sit amet, consectetur adipiscing elit. Sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat.",
    "H3_MODULE1_LED": "Displaying Text on the LED Screen (with Accessibility Considerations)",
    "P_MODULE1_LED": "We will learn to use the Micro:bit's LED matrix to display messages. It is crucial to consider that visually impaired users may not perceive this output. Later, we will explore alternative methods for communicating information.",
    "H2_MODULE2": "Module 2: Interactive Inputs and Multisensory Feedback",
    "H3_MODULE2_INPUTS": "Using Buttons and Digital Inputs",
    "P_MODULE2_INPUTS": "We will explore how buttons A and B, as well as digital inputs, can be used to interact with our programs. For accessibility, we will consider how these inputs can be adapted or supplemented.",
    "H3_MODULE2_SOUND": "Integrating Sound for Feedback",
    "P_MODULE2_SOUND": "Auditory feedback is essential for accessibility. We will learn to use the buzzer (or external speaker) to provide sounds that reinforce visual information or replace it completely for visually impaired users. For example, if a game requires the user to press a button, a combination of a visual arrow on the LED screen and a distinctive sound when the button is pressed can significantly improve the experience for everyone.",
    "H2_MODULE3": "Module 3: Sensors and Adaptations for Functional Diversity",
    "H3_MODULE3_SENSORS": "Reading Sensors (Accelerometer, Compass, Temperature)",
    "P_MODULE3_SENSORS": "The Micro:bit has several built-in sensors that allow us to interact with the environment. We will learn to read data from the accelerometer (to detect movement), the compass (for orientation), and the temperature sensor.",
    "H3_MODULE3_ADAPTATIONS": "Sensor Adaptations for Accessibility",
    "P_MODULE3_ADAPTATIONS": "We will analyze how sensor data can be used to create alternative interactions. For example, a program that is activated by tilting the Micro:bit could be more accessible for people with reduced mobility than a traditional button. In addition, we will see how the information obtained from the sensors can be translated into multisensory outputs (visual, auditory, tactile).",
    "H2_CONCLUSIONS": "Conclusions and Next Steps",
    "P_CONCLUSIONS": "This course has covered the basics of MicroPython programming with a strong emphasis on accessible design. Remember that accessibility is not an additional feature, but a fundamental principle for creating technology inclusive. We encourage you to explore more projects and continue learning how to make technology accessible to everyone!"
  },
  "ACCESSIBILITY_EVALUATOR_PAGE": {
    "H2": "MicroPython Code Editor with Accessibility Emphasis",
    "P": "Enter your MicroPython code for Micro:bit in the text area. The editor will help you visualize what the code looks like and allow you to check its accessibility.",
    "BTN": "Check Accessibility",
    "TEXTAREA_PLACEHOLDER": "Enter your MicroPython code here...",
    "EVALUATION_RESULTS_H3": "Evaluation Results",
    "SCORE": "Score",
    "IMPROVEMENT": "Improvement",
    "REDUNDANCY_DETECTED": "Input Redundancy Detected",
    "YES": "Yes",
    "NO": "No",
    "NO_BUTTONS_USED": "Buttons are not used",
    "ERRORS": "Errors",
    "WARNINGS": "Warnings",
    "CODE_PREVIEW_H3": "Code Suggested"
  },
  "VALIDATOR": {
    "AUDIO_FEEDBACK": {
      "SUCCESS_MESSAGE": "Multimodality: Audio import detected.",
      "SUCCESS_MESSAGE_2": "Multimodality: Audio output detected.",
      "ERROR_MESSAGE": "Missing sound output.",
      "ERROR_SUGGESTION": "Add 'speech.say(\"[string]\")', 'music.play(music.[song])' or 'music.([number])' for visually impaired users to receive information.",
      "ERROR_SUGGESTION_2": "Import 'speech' or 'music' for visually impaired users to receive information.",
      "MISSING_AUDIO_OUTPUT_WITH_DISPLAY_SHOW": "You are only using display.show() without audio output.",
      "SUGGEST_AUDIO_OUTPUT_WITH_DISPLAY_SHOW": "Add 'import speech' or 'import music' and use 'speech.say()' or 'music.play()' to provide auditory feedback for visually impaired users."
    },
    "BLOCKING_LOOPS": {
      "WARNING_MESSAGE": "Blocking loop detected.",
      "WARNING_SUGGESTION": "You are using very long sleep(). This prevents the Micro:bit from reacting quickly to buttons or voice commands."
    },
    "INPUT_REDUNDANCY": {
      "SUCCESS_MESSAGE": "Accessible input: You use touch or motion sensors.",
      "ERROR_MESSAGE": "You only use physical buttons.",
      "ERROR_SUGGESTION": "Add 'pin_logo.is_touched()' to make it easier for people with motor difficulties to use."
    },
    "COMPLEX_PRESSES": {
      "WARNING_MESSAGE": "Complex press detected.",
      "WARNING_SUGGESTION": "Avoid requesting the simultaneous pressing of two buttons or a button and the logo, as this makes interaction difficult for users with certain motor disabilities.",
      "SUCCESS_MESSAGE": "Simple presses: No complex presses were detected."
    },
    "CODE_SEMANTICS": {
      "SUCCESS_MESSAGE": "Semantics: Variables have descriptive names.",
      "WARNING_MESSAGE": "Generic variable names.",
      "WARNING_SUGGESTION": "Use names like 'alarm_status' instead of 'a' to make it easier for screen readers to read."
    }
  },
  "MANUAL_CHECK_MODAL_TITLE": "Manual Accessibility Check",
  "MANUAL_CHECK_MODAL_QUESTION_1": "LED display texts or icons are clear and legible",
  "MANUAL_CHECK_MODAL_QUESTION_2": "Does not rely solely on lights or colors to convey information",
  "MANUAL_CHECK_MODAL_QUESTION_3": "LED display brightness is adequate",
  "MANUAL_CHECK_MODAL_QUESTION_4": "Alternatives to exclusive use of the screen are offered",
  "MANUAL_CHECK_MODAL_QUESTION_5": "Sound signals have a visual alternative",
  "MANUAL_CHECK_MODAL_QUESTION_6": "Volume is sufficient",
  "MANUAL_CHECK_MODAL_QUESTION_7": "Does not require fine movements",
  "MANUAL_CHECK_MODAL_QUESTION_8": "Buttons A and B are not the only form of interaction",
  "MANUAL_CHECK_MODAL_QUESTION_9": "Can be used with adaptations (external buttons, alligator clips, etc.)",
  "MANUAL_CHECK_MODAL_QUESTION_10": "Does not require vigorous shaking if using a motion sensor",
  "MANUAL_CHECK_MODAL_QUESTION_11": "Instructions are clear and simple",
  "MANUAL_CHECK_MODAL_QUESTION_12": "The project has immediate feedback",
  "MANUAL_CHECK_MODAL_QUESTION_13": "Does not overload with too many simultaneous signals",
  "MANUAL_CHECK_MODAL_QUESTION_14": "Program behavior is predictable",
  "MANUAL_CHECK_MODAL_QUESTION_15": "Can be used seated or with fixed support",
  "MANUAL_CHECK_MODAL_QUESTION_16": "Documentation explains how to adapt it",
  "MANUAL_CHECK_MODAL_QUESTION_17": "Has been tested by users with different needs",
  "MANUAL_CHECK_MODAL_OPTION_YES": "Yes",
  "MANUAL_CHECK_MODAL_OPTION_PARTIAL": "Partial",
  "MANUAL_CHECK_MODAL_OPTION_NO": "No",
  "MANUAL_CHECK_MODAL_SUBMIT": "Submit",
  "MANUAL_CHECK_MODAL_CANCEL": "Cancel",
  "RESULTS_MODAL_TITLE": "Accessibility Evaluation Results",
  "RESULTS_MODAL_SCORE": "Total Score",
  "RESULTS_MODAL_FEEDBACK_0_17": "Requires significant improvements",
  "RESULTS_MODAL_FEEDBACK_18_27": "Medium accessibility (improvable)",
  "RESULTS_MODAL_FEEDBACK_28_36": "Highly accessible project",
  "RESULTS_MODAL_ACCEPT": "Accept",
  "MANUAL_CHECK_MODAL_HEADER_QUESTION": "Question"
}