{
  "ACCESSIBILITY": {
    "LANGUAGE_BUTTON_LABEL": "Oraingo hizkuntza {{language}} sakatu hizkuntza aldatzeko"
  },
  "TABS": {
    "MICROPYTHON": "MicroPython",
    "MICROBIT": "Micro:bit",
    "MICROIA": "MicroIA",
    "REPOSITORIO": "Repositorioa"
  },
  "MICROBIT_PAGE": {
    "TITLE": "Micro:bit Proiektuak",
    "OPEN_PROJECT_PREFIX": "Ireki proiektua ",
    "PROJECTS": {
      "ACCESSIBLE_PROGRAMMING": {
        "TITLE": "Programazio Irisgarria",
        "DESCRIPTION": "Arakatu Micro:bit programazioa modu irisgarrian.",
        "img": "assets/img/microbit-a11y.png",
        "alt": "Irudi adierazgarria Micro:bit-ekin programazio irisgarriari buruz"
      },
      "COUNTDOWN": {
        "TITLE": "Azken Atzerako Kontaketa",
        "DESCRIPTION": "Atzerako kontaketa pertsonalizagarria.",
        "img": "assets/img/final-countdown.png",
        "alt": "Atzerako kontaketaren irudia"
      },
      "DUEL": {
        "TITLE": "Duelua Eguzkitan",
        "DESCRIPTION": "Bi jokalarirentzako erreflexu jokoa.",
        "img": "assets/img/duel.png",
        "alt": "Micro:bit-ekin duelu baten irudia"
      },
      "STONE_PAPER_SCISSORS": {
        "TITLE": "Harri, Orri, Ar",
        "DESCRIPTION": "Joko klasikoa, orain zure Micro:bit-ean.",
        "img": "assets/img/rps.png",
        "alt": "Harri, Orri, Ar jokoaren irudia Micro:bit-ekin"
      },
      "SECRET_MESSAGE": {
        "TITLE": "Mezu Sekretua",
        "DESCRIPTION": "Mezu sekretuak bidali eta jaso.",
        "img": "assets/img/morse_code.png",
        "alt": "Mezu sekretu baten irudia Micro:bit-ekin"
      },
      "HEARTBEAT": {
        "TITLE": "Micro:bit-aren Taupada",
        "DESCRIPTION": "Ikusi zure plakaren taupadak.",
        "img": "assets/img/heart.png",
        "alt": "Bihotz taupadaren irudia Micro:bit-ekin"
      }
    }
  },
  "DUEL_PAGE": {
    "TITLE": "Duelua Eguzkitan",
    "VIDEO_NOT_SUPPORTED": "Zure arakatzaileak ez du bideo etiketa onartzen.",
    "INTRODUCTION_TITLE": "Sarrera",
    "INTRODUCTION_TEXT": "Micro:bit-ean bi jokalarirentzako erreflexu joko bat sortzen irakasten dizu proiektu honek. Prest duelu honetarako!",
    "MATERIALS_TITLE": "Materialak",
    "MATERIALS_LIST": [
      "2 Micro:bit",
      "Ordenagailu eramangarria",
      "USB-A konexio kablea",
      "Python Editorea"
    ],
    "TARGET": "Helburua",
    "TARGET_TEXT_1": "Bi jokalarirentzako erreflexu joko sinple bat sortu bi Micro:bit erabiliz.",
    "TARGET_TEXT_2": "Begizten, baldintzazkoen eta Micro:bit-en arteko interakzioaren programazioa praktikatu.",
    "STEPS_TITLE": "Programazio Pausoak",
    "STEP_1_TITLE": "1. Pausoa: Dueluaren Hasiera",
    "STEP_1_TEXT": "Jokoaren oinarrizko logika programatzen hasiko gara, non jokalariek azkar erreakzionatu behar duten.",
    "STEP_1_TEXT_1": "Horretarako, atzerako kontaketa funtzio bat eta botoien sakatzea detektatzeko mekanismo bat sartuko ditugu.",
    "STEP_1_TEXT_2": "Hona hemen hasierako atzerako kontaketarako lehen kode zatia:",
    "STEP_1_TEXT_3": "Kode honek atzerako kontaketa bat erakutsiko du Micro:bit pantailan eta soinu bat igorriko du.",
    "STEP_1_TEXT_4": "Atzerako kontaketa amaitu ondoren, Micro:bit-ek jokalarietako batek A edo B botoia sakatu arte itxaron behar du.",
    "STEP_1_TEXT_5": "Ondorengo kode zatiak botoien sakatzearen detekzioa kudeatzen du:",
    "STEP_1_TEXT_6": "Lerro hauek lehenengo zein botoi sakatzen den detektatzen dute eta gezi bat erakusten dute dagokion norabidean.",
    "STEP_2_TITLE": "2. Pausoa: Interaktibitatea Hobetzea",
    "STEP_2_TEXT": "Orain elementuak gehituko ditugu jokoa dinamikoagoa eta interaktiboagoa egiteko.",
    "STEP_2_TEXT_1": "Soinuaren integrazioa feedback-erako:",
    "STEP_2_TEXT_2": "Soinuak jokalariei atzerako kontaketa noiz hasten eta amaitzen den eta nork sakatu duen lehenik jakiten lagunduko die.",
    "STEP_2_TEXT_3": "Gainera, aldagai bat gehituko dugu jokoaren egoera kontrolatzeko, hala nola duelua aktibo dagoen ala ez.",
    "STEP_2_TEXT_4": "Hona hemen kode eguneratua soinuaren eta jokoaren egoeraren logikarekin:",
    "STEP_2_TEXT_5": "Pauso hau funtsezkoa da joko esperientzia irisgarri baterako.",
    "STEP_3_TITLE": "3. Pausoa: Micro:bit-ak Konektatzea",
    "STEP_3_TEXT": "Duelua zirraragarriagoa izango da bi Micro:bit-ek elkarren artean komunikatu ahal badute.",
    "STEP_3_TEXT_1": "Irrati modulua erabiliko dugu bi Micro:bit-en arteko seinaleak bidaltzeko.",
    "STEP_3_TEXT_2": "Lehenik, irrati kanala konfiguratuko dugu Micro:bit-ak elkar aurkitu ahal izateko:",
    "STEP_3_TEXT_3": "Kode zati honek irratia inizializatzen du eta talde zehatz batean konfiguratzen du.",
    "STEP_3_TEXT_4": "Orain, jokalari batek botoi bat sakatzen duenean, bere Micro:bit-ak mezu bat bidaliko dio besteari.",
    "STEP_3_TEXT_5": "Ondorengo kodeak mezu horiek nola bidali eta jaso erakusten du:",
    "STEP_3_TEXT_6": "Mezua jasotzen duen Micro:bit-ek jakin behar du beste jokalariak erreakzionatu duela.",
    "STEP_3_TEXT_7": "Dueloaren emaitza kudeatuko dugu lehenik nork sakatzen duen eta nork jasotzen duen mezuaren arabera.",
    "STEP_3_TEXT_8": "Hona hemen mezuak bidali eta jasotzeko logikaren kodea:",
    "STEP_3_TEXT_9": "Logika honek dueluaren txanda bakoitzaren irabazlea zehazten du.",
    "STEP_3_TEXT_10": "Irrati-komunikazioa funtsezkoa da jokoaren dinamikarako.",
    "STEP_4_TITLE": "4. Pausoa: Puntuazioa eta Txanda Anitzak Gehitzea",
    "STEP_4_TEXT": "Jokoa lehiakorragoa egiteko, puntuazio sistema bat eta hainbat txanda jokatzeko aukera gehituko ditugu.",
    "STEP_4_TEXT_1": "Aldagaiak deklaratuko ditugu jokalari bakoitzaren puntuazioetarako eta jokatutako txanda kopururako.",
    "STEP_4_TEXT_2": "Jokoa txanda kopuru aurrez zehaztu baten ondoren amaituko da, eta irabazlea puntuazio altuena duena izango da.",
    "STEP_4_TEXT_3": "Hona hemen puntuazioa eta txandak kudeatzeko kodea:",
    "STEP_4_TEXT_4": "Aldagai hauek txanda bakoitzaren ondoren eguneratuko dira.",
    "STEP_4_TEXT_5": "Gainera, jokoa berriro hasteko modu bat behar dugu partida berri baterako.",
    "STEP_4_TEXT_6": "Berrezarri funtzioa puntuazioak eta txandak berrezartzeaz arduratuko da.",
    "STEP_4_TEXT_7": "Kodea jokoa berriro hasteko:",
    "STEP_4_TEXT_8": "Horrek hainbat partida jokatzeko aukera emango du Micro:bit-ak berriro hasi beharrik gabe.",
    "STEP_4_TEXT_9": "Micro:bit bakoitzeko puntuazio ikusgaiak jokalariei aurrerapena jarraitzen lagunduko die.",
    "STEP_4_TEXT_10": "Irteera bisualak eta sonoroak egokituko ditugu azken irabazlea iragartzeko.",
    "STEP_4_TEXT_11": "Azken kodeak zati guzti hauek integratu beharko lituzke joko oso eta funtzional baterako.",
    "STEP_4_TEXT_12": "Puntuazio sistema honek lehiakortasun elementu bat gehitzen dio dueluari.",
    "STEP_5_TITLE": "5. Pausoa: Irisgarritasun Arazpenak",
    "STEP_5_TEXT": "Eguzkitan duelua benetan irisgarria izan dadin, erabiltzaileen behar anitzak kontuan hartu behar ditugu.",
    "STEP_5_TEXT_1": "Feedback multisentsoriala inplementatuko dugu, LED pantaila ez ezik, soinu argi eta bereizgarriak ere erabiliz jokoaren ekintza eta emaitza bakoitzerako.",
    "STEP_5_TEXT_2": "Adibidez, soinu altu bat garaipenerako eta soinu baxu bat porrotarako, adierazle bisualekin batera.",
    "STEP_5_TEXT_3": "Botoi fisikoen ordezkoak ere kontuan hartuko ditugu, hala nola Micro:bit-aren inklinazioa edo astintzea detektatzea jokalariaren erreakziorako.",
    "STEP_5_TEXT_4": "Horrek mugikortasun murriztua duten jokalariei parte hartzeko aukera emango die.",
    "STEP_5_TEXT_5": "Kodeak sarrera alternatibo hauek kontuan hartu beharko ditu.",
    "STEP_6_TITLE": "6. Pausoa: Arazketa eta Probak",
    "STEP_6_TEXT": "Kodea amaitu ondoren, funtsezkoa da zorrotz arazketa eta proba egitea.",
    "STEP_6_TEXT_1": "Bi Micro:bit-ekin probak egingo ditugu irrati-komunikazioak behar bezala funtzionatzen duela ziurtatzeko.",
    "STEP_6_TEXT_2": "Atzerako kontaketa, botoien detekzioa eta puntuazio logikak espero bezala funtzionatzen dutela egiaztatuko dugu.",
    "STEP_6_TEXT_3": "Gainera, irisgarritasun probak egingo ditugu feedback multisentsoriala eraginkorra dela ziurtatzeko.",
    "STEP_6_TEXT_4": "Eskatu pertsona ezberdinei jokoa probatzeko feedback anitza lortzeko.",
    "STEP_6_TEXT_5": "Probetan detektatzen diren errore edo erabilgarritasun arazo guztiak egokituko ditugu.",
    "STEP_6_TEXT_6": "Arazketa prozesu iteratibo bat da, jokoaren kalitatea bermatzen duena.",
    "STEP_6_TEXT_7": "Behin dena behar bezala probatuta, zure 'Duelua Eguzkitan' prest egongo da!",
    "STEP_6_TEXT_8": "Proba prozesu hau funtsezkoa da proiektuaren kalitate eta irisgarritasunerako.",
    "STEP_7_TITLE": "7. Pausoa: Pertsonalizazioa eta Hobekuntzak",
    "STEP_7_TEXT": "Oinarrizko duelu joko bat eraiki duzu. Orain zure ideiak pertsonalizatzeko eta gehitzeko garaia da.",
    "STEP_7_TEXT_1": "Txanda gehiago, feedback mota ezberdinak edo are jokalari bakarreko modua ere gehitu ditzakezu Micro:bit-aren aurka.",
    "STEP_8_TITLE": "8. Pausoa: Kode Osoa",
    "STEP_8_TEXT": "Hona hemen 'Duelua Eguzkitan' proiektuaren kode osoa Micro:bit-erako.",
    "STEP_8_TEXT_1": "Kode honek aurreko pausoetan deskribatutako funtzionalitate guztiak integratzen ditu, atzerako kontaketatik hasi eta dueluaren logikara eta bi Micro:bit-en arteko irrati-komunikaziora arte.",
    "STEP_8_TEXT_2": "Etorkizuneko esperimentu eta pertsonalizazioetarako abiapuntu izateko diseinatuta dago.",
    "STEP_8_TEXT_3": "Irrati moduluaren konfigurazioa, jokalarien botoi-sakatzeen kudeaketa eta txanda bakoitzaren irabazlea zehazteko logika barne hartzen ditu.",
    "STEP_8_TEXT_4": "Gainera, puntuazio sistema oinarrizko bat integratzen du jokoaren aurrerapena jarraitzeko eta azken irabazle bat iragartzeko.",
    "STEP_8_TEXT_5": "Irisgarritasun arazpenak kontuan hartu dira, feedback multisentsoriala eta sarrera aukera malguak eskainiz.",
    "STEP_8_TEXT_6": "Proiektu hau adibide bikaina da Micro:bit-aren gaitasunak eta diseinu irisgarriaren printzipioak nola konbinatu daitezkeen erakusteko.",
    "STEP_8_TEXT_7": "Egin ezazu zurea eta arakatu eskaintzen dituen aukera guztiak!",
    "STEP_9_TITLE": "9. Pausoa: .hex fitxategia Deskargatu",
    "STEP_9_TEXT": "Zuk zeuk programatu nahi ez baduzu, konpilatutako .hex fitxategia deskarga dezakezu zuzenean zure Micro:bit-ean kargatzeko.",
    "STEP_9_TEXT_1": "Fitxategi honek 'Duelua Eguzkitan' jokoaren kodea erabiltzeko prest dauka.",
    "STEP_9_TEXT_2": "Micro:bit-a ordenagailura konektatu eta .hex fitxategia agertzen den unitatera arrastatu besterik ez duzu egin behar.",
    "STEP_10_TITLE": "10. Pausoa: Duelua Jolasten!",
    "STEP_10_TEXT": "Orain kodea zure Micro:bit-ean duzula, jolasteko garaia da! Aurkitu lagun bat beste Micro:bit batekin eta gozatu 'Duelua Eguzkitan' jokoaz.",
    "STEP_11_TITLE": "11. Pausoa: Etorkizuneko Hobekuntzetarako Iradokizunak",
    "STEP_11_TEXT": "Hona hemen zure 'Duelua Eguzkitan' hurrengo mailara eramateko ideia batzuk:",
    "STEP_12_TITLE": "12. Pausoa: Baliabide Gehigarriak",
    "STEP_12_TEXT": "Micro:bit programazioan eta irisgarritasunean sakontzeko, kontsultatu ondorengo baliabideak:",
    "STEP_12_TEXT_1": "Micro:bit-aren dokumentazio ofiziala: [dokumentazioaren esteka]",
    "STEP_12_TEXT_2": "Programazioan irisgarritasun gidak: [giden esteka]",
    "STEPS_TITLE_2": "Kode osoa",
    "STEPS_TEXT_2": "Deskargatu .hex fitxategia",
    "STEPS_TITLE_3": "Eboluzionatu kodea",
    "STEP_13_TEXT": "Aldatu kodea jokoaren aldaerak sortzeko, modu berriak gehitzeko edo beste proiektu batzuekin integratzeko."
  },
  "HEART_PAGE": {
    "TITLE": "Micro:bit-aren Taupada",
    "VIDEO_NOT_SUPPORTED": "Zure arakatzaileak ez du bideo etiketa onartzen.",
    "INTRODUCTION_TITLE": "Sarrera",
    "INTRODUCTION_TEXT": [
      "Proiektu honek Micro:bit-aren taupadak ikusi eta bihotz-taupadarekin esperimentatzeko aukera ematen digu.",
      "LED pantaila irudikapen bisualetarako nola erabili eta soinuak feedback multisentsorialerako nola integratu ikasiko dugu.",
      "'Taupadaren' erritmoa kontrol ezberdinak eta programazioa erabiliz nola alda daitekeen ikusiko dugu.",
      "Prest zure Micro:bit-aren pultsua sentitzeko!"
    ],
    "MATERIALS_TITLE": "Materialak",
    "MATERIALS_LIST": [
      "1 Micro:bit",
      "Ordenagailu eramangarria",
      "USB-A konexio kablea",
      "Python Editorea"
    ],
    "STEPS_TITLE": "Programazio Pausoak",
    "STEP_1_TITLE": "1. Pausoa: Bihotzak Bizia Hartzen Du",
    "STEP_1_TITLE_1": "Oinarrizko Taupada",
    "STEP_1_TEXT": "Micro:bit-aren LED pantailan taupada egiten duen bihotz baten animazio sinple bat programatzen hasiko gara.",
    "STEP_1_TITLE_2": "Soinua Taupadari Gehitzea",
    "STEP_1_TEXT_1": "Taupada errealistagoa eta irisgarriagoa egiteko, bihotza argitzen den bakoitzean soinu bat gehituko dugu.",
    "STEP_1_TEXT_2": [
      "'music' modulua inportatuko dugu musika notak erreproduzitzeko.",
      "Soinuak argia eta bereizgarria izan beharko luke, benetako taupada baten 'lub-dub' errepikatuz."
    ],
    "STEP_1_TEXT_3": "Hona hemen soinuaren eta bihotzaren animazioaren integraziorako kodea:",
    "STEP_1_TITLE_3": "Erritmoa Kontrolatzea",
    "STEP_1_TEXT_4": "Orain bihotzak taupada egiten duela eta soinuak entzuten direla, bere erritmoa kontrolatu nahi dugu. 'beats' aldagai bat sartuko dugu taupadaren abiadura doitzeko.",
    "STEP_1_TEXT_5": [
      "Aldagai honek 'taupada' bakoitzaren arteko itxaron-denbora eta musika noten iraupena kontrolatuko ditu.",
      "Balio ezberdinekin esperimentatuko dugu erritmo egokia aurkitzeko."
    ],
    "STEP_1_TITLE_4": "Botoien Interakzioa",
    "STEP_1_TEXT_6": [
      "Micro:bit-aren A eta B botoiak erabiltzaileek taupadaren abiadura handitu edo gutxitu ahal izateko erabiliko ditugu.",
      "A botoia sakatuz bihotza azkartu daiteke, eta B botoia sakatuz moteldu."
    ],
    "STEP_1_TEXT_7": "Kodea botoien interakziorako:",
    "STEP_1_TEXT_8": "Horrek esperientzia interaktibo bat ahalbidetuko du, non erabiltzaileak bere 'bihotz' birtuala kontrolatzen duen.",
    "STEP_1_TITLE_5": "Abiadura Mugak",
    "STEP_1_TEXT_9": [
      "Taupadaren erritmo irrealista azkarrak edo motelak ekiditeko, 'beats' aldagaiarentzako mugak ezarriko ditugu.",
      "Bihotza ez litzateke guztiz gelditu behar, ezta hauteman ezin den abiadura batera iritsi ere."
    ],
    "STEP_1_TEXT_10": [
      "Murrizketa hauek jokoa parametro logiko eta jokagarrien barruan mantentzen dela ziurtatzen dute.",
      "Baldintzazkoak inplementatuko ditugu 'beats' aldagaia nahi den tartean mantentzen dela ziurtatzeko."
    ],
    "STEP_1_TITLE_6": "Feedback Bisuala",
    "STEP_1_TEXT_11": [
      "Bihotzaren animazioaz gain, LED pantaila erabiliko dugu taupadaren uneko abiadura edo beste adierazle bisual garrantzitsu batzuk erakusteko.",
      "Minutuko taupadak (BPM) adierazten dituen zenbaki bat erakutsi genezake."
    ],
    "STEP_1_TEXT_12": [
      "Feedback bisual honek soinu feedback-a osatzen du, proiektua informazio gehiago emanez."
    ],
    "STEP_1_TITLE_7": "BPM Kalkulua",
    "STEP_1_TEXT_13": "Minutuko taupadak (BPM) erakusteko, 'beats' aldagaian oinarritutako kalkulu txiki bat egin beharko dugu.",
    "STEP_1_TEXT_14": "BPM kalkulatzeko formula taupaden arteko denboraren (milisegundotan) arabera hau da: BPM = 60000 / taupaden_arteko_denbora.",
    "STEP_1_TITLE_8": "Bihotz-maiztasun Taula",
    "STEP_1_TEXT_15": "Hona hemen bihotz-maiztasunetarako erreferentzia-taula bat, zure Micro:bit-aren 'bihotzaren' erritmoa doitzeko erabilgarria:",
    "TABLE_TITLE": "Bihotz-maiztasuna (BPM)",
    "TABLE_HD_1": "Minutuko Taupadak",
    "TABLE_HD_2": "Taupaden arteko Denbora (segundotan)",
    "TABLE_HD_3": "Taupaden arteko Denbora (milisegundotan)",
    "STEP_1_TEXT_16": [
      "Taula honek 'beats' balioak benetako bihotz-maiztasun batekin nola erlazionatzen diren ulertzen lagunduko dizu.",
      "Balio hauek erabil ditzakezu erritmo zehatzak programatzeko edo zure taupada-simulagailua balioztatzeko."
    ],
    "FORMULA_ALT_TEXT": "Bihotzaren taupaden maiztasuna kalkulatzeko formula",
    "FORMULA_ALT_TEXT_2": "Eguzkia irudikatzen duen irudia",
    "FORMULA_ALT_TEXT_3": "Bihotz-maiztasunaren formula",
    "STEP_1_TEXT_17": "Ilustrazio honek taupaden arteko denbora minutuko taupadetara (BPM) bihurtzeko erabiltzen den formula erakusten du.",
    "STEP_1_TITLE_9": "Osasunaren Jarraipena",
    "STEP_1_TEXT_18": [
      "Osasun-baldintzak simulatzeko logika bat gehitu genezake, non bihotzak kolorez aldatzen duen edo alarma-soinu bat igortzen duen erritmoa altuegia edo baxuegia bada.",
      "Hau bihotz-osasunari buruzko hezkuntza-proiektu bat izan daiteke."
    ],
    "STEP_1_TEXT_19": "Kodeak LEDaren kolorea edo erakutsitako irudia alda dezake BPM osasuntsu ez den tarte batetik ateratzen bada.",
    "STEP_1_TITLE_10": "Soinu eta Ikusmen Alertak",
    "STEP_1_TEXT_20": "Soinu eta ikusmen alertak inplementatuko ditugu simulatutako bihotz-maiztasuna arrisku-zonetan sartzen bada.",
    "STEP_1_TEXT_21": [
      "Adibidez, soinu altu bat eta garezur bat pantailan bihotza 'gelditzen' bada.",
      "Alerta hauek irisgarritasuna eta informazioaren argitasuna hobetzen dituzte."
    ],
    "STEP_1_TITLE_11": "Pantaila Anitzak (Aukerakoa)",
    "STEP_1_TEXT_22": "Hainbat Micro:bit baditugu, bat bihotz-monitore gisa eta bestea kontrol-interfaze gisa funtziona dezakegu, irrati bidez komunikatuz.",
    "STEP_1_TEXT_23": [
      "Micro:bit batek BPMa bakarrik erakutsi dezake eta besteak bihotzaren bistaratzea eta kontrolak.",
      "Horrek haririk gabeko komunikazioaren kontzeptua sartuko luke gailuen artean."
    ],
    "STEP_1_TEXT_24": [
      "Irrati-komunikazioak proiektuaren konplexutasun eta funtzionalitate handiagoa ahalbidetuko luke.",
      "Hona hemen kodea nola egituratu daitekeen konfigurazio honetarako adibide bat:"
    ],
    "STEP_1_TEXT_25": [
      "Kode honek zereginak bi Micro:bit-en artean banatuko lituzke, urruneko jarraipen sistema bat simulatuz."
    ],
    "STEP_1_TITLE_12": "Proiektuaren Amaiera",
    "STEP_1_TEXT_26": [
      "Funtzionalitate guztiak inplementatu ondoren, proiektua sakonki probatuko dugu dena behar bezala funtzionatzen duela eta erabiltzailearen esperientzia optimoa dela ziurtatzeko.",
      "Doikuntzak egingo ditugu 'taupada' perfektua izan arte."
    ],
    "STEP_1_TEXT_27": "Ziurtatu feedback bisuala eta sonoroa ondo sinkronizatuta daudela.",
    "STEP_1_TEXT_28": "Zure 'Micro:bit-aren Taupada' prest dago!",
    "STEP_1_TITLE_13": "Pertsonalizazio Aurreratua",
    "STEP_1_TEXT_29": "Esperimentatu bihotzaren animazio ezberdinekin, soinu pertsonalizatuekin edo gehitu sentsore gehiago esperientzia are murgiltzaileagoa lortzeko.",
    "STEP_2_TITLE": "2. Pausoa: Kodea",
    "STEP_2_TEXT": "Deskargatu dagoeneko konpilatutako .hex fitxategia zuzenean zure Micro:bit-era kargatzeko.",
    "STEP_3_TITLE": "3. Pausoa: Eboluzionatu Kodea",
    "STEP_3_TEXT": "Aldatu kodea musika erritmo oso bat sortzeko, erritmoari erantzuteko joko bat egiteko, edo beste proiektu batzuekin konektatzeko!"
  },
  "SECRET_MESSAGE_PAGE": {
    "TITLE": "Mezu Sekretua",
    "VIDEO_NOT_SUPPORTED": "Zure arakatzaileak ez du bideo etiketa onartzen.",
    "MORSE_CODE_CAPTION": "Morse Alfabetoa",
    "INTRODUCTION_TITLE": "Sarrera",
    "INTRODUCTION_TEXT": "Proiektu honek Micro:bit-a erabiltzen irakasten dizu mezu sekretuak Morse kode bidez bidaltzeko eta jasotzeko.",
    "INTRODUCTION_TEXT_1": "Testua argi eta soinu sekuentzietara nola bihurtu eta berriro nola deszifratu ikasiko duzu. Prest espioitza digitalerako?",
    "TARGET_TITLE": "Helburua",
    "TARGET_TEXT": "Morse kode bidezko komunikatzaile funtzional eta irisgarri bat sortu Micro:bit-a erabiliz, mezuak modu irisgarrian bidali eta jasotzeko gai dena.",
    "MATERIALS_TITLE": "Materialak",
    "MATERIALS_LIST": [
      "2 Micro:bit (elkarren arteko komunikaziorako)",
      "USB konexioa duen ordenagailua",
      "USB datu kablea",
      "Python Editorea"
    ],
    "STEPS_TITLE": "Programazio Pausoak",
    "STEP_1_TITLE": "1. Pausoa: Morse Kodea Prestatzea",
    "STEP_1_TEXT": "Morse kodearen alfabetoa Python-en definitzen hasiko gara. Letra eta zenbaki bakoitzak puntu (.) eta marra (-) bidezko irudikapena izango du.",
    "STEP_1_TEXT_1": "Adibidez, 'A' letra '.-' da, 'B' '-...' da eta '1' '.----' da.",
    "STEP_1_TEXT_2": "Hiztegi bat erabiliko dugu bihurketa hauek gordetzeko, eta horrek testua Morse kodera eta alderantziz itzultzea erraztuko du.",
    "STEP_1_TEXT_3": "Hona hemen Morse alfabetoa eraikitzeko hasierako zatia:",
    "STEP_1_TEXT_4": "Kode honek gure mezuak kodetzeko eta deskodetzeko oinarriak ezartzen ditu.",
    "STEP_1_TEXT_5": "Gainera, zenbakientzako eta oinarrizko puntuazio-marka batzuetarako definizioak gehituko ditugu gure komunikazioak aberasteko.",
    "STEP_1_TEXT_6": "Hona hemen Morse alfabetoaren kode osoa:",
    "STEP_1_TEXT_7": "Hau da mezu sekretuen proiektuaren gakoa. Garrantzitsua da erabili nahi ditugun karaktere guztiak behar bezala definituta egotea.",
    "STEP_1_TEXT_8": "Hiztegi osoa dugunean, kodetzeko eta deskodetzeko funtzioetan lanean hasi ahal izango gara.",
    "STEP_1_TEXT_9": "Lehen zati hau funtsezkoa da Morse itzultzailea sortzeko.",
    "STEP_1_TITLE_2": "2. Pausoa: Testua Morse Kodera Itzultzea",
    "STEP_1_TEXT_11": "Orain, testu-mezu bat hartu eta Morse kodearen irudikapenera bihurtzen duen funtzio bat sortuko dugu. Funtzioak mezuaren karaktere bakoitza zeharkatu beharko du, bere baliokidea Morse hiztegian bilatu eta emaitza den kate batera kateatu.",
    "STEP_1_TEXT_12": "Gainera, karaktereak eta hitzak Morse kodean nola bereiztu behar diren ere kontuan hartu beharko dugu (normalean karaktere arteko espazioekin eta ' / ' hitzen artean).",
    "STEP_1_TEXT_13": "Hona hemen 'text_to_morse' funtzioaren kodea:",
    "STEP_1_TEXT_14": "Funtzio hau gure mezu sekretuak bidaltzeko gaitasunaren bihotza izango da.",
    "STEP_1_TEXT_15": "Probatzea, 'HOLA' bezalako mezu sinple bat erabil dezakegu eta irteera '.... --- .-.. .-' den ikusi.",
    "STEP_1_TEXT_16": "Zati hau funtsezkoa da gure hitzak hizkuntza sekretura bihurtzeko.",
    "STEP_1_TEXT_17": "Ziurtatu funtzioa mezu mota ezberdinekin probatzen duzula bere sendotasuna egiaztatzeko.",
    "STEP_1_TITLE_3": "3. Pausoa: Morse Kodea Bidaltzea (Bisuala eta Sonoroa)",
    "STEP_1_TEXT_18": "Morse kodean mezua dugunean, bidaltzeko modu bat behar dugu. Irisgarria izan dadin, Micro:bit-aren LED pantaila (bisuala) eta soinua (auditiboa) erabiliko ditugu.",
    "STEP_1_TEXT_19": "Marra (-)' bat LED argi luzeago batekin eta soinu tonu luzeago batekin irudikatuko da. Puntu ('.') bat LED argi laburrago batekin eta soinu tonu laburrago batekin. Karaktere arteko espazio bat etenaldi labur bat izango da, eta hitzen arteko espazio bat, etenaldi luzeago bat.",
    "STEP_1_TEXT_20": "Hona hemen 'send_morse_signal' funtzioa:",
    "STEP_1_TEXT_21": "Funtzio honek gure Micro:bit-a Morse seinale igorle multisentsorial bihurtuko du.",
    "STEP_1_TEXT_22": "Garrantzitsua da puntuen, marren eta etenaldien iraupen-denborak doitzea, erraz bereiz daitezen.",
    "STEP_1_TEXT_23": "Ikusmen eta entzumen seinaleen konbinazioak proiektuaren irisgarritasuna nabarmen hobetzen du.",
    "STEP_1_TEXT_24": "Hau da kodea esperientzia interaktibo bihurtzen duen funtzioa.",
    "STEP_1_TITLE_4": "4. Pausoa: Morse Kodea Jasotzea eta Deskodetzea",
    "STEP_1_TEXT_25": "Zailena jasotzea da. Micro:bit-ak ez duenez mikrofono sarrerarik Morse soinuak detektatzeko, jasotzea A eta B botoiekin, edo ukipen-sentsore batekin simulatuko dugu.",
    "STEP_1_TEXT_26": "A botoiak 'puntu' bat simula dezake eta B botoiak 'marra' bat. Botoien sakatzeak eta sakatze bakoitzaren iraupena detektatuko ditugu Morse kodea berreraikitzeko.",
    "STEP_1_TEXT_27": "Gainera, 'morse_to_text' funtzio bat sortuko dugu alderantzizko prozesua egingo duena: Morse kode sekuentzia bat hartu eta irakurgarria den testu bihurtu.",
    "STEP_1_TEXT_28": "Hona hemen jasotzeko eta deskodetzeko kodea:",
    "STEP_1_TEXT_29": "Logika honek gure mezu sekretuak 'irakurtzeko' aukera emango digu.",
    "STEP_1_TEXT_30": "Deskodetzeko funtzioak alderantzizko Morse hiztegia erabiliko du puntu eta marra sekuentziak letretara eta hitzetara itzultzeko.",
    "STEP_1_TEXT_31": "Funtsezkoa da botoien sakatzeen arteko denborak behar bezala kudeatzea puntuen, marren eta espazioen artean bereizteko.",
    "STEP_1_TEXT_32": "Zati hau da mezuak deszifratzeko aukera ematen diguna.",
    "STEP_1_TITLE_5": "5. Pausoa: Irrati bidezko Interakzio Osoa (Aukerakoa)",
    "STEP_1_TEXT_33": "Mezu sekretuen esperientzia oso baterako, bi Micro:bit-ek irrati bidez komunikatu daitezke. Batek Morse kodea bidaliko luke eta besteak jasoko eta deskodetuko luke.",
    "STEP_1_TEXT_34": "Igorle den Micro:bit-ak 'radio.send()' erabiliko luke eta hartzaile denak 'radio.receive()'. Horrek errealismo eta funtzionalitate maila bat gehitzen dio proiektuari.",
    "STEP_1_TEXT_35": "Hona hemen irratia integratzeko adibide bat:",
    "STEP_1_TEXT_36": "Horrek haririk gabeko komunikazioa ahalbidetuko luke gailuen artean.",
    "STEP_1_TEXT_37": "Garrantzitsua da ziurtatzea bi Micro:bit-ak irrati talde berean konfiguratuta daudela eta transmisio abiadura egokia dela.",
    "STEP_1_TEXT_38": "Irrati-komunikazioak beste aplikazio askori ateak irekitzen dizkie.",
    "STEP_1_TITLE_6": "6. Pausoa: Irisgarritasun Hobekuntzak",
    "STEP_1_TEXT_39": "Morse komunikatzailea are irisgarriagoa egiteko, honako hauek gehitu genitzake:",
    "TRANSFORMANT_LIST": [
      "Bibrazioa: Entzumen-urritasuna duten erabiltzaileentzat, Micro:bit-ak bibra dezake soinu bat igorri beharrean.",
      "Pantaila handitua: Deskodetutako mezua kanpoko pantaila handiago batean erakutsi.",
      "Sarrera alternatiboa: Mugimendu-sentsoreak (azelerometroa) erabili puntu eta marrak simulatzeko, mugikortasun arazoak dituzten pertsonei erabilera erraztuz."
    ],
    "STEP_1_TEXT_40": "Hobekuntza hauek proiektua erabiltzaile-sorta zabalago baterako erabilgarria izango dela bermatuko lukete.",
    "STEP_1_TEXT_41": "Funtzio hauen inplementazioak feedback mota ezberdinak nola eman daitezkeen arretaz kontuan hartu behar du.",
    "STEP_1_TEXT_42": "Diseinutik abiatutako inklusioa da proiektu arrakastatsuen gakoa.",
    "STEP_1_TITLE_7": "7. Pausoa: Arazketa eta Probak",
    "STEP_1_TEXT_43": "Funtsezkoa da kodearen zati bakoitza modu independentean eta gero batera probatzea. Bidal ezazu proba-mezuak, sinpleak zein konplexuak, kodetzea, bidaltzea, jasotzea eta deskodetzea primeran funtzionatzen dutela ziurtatzeko.",
    "STEP_1_TEXT_44": "Doitu denborak eta etenaldiak behar den moduan seinaleen argitasuna optimizatzeko.",
    "STEP_1_TEXT_45": "Arazketa prozesu iteratibo bat da, zure Morse komunikatzailearen kalitatea bermatzen duena.",
    "STEP_1_TITLE_8": "8. Pausoa: Kode Osoa",
    "STEP_1_TEXT_46": "Hona hemen 'Mezu Sekretua' proiektuaren kode osoa Micro:bit-erako.",
    "STEP_1_TEXT_47": "Kode honek aurreko pausoetan deskribatutako funtzionalitate guztiak integratzen ditu, Morse alfabetoaren definiziotik hasi eta mezuak bidali eta jasotzera arte.",
    "STEP_1_TEXT_48": "Etorkizuneko esperimentu eta pertsonalizazioetarako abiapuntu izateko diseinatuta dago.",
    "STEP_1_TITLE_9": "9. Pausoa: .hex fitxategia Deskargatu",
    "STEP_1_TEXT_49": "Zuk zeuk programatu nahi ez baduzu, konpilatutako .hex fitxategia deskarga dezakezu zuzenean zure Micro:bit-era kargatzeko.",
    "STEP_1_TEXT_50": "Fitxategi honek 'Mezu Sekretua' jokoaren kodea erabiltzeko prest dauka. Micro:bit-a ordenagailura konektatu eta .hex fitxategia agertzen den unitatera arrastatu besterik ez duzu egin behar.",
    "STEP_1_TEXT_51": "Horrek proiektua berehala probatzeko aukera emango dizu.",
    "STEP_2_TITLE": "10. Pausoa: Eboluzionatu Kodea",
    "STEP_2_TEXT": "Aldatu kodea zifratu konplexuago bat sortzeko, sarrera/irteera metodo berriak gehitzeko, edo beste komunikazio proiektu batzuekin integratzeko."
  },
  "RPS_PAGE": {
    "TITLE": "Harri, Orri, Ar",
    "VIDEO_NOT_SUPPORTED": "Zure arakatzaileak ez du bideo etiketa onartzen.",
    "INTRODUCTION_TITLE": "Sarrera",
    "INTRODUCTION_TEXT": "Proiektu honek Micro:bit-a erabiltzen irakasten dizu 'Harri, Orri, Ar' joko klasikoa sortzeko. Prest inteligentzia artifizialari aurre egiteko!",
    "INTRODUCTION_TEXT_1": "LED pantaila aukerak (harria, orria edo ar) erakusteko eta botoiak zure aukera egiteko nola erabili ikasiko duzu. Gainera, zenbaki ausazkoen sortzaile bat ere sartuko dugu Micro:bit-aren erabakirako.",
    "MATERIALS_TITLE": "Materialak",
    "MATERIALS_LIST": [
      "1 Micro:bit",
      "USB konexioa duen ordenagailua",
      "USB datu kablea",
      "Python Editorea"
    ],
    "TARGET_TITLE": "Helburua",
    "TARGET_TEXT": "'Harri, Orri, Ar' joko irisgarri eta funtzional bat sortu Micro:bit-a erabiliz, interakziorako seinale bisualak eta entzumenekoak erabiliz.",
    "STEPS_TITLE": "Programazio Pausoak",
    "STEP_1_TITLE": "1. Pausoa: Hasierako Konfigurazioa eta Jokalariaren Aukeraketa",
    "STEP_1_TITLE_2": "Beharrezko inportazioak",
    "STEP_1_TEXT_1": "Lehenik, Micro:bit-aren funtzionamendurako eta zenbaki ausazkoen sorkuntzarako beharrezkoak diren moduluak inportatuko ditugu.",
    "IMPORTS_LIST": [
      "import microbit",
      "import random"
    ],
    "STEP_1_TEXT_2": "Lerro hauek Micro:bit-aren osagaiekin interakzionatzeko eta ausazko emaitzak lortzeko aukera emango digute.",
    "STEP_1_TITLE_3": "Jokalariaren aukeraketa botoiekin",
    "STEP_1_TEXT_3": "Jokalariak bere aukera A edo B botoiak sakatuz egingo du. A botoia 'Harria' izan daiteke eta B botoia 'Orria'. 'Ar' bi botoiak sakatzen badira aukeratuko dugu.",
    "STEP_1_TEXT_4": "Botoiak sakatzen direnean detektatzen duen funtzio bat inplementatuko dugu eta balio numeriko bat esleituko diogu (0 Harria, 1 Orria, 2 Ar).",
    "STEP_1_TITLE_4": "Irudien definizioa",
    "STEP_1_TEXT_5": "Harria, orria eta ar Micro:bit-aren LED pantailan irudikatuko dituzten irudiak definituko ditugu. LED matrizea erabiliko dugu sinpleki marrazteko.",
    "STEP_1_TEXT_6": "Hona hemen irudiak nola definitu:",
    "CODE_1_LIST": [
      "harria = microbit.Image.SQUARE",
      "orria = microbit.Image.CHESSBOARD",
      "ar = microbit.Image.SCISSORS"
    ],
    "STEP_1_TEXT_7": "Irudi hauek jokoa bisualagoa eta intuitiboagoa egingo dute.",
    "STEP_1_TITLE_5": "Jokoaren logika: Micro:bit-aren aukeraketa",
    "STEP_1_TEXT_8": "Micro:bit-ak bere aukera ausaz egin beharko du. 'random.randint(0, 2)' funtzioa erabiliko dugu 0 eta 2 arteko zenbaki bat lortzeko, harria, orria edo ar irudikatuko duena.",
    "STEP_1_TEXT_9": "Aukera hau jokalariak bere aukera egiten duen bakoitzean egingo da, jokoa ezustekoa dela ziurtatuz.",
    "STEP_1_TEXT_10": "Hona hemen Micro:bit-aren aukeraketarako kodea:",
    "STEP_1_TEXT_11": "Zati hau funtsezkoa da jokoaren interaktibitaterako.",
    "STEP_1_TITLE_6": "Irabazlea zehaztea",
    "STEP_1_TEXT_12": "Orain txandaren irabazlea zehazteko logika inplementatuko dugu. Gogoratu arauak: Harriak Arriari irabazten dio, Arriak Orriari, eta Orriak Harriari.",
    "STEP_1_TEXT_13": "Baldintzazko batzuen (if/elif/else) bidez jokalariaren eta Micro:bit-aren aukerak alderatuko ditugu.",
    "STEP_1_TEXT_14": "Hona hemen 'determine_winner' funtzioa:",
    "STEP_1_TITLE_7": "Emaitza erakustea",
    "STEP_1_TEXT_15": "Irabazlea zehaztu ondoren, emaitza Micro:bit-aren LED pantailan erakutsiko dugu. Ikonoak erabil ditzakegu (adibidez, aurpegi alaia irabazteko, tristea galtzeko, eta neutroa berdintzeko).",
    "STEP_1_TEXT_16": "Ikonoaz gain, Micro:bit-ak soinu ezberdin bat igor dezake emaitza bakoitzerako, ikusmen urritasuna duten erabiltzaileentzat irisgarritasuna hobetuz.",
    "STEP_1_TITLE_8": "Jokoaren begizta nagusia",
    "STEP_1_TEXT_17": "Jokoa etengabe errepikatuko da erabiltzaileak gelditzea erabaki arte. 'while True' begizta bat erabiliko dugu jokoa aktibo mantentzeko.",
    "STEP_1_TEXT_18": "Begizta barruan, jokalariaren sarreraren zain egongo gara, Micro:bit-aren aukeraketa egingo dugu, irabazlea zehaztuko dugu eta emaitza erakutsiko dugu.",
    "STEP_1_TEXT_19": "Hona hemen begizta nagusiaren oinarrizko egitura:",
    "STEP_1_TITLE_9": "Feedback multisentsoriala",
    "STEP_1_TEXT_20": "Irisgarritasuna hobetzeko, soinuak gehituko ditugu ekintza eta emaitza bakoitzerako. Adibidez, soinu labur bat aukera bat egitean, garaipen soinu bat, porrot soinu bat eta berdinketa soinu bat.",
    "STEP_1_TEXT_21": "'music' modulua erabiliko dugu melodia sinpleak erreproduzitzeko.",
    "STEP_1_TEXT_22": "Horrek ikusmen urritasuna duten erabiltzaileek jokoaz guztiz gozatu ahal izateko aukera emango die.",
    "STEP_1_TITLE_10": "Soinuaren inplementazioa",
    "STEP_1_TEXT_23": "Integraremos soinu funtzioak jokoaren logikan. Adibidez, jokalariak irabazten duenean, garaipenaren melodia erreproduzituko da, eta abar.",
    "STEP_1_TEXT_24": "Garrantzitsua da soinuak bereizgarriak eta erraz ezagutzeko modukoak izatea.",
    "STEP_1_TEXT_25": "Gehikuntza honek nabarmen handituko ditu jokoaren murgiltzea eta irisgarritasuna.",
    "STEP_1_TITLE_11": "Keinuen detekzioa (Aukerakoa)",
    "STEP_1_TEXT_26": "Botoien ordezko gisa, Micro:bit-aren azelerometroa erabil genezake keinuak detektatzeko. Adibidez, Micro:bit-a astinduz ausazko aukera bat egin daiteke, edo alde batera inklinatuz harria, orria edo ar aukeratu.",
    "STEP_1_TEXT_27": "Horrek sarrera aukera irisgarriagoa eskaintzen du mugikortasun arazoak dituzten erabiltzaileentzat.",
    "STEP_1_TITLE_12": "Kode osoa keinuekin",
    "STEP_1_TEXT_28": "Hona hemen gure 'Harri, Orri, Ar' jokoan keinuen detekzioa nola integra genezakeen adibide bat:",
    "STEP_1_TEXT_29": "Kode honek botoien sarrerak keinuekin ordezten edo osatzen ditu.",
    "STEP_1_TEXT_30": "'gest_detection' funtzioa azelerometroa irakurtzeaz eta mugimenduak jokoaren aukera bihurtzeaz arduratuko litzateke.",
    "STEP_1_TEXT_31": "Funtzionalitate honek jokoa malguagoa eta behar ezberdinetara egokituagoa egingo luke.",
    "STEP_1_TEXT_32": "Hau da nola egokitzapenek jokoaren esperientzia hobetu dezaketen guztiontzat.",
    "STEP_1_TEXT_33": "'on_shake' funtzio bat inplementatzea kontuan hartuko dugu Micro:bit-aren mugimendua detektatzeko.",
    "STEP_1_TEXT_34": "Funtzio honek hiru aukeretako bat (Harria, Orria edo Ar) itzuliko luke ausaz edo astintzearen intentsitatearen arabera.",
    "STEP_1_TEXT_35": "Azelerometroaren erabilerak interakzio dinamikoagoa eta kontrol fisikoekiko menpekotasun txikiagoa ahalbidetzen du.",
    "STEP_1_TEXT_36": "Hau gehikuntza handi bat da jokalari guztien inklusiorako.",
    "STEP_1_TITLE_13": "Beste Micro:bit batekin Komunikazioa (Jokalari anitzeko)",
    "STEP_1_TEXT_37": "Lagun baten aurka jolasteko, bi Micro:bit-ek irrati bidez komunikatu daitezke. Jokalari bakoitzak bere aukera egingo luke bere Micro:bit-ean, eta honek bere aukera beste Micro:bit-era bidaliko luke.",
    "STEP_1_TEXT_38": "Hartzaile den Micro:bit-ak bi aukerak alderatuko lituzke eta emaitza erakutsiko luke.",
    "STEP_1_TEXT_39": "Horrek jokalari anitzeko modu interaktibo eta irisgarri bati ateak irekitzen dizkio.",
    "STEP_1_TITLE_14": "Jokalari anitzeko inplementazioa",
    "STEP_1_TEXT_40": "Hona hemen kodea nola aldatu genezakeen irrati bidezko jokalari anitzeko modua ahalbidetzeko:",
    "STEP_1_TEXT_41": "Micro:bit batek mezu bat bidaliko luke bere aukerarekin eta besteak mezua jasoko luke eta alderaketa egingo luke.",
    "STEP_1_TEXT_42": "Garrantzitsua da bi Micro:bit-ak irrati talde berean konfiguratuta egotea.",
    "STEP_1_TEXT_43": "Irrati-komunikazioa tresna indartsu bat da joko interaktiboak sortzeko.",
    "STEP_1_TEXT_44": "Hau da lagunekin eta familiarekin jolasteko gakoa.",
    "STEP_1_TITLE_15": "Erabiltzaile interfazearen hobekuntzak",
    "STEP_1_TEXT_45": "Erabiltzaile interfazea argiagoa eta irisgarriagoa egiteko, honako hauek egin genitzake:",
    "STEP_1_TEXT_46": "Harria, orria eta arrerako animazio landuagoak erakutsi.",
    "STEP_1_TEXT_47": "Soinu tonu ezberdinak erabili jokalariaren aukera bakoitzerako (Harria, Orria, Ar).",
    "STEP_1_TEXT_48": "Horrek esperientzia aberatsagoa eta bisualki erakargarriagoa egingo luke.",
    "STEP_1_TITLE_16": "Puntuazioa eta txandak",
    "STEP_1_TEXT_49": "Puntuazio sistema bat gehitu genezake txanda gehien irabazten duena erregistratzeko. Hainbat txanda ere inplementatu litezke, eta jokoa jokalari batek aurrez zehaztutako puntuazio batera iristen denean amaituko litzateke.",
    "STEP_1_TEXT_50": "Horrek jokoaren berrerabilgarritasuna eta lehiakortasuna areagotuko lituzke.",
    "STEP_1_TEXT_51": "Micro:bit-ean ikusgai dagoen puntuazioak jokalariak motibatu ditzake.",
    "STEP_1_TITLE_17": "Kodea puntuaziorako",
    "STEP_1_TEXT_52": "Hona hemen gure jokoan puntuazioa nola inplementatu genezakeen:",
    "STEP_1_TEXT_53": "'player_score' eta 'microbit_score' aldagaiak txanda bakoitzaren ondoren eguneratu litezke.",
    "STEP_1_TITLE_18": "Jokoaren amaiera",
    "STEP_1_TEXT_54": "Txanda kopuru zehatz bat jokatu ondoren, jokoak azken irabazlea iragarri beharko luke. Micro:bit-ak 'IRABAZI DUZU!' edo 'GALDU DUZU!' mezu bat erakuts dezake animazio batekin.",
    "STEP_1_TEXT_55": "Gainera, emaitza bakoitzerako amaierako melodia ezberdin bat erreproduzi daiteke.",
    "STEP_1_TEXT_56": "Horrek amaiera asegarria ematen dio jokoari.",
    "STEP_1_TITLE_19": "Amaierako kodea",
    "STEP_1_TEXT_57": "Hona hemen jokoaren amaiera nola kudeatu adibide bat:",
    "STEP_1_TEXT_58": "Logika honek jokoak hasiera eta amaiera argiak dituela ziurtatzen du.",
    "STEP_1_TITLE_20": "Arazketa eta probak",
    "STEP_1_TEXT_59": "Edozein programazio-proiektutan bezala, funtsezkoa da jokoa sakonki arazketa eta probatzea. Ziurtatu arau guztiak behar bezala funtzionatzen dutela, soinuak eta animazioak espero bezala erreproduzitzen direla, eta erabiltzailearen interakzioa arina dela.",
    "STEP_1_TEXT_60": "Ohiko arazketak kalitatezko joko bat bermatzen du.",
    "STEP_2_TITLE": "2. Pausoa: Kode Osoa",
    "STEP_2_TEXT": "Zuk zeuk programatu nahi ez baduzu, konpilatutako .hex fitxategia deskarga dezakezu zuzenean zure Micro:bit-era kargatzeko.",
    "STEP_3_TITLE": "3. Pausoa: Eboluzionatu Kodea",
    "STEP_3_TEXT": "Aldatu kodea jokoaren aukera berriak sortzeko, jokalari anitzeko modu aurreratuago bat gehitzeko, edo beste Micro:bit proiektu batzuekin integratzeko."
  },
  "COUNTDOWN_PAGE": {
    "TITLE": "Atzerako Azken Kontaketa",
    "VIDEO_NOT_SUPPORTED": "Zure arakatzaileak ez du bideo etiketa onartzen.",
    "INTRODUCTION_H2": "Sarrera",
    "INTRODUCTION_P": [
      "Proiektu hau 10etik 0ra arteko atzerako kontaketa bat programatzean datza. Atzerako kontaketa Micro:bit pantailan erakutsiko da eta taupada batekin batera joango da, 'Micro:bit-aren taupada' proiektuan egindako berbera, ikusmen-estimulazioaz gain entzumen-estimulazioa ere izateko.",
      "Proiektuan begizta mota berri bat ikusiko da, for begizta bat, eta atzerako kontaketa egiteko erabiliko dugun aldagai bat nola deklaratu ikusiko da.",
      "Has dadila atzerako kontaketa!"
    ],
    "MATERIALS_H2": "Materialak",
    "MATERIAL_MICROBIT": "1 Micro:bit.",
    "MATERIAL_ITEM_1": "Ordenagailu eramangarria.",
    "MATERIAL_ITEM_2": "USB-A kablea",
    "MATERIAL_ITEM_3": "Python Editorea.",
    "STEPS_H2": "Pausoak",
    "STEP_1_H3": "1. Pausoa: Kodea Garatzea",
    "STEP_1_H4": "Aldagai bat deklaratzea",
    "STEP_1_P": [
      "Atzerako kontaketaren kodea, agian, aurreko proiektuaren kodea baino sinpleagoa da, nahiz eta bere berezitasunak ere badituen. Lehenengoa, aldagai baten deklarazioa da.",
      "Aldagaiez hitz egiten dugunean, esparru globaleko aldagai baten eta esparru lokaleko aldagai baten artean bereizten jakin behar dugu. Oraingoz, jakin beharreko bakarra da esparru globaleko aldagaiak, proiektu honetan erabiliko duguna bezala, inportazioen lerroaren ondoren deklaratzen direla eta honela egiten dela:"
    ],
    "STEP_1_P_2": "[aldagai izena] = [aldagai balioa]",
    "STEP_1_P_3": "Deklarazio adibide bat hau izango litzateke:",
    "STEP_1_P_4": "Hori esanda, gure proiektuaren hasieran honako hau idatziko dugu:",
    "STEP_1_P_5": "6. lerroan i aldagaia eta bere balioa: 10 deklaratzen ditugu.",
    "STEP_1_H4_1": "For begizta",
    "STEP_1_P_6": "Aldagaia deklaratu ondoren, for begizta hasten dugu, hau da proiektuaren begizta nagusia.",
    "STEP_1_H4_2": "Kodearen azalpena",
    "STEP_1_P_7": [
      "Proiektu honetan for begizta azaldu behar dugu. For begizta bat aldi kopuru jakin batean exekutatzen da. Zenbat aldiz exekutatzen den erabakitzeko, begizta kontrolatzen duen aldagaiaren balioa aldatzen duen algoritmo bat sartu ohi da begizta exekutatzen den bakoitzean. Kasu honetan step aldagaiaren balioa aldatzen da.",
      "9. lerroan for begizta deklaratzen dugu eta 11 aldiz exekutatuko dela ezartzen dugu (index in range(11)). Azal dezagun apur bat gehiago azken esaldi hau:",
      "index: Aldatuko den balioa da.",
      "in; index bere balio-tartearekin lotu.",
      "range(): Balio-tartea adierazten du, edo begiztak egin beharreko pausoak.",
      "11: For begiztak exekutatuko den aldi (pauso) kopurua da."
    ],
    "CODE_ITEM_1": "index: Aldatuko den balioa da.",
    "CODE_ITEM_2": "in; index bere balio-tartearekin lotu.",
    "CODE_ITEM_3": "range(): Balio-tartea adierazten du, edo begiztak egin beharreko pausoak.",
    "CODE_ITEM_4": "11: For begiztak exekutatuko den aldi (pauso) kopurua da.",
    "STEP_1_P_8": [
      "10. eta 11. lerroak aurreko proiektutik ezagutzen ditugu dagoeneko. 12. lerroan egiten ari garena i aldagaiaren balioa bat gutxitzea da for begizta exekutatzen den bakoitzean.",
      "Azkenik, 13. lerroan kodea 1 segundo gelditzea eragiten dugu for begizta berriro exekutatu aurretik."
    ],
    "STEP_1_H4_3": "Kontzeptua",
    "STEP_1_P_9": [
      "Ez al zaizu deigarria iruditu kodearen zerbait? Ohartu al zara i aldagaiaren balioa 10 dela eta for begizta 11 aldiz exekutatzen dugula? 'Inkoherentzia' hori 0 zenbaki bat delako gertatzen da eta, beraz, programatzerakoan kontuan hartu behar da. For begizta 10 aldiz bakarrik exekutatzen badugu, i aldagaiak hartuko duen azken zenbakia 1 izango da eta ez 0.",
      "Egin proba!"
    ],
    "STEP_2_H3": "2. Pausoa: Kodea",
    "STEP_2_P": ".hex fitxategia deskargatu.",
    "STEP_3_H3": "3. Pausoa: Eboluzionatu kodea",
    "STEP_3_P": "Aldatu kodea amaierako animazio bat gehituz, edo atzerako kontaketa erabiliz Micro:bit-en prozesu bat hasteko. Atzerako kontaketa hau proiektu handiago baten lehen harria izan daiteke!'"
  },
  "SETTINGS": {
    "TITLE": "Ezarpenak",
    "DESCRIPTION": "Hemen aplikazioaren ezarpenak doitu ditzakezu.",
    "THEME_TITLE": "Itxura",
    "DARK_MODE": "Modu Iluna",
    "DARK_MODE_TOGGLE": "Modu Iluna",
    "FONT_FAMILY_SELECT": "Letra Mota",
    "FONT_SIZE_SELECT": "Letra Tamaina",
    "FONT_SIZE_SMALL": "Txikia",
    "FONT_SIZE_MEDIUM": "Ertaina",
    "FONT_SIZE_LARGE": "Handia",
    "ANIMATIONS_TOGGLE": "Animazioak Desgaitu",
    "LANGUAGE_SELECT": "Hizkuntza"
  },
  "ACCESSIBLE_PROGRAMMING": {
    "TITLE": "Programazio Irisgarria",
    "H1": "Programazio Irisgarria Micro:bit-ekin",
    "INTRO_P1": "Micro:bit-ekin programatzeak aukera bikaina eskaintzen du adin eta gaitasun guztietako pertsonak teknologiaren munduan sartzeko. Hala ere, benetan inklusiboa dela ziurtatzeko, funtsezkoa da irisgarritasuna proiektuen diseinu-fasetik kontuan hartzea.",
    "INTRO_P2": "Irisgarritasuna ezin da izan proiektuaren amaieran gehitzen den adabaki bat, baldintza bat betetzeko edo onurak lortzeko.",
    "CREATION_TITLE": "Micro:bit-erako Proiektu Irisgarriak Sortzea",
    "CREATION_P1": "Micro:bit-ekin proiektu irisgarriak sortzeko, garrantzitsua da hainbat alderdi kontuan hartzea:",
    "CREATION_LI1_TITLE": "Feedback Multisentsoriala:",
    "CREATION_LI1_TEXT": "LED pantaila ez ezik, soinua ere erabiltzea (Micro:bit-aren modeloak ahalbidetzen badu edo bozgorailu batera konektatzen bada) informazioa emateko. Adibidez, joko batek soinu bat igor dezake asmatzean eta beste bat huts egitean.",
    "CREATION_LI2_TITLE": "Sarrera Alternatiboak:",
    "CREATION_LI2_TEXT": "A eta B botoiez haratago doazen aukerak kontuan hartzea. Micro:bit-aren pinak kanpoko sentsore edo egokitutako pultsadoreetara konekta daitezke, mugikortasun urria duten pertsonei interakzioa erraztuz. Beste aukera bat Micro:bit-aren azelerometroa erabiltzea da.",
    "CREATION_LI3_TITLE": "Argitasuna eta Sinpletasuna:",
    "CREATION_LI3_TEXT": "Programak ahalik eta sinple eta argien mantentzea. Ekintza-sekuentzia konplexuak saihestea, zailtasun kognitiboak edo memoria-arazoak dituzten erabiltzaileak nahas ditzaketenak.",
    "CREATION_LI4_TITLE": "Dokumentazio Argia:",
    "CREATION_LI4_TEXT": "Argibide zehatzak eta erraz ulertzeko modukoak ematea, ahal dela formatu anitzetan (testua, audioa, piktogramak).",
    "BLOCKLY_TITLE": "Bloke bidezko Programazioa (Blockly) eta Desgaitasuna",
    "BLOCKLY_P1": "Bloke bidezko programazio-interfazeak, MakeCode-k Micro:bit-erako erabiltzen duena bezalakoak, tresna indartsuak dira irisgarritasunerako. Haien izaera bisual eta intuitiboak oztopo garrantzitsuak murrizten ditu:",
    "BLOCKLY_OVERCOME_TITLE": "Gainditzen dituen Oztopoak:",
    "BLOCKLY_OVERCOME_LI1_TITLE": "Ikusmen-desgaitasuna (ikusmen urria):",
    "BLOCKLY_OVERCOME_LI1_TEXT": "Interfaze bisualak erronka izan daitezkeen arren, kolore-kodeak dituzten blokeak erabiltzeak ikusmen urria duten erabiltzaileei bloke mota azkarrago eta errazago ezagutzeko aukera ematen die.",
    "BLOCKLY_OVERCOME_LI2_TITLE": "Mugikortasun-desgaitasuna:",
    "BLOCKLY_OVERCOME_LI2_TEXT": "Blokeak manipulatzea kodea idaztea baino errazagoa izan ohi da, batez ere sagu edo teklatu egokitzapenekin. Arrastatu eta jaregin funtzioa teklatu bidezko nabigazioarekin ordezkatu daiteke sagua erabili ezin dutenentzat.",
    "BLOCKLY_OVERCOME_LI3_TITLE": "Desgaitasun kognitiboa eta ikaskuntzakoa:",
    "BLOCKLY_OVERCOME_LI3_TEXT": "Kodearen irudikapen bisualak karga kognitiboa murrizten du, sintaxi konplexuak memorizatu beharrik ez izatean. Blokeek erabiltzailea programaren egitura logikoan gidatzen dute.",
    "BLOCKLY_CHALLENGES_TITLE": "Egungo Erronkak:",
    "BLOCKLY_CHALLENGES_LI1_TITLE": "Pantaila-irakurgailuak:",
    "BLOCKLY_CHALLENGES_LI1_TEXT": "Askotan, arrastatu eta jaregin interfazeak ez dira guztiz bateragarriak pantaila-irakurgailuekin, eta horrek zaildu egiten du interakzioa itsu edo ikusmen urri larria duten pertsonentzat.",
    "BLOCKLY_CHALLENGES_LI2_TITLE": "Teklatu bidezko Nabigazioa:",
    "BLOCKLY_CHALLENGES_LI2_TEXT": "Teklatuarekin soilik nabigazio osoa eta eraginkorra ez dago beti ezin hobeto inplementatuta bloke bidezko programazio-plataforma guztietan.",
    "BLOCKLY_CHALLENGES_LI3_TITLE": "Pertsonalizazioa:",
    "BLOCKLY_CHALLENGES_LI3_TEXT": "Pertsonalizazio-aukera faltak (letra-tamaina, kolore-kontrastea, animazioak ezabatzea) hainbat ikusmen- edo kognitibo-behar dituzten erabiltzaileei eragin diezaieke.",
    "BLOCKLY_CHALLENGES_LI4_TITLE": "Dokumentazioa eta Adibideak:",
    "BLOCKLY_CHALLENGES_LI4_TEXT": "Ez dago beti irisgarritasuna kontuan hartuta diseinatutako proiektuen dokumentazio eta adibiderik.",
    "PYTHON_TITLE": "Kode bidezko Programazioa (Micro:bit Python Editorea)",
    "PYTHON_P1": "Bloke bidezko programazioaren alternatiba gisa, kode bidezko programazioa (microPython edo JavaScript) erabil daiteke. Programazio mota hau, testu arrunta denez, oso irisgarria da pantaila-irakurgailuentzat.",
    "PYTHON_P2": "Programazio mota honen arazoa da erabiltzaileek programazio-lengoaiaren gutxieneko ezagutza izan behar dutela, beraz, lengoaia eta kontzeptuak aldi berean irakatsi behar zaizkie. Hori ez da gertatzen bloke bidezko programazioarekin, lengoaiaren ezagutza ez baita beharrezkoa eta lantzen diren kontzeptu nagusiak programazio-kontzeptuak baitira, hala nola aldagaiak, konstanteak, begiztak, etab.",
    "PYTHON_P3": "Oztopo hori (lengoaiaren ezagutza) minimizatzeko gaur egun dagoen prozedura bakarra programazio-blokeak sortzea da, non ikasleak kodearen zati bat ordezkatu edo osatu besterik ez duen egin behar. Kodean programazio-blokeen eskeletoa sortzea litzateke pantaila-irakurgailu bidez %100eko sarbidea bermatzeko gaur egungo aukera bakarra.",
    "PYTHON_P4": "Programazio irisgarria sustatzeak desgaitasuna duten pertsonei ez ezik, erabiltzaile guztien esperientzia hobetzen du, teknologiaren arloan diseinu inklusiboaren kultura sustatuz.",
    "PYTHON_P5": "Jarraian bi adibide erakusten dira: bata, non Micro:bit-aren erantzuna pantailaren bidez soilik egiten den, eta bestea, irisgarriagoa, non informazioaren irteera pantailaren bidez egiten den eta soinu-irteera batekin indartzen den.",
    "MODAL_NON_ACCESSIBLE_TITLE": "Adibide Ez Irisgarria",
    "MODAL_CLOSE": "Itxi",
    "MODAL_NON_ACCESSIBLE_H2": "Bideoklipa (Ez Irisgarria)",
    "MODAL_NON_ACCESSIBLE_P": "Adibide ez irisgarriaren bideoklipa hemen egongo litzateke.",
    "MODAL_VIEW_CODE": "Ikusi Kodea",
    "MODAL_ACCESSIBLE_TITLE": "Adibide Irisgarria",
    "MODAL_ACCESSIBLE_H2": "Bideoklipa (Irisgarria)",
    "MODAL_ACCESSIBLE_P": "Adibide irisgarriaren bideoklipa hemen egongo litzateke.",
    "MODAL_CODE_TITLE": "Kodea",
    "NON_ACCESSIBLE_EXAMPLE_BUTTON": "Adibide ez-irisgarria",
    "ACCESSIBLE_EXAMPLE_BUTTON": "Adibide irisgarria"
  },
  "ACCESSIBILITY_EVALUATOR_TITLE": "Irisgarritasun Ebaluatzailea",
  "COMPROBAR_ACCESIBILIDAD_TITLE": "Irisgarritasuna Egiaztatu",
  "SETTINGS_TITLE": "Ezarpenak",
  "ACCESSIBILITY_EVALUATOR_PAGE": {
    "H2": "MicroPython Kode Editorea Irisgarritasunean Azpimarra Jarriz",
    "P": "Sartu zure MicroPython kodea Micro:bit-erako testu-eremuan. Editoreak kodea nola ikusten den ikusten lagunduko dizu eta irisgarritasuna egiaztatzeko aukera emango dizu.",
    "BTN": "Irisgarritasuna Egiaztatu",
    "TEXTAREA_PLACEHOLDER": "Idatzi zure MicroPython kodea hemen...",
    "EVALUATION_RESULTS_H3": "Ebaluazioaren Emaitza",
    "SCORE": "Puntuazioa",
    "IMPROVEMENT": "Hobekuntza",
    "REDUNDANCY_DETECTED": "Sarrera erredundantzia detektatua",
    "YES": "Bai",
    "NO": "Ez",
    "ERRORS": "Erroreak",
    "WARNINGS": "Abisuak",
    "CODE_PREVIEW_H3": "Kodearen Aurrebista",
    "NO_BUTTONS_USED": "Ez dira botoiak erabiltzen"
  },
  "VALIDATOR": {
    "AUDIO_FEEDBACK": {
      "SUCCESS_MESSAGE": "Modu anitzekoa: Audio inportazioa detektatu da.",
      "SUCCESS_MESSAGE_2": "Modu anitzekoa: Audio irteera detektatu da.",
      "ERROR_MESSAGE": "Soinu irteera falta da.",
      "ERROR_SUGGESTION": "Gehitu 'speech.say(\"[string]\")', 'music.play(music.[song])' edo 'music.([number])' ikusmen urritasuna duten erabiltzaileek informazioa jasotzeko.",
      "ERROR_SUGGESTION_2": "Inportatu 'speech' edo 'music' ikusmen urritasuna duten erabiltzaileek informazioa jasotzeko.",
      "MISSING_AUDIO_OUTPUT_WITH_DISPLAY_SHOW": "Display.show() bakarrik erabiltzen ari zara audio irteerarik gabe.",
      "SUGGEST_AUDIO_OUTPUT_WITH_DISPLAY_SHOW": "Gehitu 'import speech' edo 'import music' eta erabili 'speech.say()' edo 'music.play()' ikusmen urritasuna duten erabiltzaileei entzumen feedback-a emateko."
    },
    "BLOCKING_LOOPS": {
      "WARNING_MESSAGE": "Blokeo-begizta detektatu da.",
      "WARNING_SUGGESTION": "Sleep() oso luzeak erabiltzen ari zara. Horrek Micro:bit-ak botoiei edo ahots-komandoei azkar erantzutea eragozten du."
    },
    "INPUT_REDUNDANCY": {
      "SUCCESS_MESSAGE": "Sarrera irisgarria: Ukimen edo mugimendu sentsoreak erabiltzen dituzu.",
      "ERROR_MESSAGE": "Botoi fisikoak bakarrik erabiltzen dituzu.",
      "ERROR_SUGGESTION": "Gehitu 'pin_logo.is_touched()' mugikortasun arazoak dituzten pertsonentzat erabilera errazteko."
    },
    "COMPLEX_PRESSES": {
      "WARNING_MESSAGE": "Sakadura konplexua detektatu da.",
      "WARNING_SUGGESTION": "Saihestu bi botoi edo botoi bat eta logoa aldi berean sakatzea eskatzea, horrek interakzioa zailtzen baitu mugikortasun urritasun zehatzak dituzten erabiltzaileentzat.",
      "SUCCESS_MESSAGE": "Sakadura sinpleak: Ez da sakadura konplexurik detektatu."
    },
    "CODE_SEMANTICS": {
      "SUCCESS_MESSAGE": "Semantika: Aldagaiek izen deskribatzaileak dituzte.",
      "WARNING_MESSAGE": "Aldagai izen generikoak.",
      "WARNING_SUGGESTION": "Erabili 'alarm_status' bezalako izenak 'a' ordez, pantaila-irakurgailuek irakurtzea errazteko."
    }
  }
}