{
  "CLOSE": "Pechar",
  "ACCESSIBILITY": {
    "LANGUAGE_BUTTON_LABEL": "Idioma actual {{language}} pulsa para modificar idioma"
  },
  "TABS": {
    "MICROPYTHON": "MicroPython",
    "MICROBIT": "Micro:bit",
    "MICROIA": "MicroIA",
    "REPOSITORIO": "Repositorio"
  },
  "MICROBIT_PAGE": {
    "TITLE": "Proxectos Micro:bit",
    "OPEN_PROJECT_PREFIX": "Abrir o proxecto ",
    "PROJECTS": {
      "ACCESSIBLE_PROGRAMMING": {
        "TITLE": "Programación Accesible",
        "DESCRIPTION": "Explora a programación de Micro:bit de forma accesible.",
        "img": "assets/img/microbit-a11y.png",
        "alt": "Imaxe representativa da programación accesible con Micro:bit"
      },
      "COUNTDOWN": {
        "TITLE": "A Conta Atrás Final",
        "DESCRIPTION": "Unha conta atrás personalizable.",
        "img": "assets/img/final-countdown.png",
        "alt": "Imaxe dunha conta atrás"
      },
      "DUEL": {
        "TITLE": "Duelo ao Sol",
        "DESCRIPTION": "Un xogo de reflexos para dous xogadores.",
        "img": "assets/img/duel.png",
        "alt": "Imaxe dun duelo con Micro:bit"
      },
      "STONE_PAPER_SCISSORS": {
        "TITLE": "Pedra, Papel, Tesoura",
        "DESCRIPTION": "O clásico xogo, agora no teu Micro:bit.",
        "img": "assets/img/rps.png",
        "alt": "Imaxe do xogo Pedra, Papel, Tesoura con Micro:bit"
      },
      "SECRET_MESSAGE": {
        "TITLE": "Mensaxe Secreta",
        "DESCRIPTION": "Envía e recibe mensaxes secretas.",
        "img": "assets/img/morse_code.png",
        "alt": "Imaxe dunha mensaxe secreta con Micro:bit"
      },
      "HEARTBEAT": {
        "TITLE": "O Latexado da Micro:bit",
        "DESCRIPTION": "Visualiza o latexado da túa placa.",
        "img": "assets/img/heart.png",
        "alt": "Imaxe do latexado do corazón con Micro:bit"
      }
    }
  },
  "DUEL_PAGE": {
    "TITLE": "Duelo ao Sol",
    "VIDEO_NOT_SUPPORTED": "O teu navegador non soporta a etiqueta de vídeo.",
    "INTRODUCTION_TITLE": "Introdución",
    "INTRODUCTION_TEXT": "Este proxecto ensina a crear un xogo de reflexos para dous xogadores na Micro:bit. Prepárate para o duelo!",
    "MATERIALS_TITLE": "Materiais",
    "MATERIALS_LIST": [
      "2 Micro:bits",
      "Ordenador portátil",
      "Cable de conexión USB-A",
      "Editor de Python"
    ],
    "TARGET": "Obxectivo",
    "TARGET_TEXT_1": "Crear un xogo de reflexos simple para dous xogadores utilizando dúas Micro:bits.",
    "TARGET_TEXT_2": "Practicar a programación de bucles, condicionais e interacción entre Micro:bits.",
    "STEPS_TITLE": "Pasos para a Programación",
    "STEP_1_TITLE": "Paso 1: O Lanzamento do Duelo",
    "STEP_1_TEXT": "Comezaremos programando a lóxica básica do xogo, onde os xogadores deben reaccionar rapidamente.",
    "STEP_1_TEXT_1": "Para iso, introduciremos unha función de conta atrás e un mecanismo para detectar a presión dos botóns.",
    "STEP_1_TEXT_2": "Aquí tes o primeiro fragmento de código para a conta atrás inicial:",
    "STEP_1_TEXT_3": "Este código mostrará unha conta atrás na pantalla da Micro:bit e emitirá un son.",
    "STEP_1_TEXT_4": "Despois da conta atrás, a Micro:bit debe esperar a que un dos xogadores pulse o botón A ou B.",
    "STEP_1_TEXT_5": "O seguinte fragmento de código xestiona a detección da presión dos botóns:",
    "STEP_1_TEXT_6": "Estas liñas detectan que botón se pulsa primeiro e mostran unha frecha na dirección correspondente.",
    "STEP_2_TITLE": "Paso 2: Mellorando a Interacción",
    "STEP_2_TEXT": "Agora engadiremos elementos para facer o xogo máis dinámico e interactivo.",
    "STEP_2_TEXT_1": "Integración de son para a retroalimentación:",
    "STEP_2_TEXT_2": "O son axudará aos xogadores a saber cando comeza e termina a conta atrás, e quen pulsou primeiro.",
    "STEP_2_TEXT_3": "Tamén engadiremos unha variable para controlar o estado do xogo, como se o duelo está activo ou non.",
    "STEP_2_TEXT_4": "Aquí tes o código actualizado coa lóxica de son e estado do xogo:",
    "STEP_2_TEXT_5": "Este paso é crucial para unha experiencia de xogo accesible.",
    "STEP_3_TITLE": "Paso 3: Conectando as Micro:bits",
    "STEP_3_TEXT": "O duelo será máis emocionante se as dúas Micro:bits poden comunicarse entre elas.",
    "STEP_3_TEXT_1": "Utilizaremos o módulo de radio para enviar sinais entre as dúas Micro:bits.",
    "STEP_3_TEXT_2": "Primeiro, configuramos o canal de radio para que as Micro:bits poidan atoparse:",
    "STEP_3_TEXT_3": "Este fragmento de código inicializa a radio e configúraa a un grupo específico.",
    "STEP_3_TEXT_4": "Agora, cando un xogador pulse un botón, a súa Micro:bit enviará unha mensaxe á outra.",
    "STEP_3_TEXT_5": "O seguinte código mostra como enviar e recibir estas mensaxes:",
    "STEP_3_TEXT_6": "A Micro:bit que recibe a mensaxe debe saber que o outro xogador reaccionou.",
    "STEP_3_TEXT_7": "Xestionaremos o resultado do duelo en función de quen pulsa primeiro e quen recibe a mensaxe.",
    "STEP_3_TEXT_8": "Aquí tes o código para a lóxica de envío e recepción de mensaxes:",
    "STEP_3_TEXT_9": "Esta lóxica determina o gañador de cada rolda do duelo.",
    "STEP_3_TEXT_10": "A comunicación por radio é fundamental para a dinámica do xogo.",
    "STEP_4_TITLE": "Paso 4: Engadindo Puntuación e Múltiples Roldas",
    "STEP_4_TEXT": "Para facer o xogo máis competitivo, engadiremos un sistema de puntuación e a posibilidade de xogar varias roldas.",
    "STEP_4_TEXT_1": "Declararemos variables para as puntuacións de cada xogador e para o número de roldas xogadas.",
    "STEP_4_TEXT_2": "O xogo finalizará despois dun número predefinido de roldas, e o gañador será o que teña a puntuación máis alta.",
    "STEP_4_TEXT_3": "Aquí tes o código para xestionar a puntuación e as roldas:",
    "STEP_4_TEXT_4": "Estas variables actualízanse despois de cada rolda.",
    "STEP_4_TEXT_5": "Tamén necesitamos unha maneira de reiniciar o xogo para unha nova partida.",
    "STEP_4_TEXT_6": "A función de reinicio encargarase de restablecer as puntuacións e as roldas.",
    "STEP_4_TEXT_7": "Código para reiniciar o xogo:",
    "STEP_4_TEXT_8": "Isto permitirá xogar varias partidas sen necesidade de reiniciar as Micro:bits.",
    "STEP_4_TEXT_9": "A puntuación visible en cada Micro:bit axudará aos xogadores a seguir o progreso.",
    "STEP_4_TEXT_10": "Axustaremos as saídas visuais e sonoras para anunciar o gañador final.",
    "STEP_4_TEXT_11": "O código final debería integrar todas estas partes para un xogo completo e funcional.",
    "STEP_4_TEXT_12": "Este sistema de puntuación engade un elemento de competición ao duelo."
  },
  "HEART_PAGE": {
    "TITLE": "O Latexado da Micro:bit",
    "VIDEO_NOT_SUPPORTED": "O teu navegador non soporta a etiqueta de vídeo.",
    "INTRODUCTION_TITLE": "Introdución",
    "INTRODUCTION_TEXT": [
      "Este proxecto permítenos visualizar o latexado da Micro:bit e experimentar co ritmo cardíaco.",
      "Aprenderemos a utilizar a pantalla de LEDs para representacións visuais e a integrar sons para unha retroalimentación multisensorial.",
      "Descubriremos como se pode variar o ritmo do 'latexado' utilizando diferentes controis e programación.",
      "Prepárate para sentir o pulso da túa Micro:bit!"
    ],
    "MATERIALS_TITLE": "Materiais",
    "MATERIALS_LIST": [
      "1 Micro:bit",
      "Ordenador portátil",
      "Cable de conexión USB-A",
      "Editor de Python"
    ],
    "STEPS_TITLE": "Pasos para a Programación",
    "STEP_1_TITLE": "Paso 1: O Corazón Cobra Vida",
    "STEP_1_TITLE_1": "O Latexado Básico",
    "STEP_1_TEXT": "Comezaremos programando unha animación sinxela dun corazón que latexa na pantalla de LEDs da Micro:bit.",
    "STEP_1_TITLE_2": "Engadindo Son ao Latexado",
    "STEP_1_TEXT_1": "Para facer o latexado máis realista e accesible, engadiremos un son cada vez que o corazón se ilumine.",
    "STEP_1_TEXT_2": [
      "Importaremos o módulo 'music' para poder reproducir notas musicais.",
      "O son debería ser claro e distintivo, replicando o 'lub-dub' dun latexado real."
    ],
    "STEP_1_TEXT_3": "Aquí tes o código para integrar o son coa animación do corazón:",
    "STEP_1_TITLE_3": "Controlando o Ritmo",
    "STEP_1_TEXT_4": "Agora que o corazón latexa e soa, queremos poder controlar o seu ritmo. Introduciremos unha variable 'beats' para axustar a velocidade do latexado.",
    "STEP_1_TEXT_5": [
      "Esta variable controlará o tempo de espera entre cada 'latexado' e a duración das notas musicais.",
      "Experimentaremos con diferentes valores para atopar o ritmo adecuado."
    ],
    "STEP_1_TITLE_4": "Interacción con Botóns",
    "STEP_1_TEXT_6": [
      "Faremos que os botóns A e B da Micro:bit permitan aos usuarios aumentar ou diminuír a velocidade do latexado.",
      "Pulsar o botón A podería acelerar o corazón, mentres que o botón B podería ralentizalo."
    ],
    "STEP_1_TEXT_7": "Código para a interacción cos botóns:",
    "STEP_1_TEXT_8": "Isto permitirá unha experiencia interactiva onde o usuario controla o seu 'corazón' virtual.",
    "STEP_1_TITLE_5": "Límites de Velocidade",
    "STEP_1_TEXT_9": [
      "Para evitar ritmos de latexado irrealmente rápidos ou lentos, estableceremos uns límites para a variable 'beats'.",
      "O corazón non debería poder deterse completamente nin ir a unha velocidade que non poida ser percibida."
    ],
    "STEP_1_TEXT_10": [
      "Estas restricións aseguran que o xogo se mantén dentro duns parámetros lóxicos e xogables.",
      "Implementaremos condicionais para asegurar que a variable 'beats' se manteña dentro do rango desexado."
    ],
    "STEP_1_TITLE_6": "Retroalimentación Visual",
    "STEP_1_TEXT_11": [
      "Ademais da animación do corazón, utilizaremos a pantalla de LEDs para mostrar a velocidade actual do latexado, ou outros indicadores visuais relevantes.",
      "Poderíamos mostrar un número que represente os latexados por minuto (BPM)."
    ],
    "STEP_1_TEXT_12": [
      "Esta retroalimentación visual complementa a sonora, facendo o proxecto máis informativo."
    ],
    "STEP_1_TITLE_7": "Cálculo de BPM",
    "STEP_1_TEXT_13": "Para mostrar os latexados por minuto (BPM), teremos que realizar un pequeno cálculo baseándonos na variable 'beats'.",
    "STEP_1_TEXT_14": "A fórmula para calcular os BPM a partir do tempo entre latexados (en milisegundos) é: BPM = 60000 / tempo_entre_latexados.",
    "STEP_1_TITLE_8": "Táboa de Frecuencias Cardíacas",
    "STEP_1_TEXT_15": "Aquí tes unha táboa de referencia para as frecuencias cardíacas, útil para axustar o ritmo do teu 'corazón' de Micro:bit:",
    "TABLE_TITLE": "Frecuencia Cardíaca (BPM)",
    "TABLE_HD_1": "Latexados por Minuto",
    "TABLE_HD_2": "Tempo entre Latexados (segundos)",
    "TABLE_HD_3": "Tempo entre Latexados (milisegundos)",
    "STEP_1_TEXT_16": [
      "Esta táboa axudarache a entender como os valores de 'beats' se correlacionan cun ritmo cardíaco real.",
      "Podes utilizar estes valores para programar ritmos específicos ou para validar o teu simulador de latexados."
    ],
    "FORMULA_ALT_TEXT": "Fórmula para calcular a frecuencia de latexado do corazón",
    "FORMULA_ALT_TEXT_2": "Imaxe representando o sol",
    "FORMULA_ALT_TEXT_3": "Fórmula da frecuencia cardíaca",
    "STEP_1_TEXT_17": "Esta ilustración mostra a fórmula utilizada para converter o tempo entre latexados a latexados por minuto (BPM).",
    "STEP_1_TITLE_9": "Monitorización da Saúde",
    "STEP_1_TEXT_18": [
      "Poderíamos engadir unha lóxica para simular condicións de saúde, onde o corazón cambia de cor ou emite un son de alarma se o ritmo é demasiado alto ou baixo.",
      "Isto podería ser un proxecto educativo sobre a saúde cardíaca."
    ],
    "STEP_1_TEXT_19": "O código podería cambiar a cor do LED ou a imaxe mostrada se o BPM sae dun rango saudable.",
    "STEP_1_TITLE_10": "Alertas Sonoras e Visuais",
    "STEP_1_TEXT_20": "Implementaremos alertas sonoras e visuais se o ritmo cardíaco simulado entra en zonas de risco.",
    "STEP_1_TEXT_21": [
      "Por exemplo, un son agudo e unha caveira na pantalla se o corazón 'detense'.",
      "Estas alertas melloran a accesibilidade e a claridade da información."
    ],
    "STEP_1_TITLE_11": "Múltiples Pantallas (Opcional)",
    "STEP_1_TEXT_22": "Se temos varias Micro:bits, poderiamos facer que unha actúe como monitor de corazón e a outra como interface de control, comunicándose por radio.",
    "STEP_1_TEXT_23": [
      "Unha Micro:bit podería mostrar só o BPM e a outra a visualización do corazón e os controis.",
      "Isto introduciría o concepto de comunicación sen fíos entre dispositivos."
    ],
    "STEP_1_TEXT_24": [
      "A comunicación por radio permitiría unha maior complexidade e funcionalidade ao proxecto.",
      "Aquí tes un exemplo de como se podería estruturar o código para esta configuración:"
    ],
    "STEP_1_TEXT_25": [
      "Este código distribuirá as tarefas entre dúas Micro:bits, simulando un sistema de monitorización remoto."
    ],
    "STEP_1_TITLE_12": "Finalización do Proxecto",
    "STEP_1_TEXT_26": [
      "Unha vez todas as funcionalidades estean implementadas, probaremos o proxecto a fondo para asegurarnos de que todo funciona correctamente e que a experiencia de usuario é óptima.",
      "Faremos axustes ata que o 'latexado' sexa perfecto."
    ],
    "STEP_1_TEXT_27": "Asegúrate de que a retroalimentación visual e sonora estea ben sincronizada.",
    "STEP_1_TEXT_28": "O teu 'Latexado da Micro:bit' está listo!",
    "STEP_1_TITLE_13": "Personalización Avanzada",
    "STEP_1_TEXT_29": "Experimenta con diferentes animacións do corazón, sons personalizados ou engade máis sensors para unha experiencia aínda máis inmersiva.",
    "STEP_2_TITLE": "Paso 2: O Código",
    "STEP_2_TEXT": "Descarga o arquivo .hex xa compilado para cargalo directamente na túa Micro:bit.",
    "STEP_3_TITLE": "Paso 3: Evoluciona o Código",
    "STEP_3_TEXT": "Modifica o código para crear un ritmo musical completo, un xogo de reacción ao ritmo, ou conéctao a outros proxectos!"
  },
  "SECRET_MESSAGE_PAGE": {
    "TITLE": "Mensaxe Secreta",
    "VIDEO_NOT_SUPPORTED": "O teu navegador non soporta a etiqueta de vídeo.",
    "MORSE_CODE_CAPTION": "Alfabeto de Código Morse",
    "INTRODUCTION_TITLE": "Introdución",
    "INTRODUCTION_TEXT": "Este proxecto ensina a utilizar a Micro:bit para enviar e recibir mensaxes secretas mediante o código Morse.",
    "INTRODUCTION_TEXT_1": "Aprenderás a transformar texto en secuencias de luces e sons, e a descifralas de novo. Preparado para o espionaxe dixital?",
    "TARGET_TITLE": "Obxectivo",
    "TARGET_TEXT": "Crear un comunicador de código Morse funcional utilizando a Micro:bit, capaz de enviar e recibir mensaxes dun xeito accesible.",
    "MATERIALS_TITLE": "Materiais",
    "MATERIALS_LIST": [
      "2 Micro:bit (para comunicación entre elas)",
      "Ordenador con conexión USB",
      "Cable USB de datos",
      "Editor de Python"
    ],
    "STEPS_TITLE": "Pasos para a Programación",
    "STEP_1_TITLE": "Paso 1: Preparación do Código Morse",
    "STEP_1_TEXT": "Comezaremos definindo o alfabeto de código Morse en Python. Cada letra e número terá unha representación en puntos (.) e raias (-).",
    "STEP_1_TEXT_1": "Por exemplo, a letra 'A' é '.-', a 'B' é '-...' e o '1' é '.----'.",
    "STEP_1_TEXT_2": "Utilizaremos un dicionario para almacenar estas conversións, o que facilitará a tradución do texto a código Morse e viceversa.",
    "STEP_1_TEXT_3": "Aquí tes o fragmento inicial para construír o alfabeto Morse:",
    "STEP_1_TEXT_4": "Este código establece as bases para a codificación e decodificación das nosas mensaxes.",
    "STEP_1_TEXT_5": "Tamén engadiremos as definicións para os números e algúns signos de puntuación básicos para enriquecer as nosas comunicacións.",
    "STEP_1_TEXT_6": "Aquí o código completo do alfabeto Morse:",
    "STEP_1_TEXT_7": "Esta é a clave de todo o proxecto de mensaxería secreta. É importante que todos os caracteres que queiramos utilizar estean correctamente definidos.",
    "STEP_1_TEXT_8": "Unha vez teñamos o dicionario completo, poderemos comezar a traballar en funxios de codificación e decodificación.",
    "STEP_1_TEXT_9": "Esta primeira parte é fundamental para a creación do tradutor Morse.",
    "STEP_1_TITLE_2": "Paso 2: Tradución de Texto a Código Morse",
    "STEP_1_TEXT_11": "Agora crearemos unha función que colla unha mensaxe de texto e a converta á súa representación en código Morse. A función deberá recorrer cada carácter da mensaxe, buscar a súa equivalente no dicionario Morse e concatenala a unha cadea resultante.",
    "STEP_1_TEXT_12": "Tamén teremos que considerar como separar os caracteres e as palabras en código Morse (normalmente con espazos entre caracteres e ' / ' entre palabras).",
    "STEP_1_TEXT_13": "Aquí tes o código da función 'text_to_morse':",
    "STEP_1_TEXT_14": "Esta función será o corazón da nosa capacidade para enviar mensaxes secretas.",
    "STEP_1_TEXT_15": "Para probala, podemos utilizar unha mensaxe simple como 'HOLA' e ver se a saída é '.... --- .-.. .-'",
    "STEP_1_TEXT_16": "Esta parte é crucial para converter as nosas palabras na linguaxe secreta.",
    "STEP_1_TEXT_17": "Asegúrate de probar a función con diferentes tipos de mensaxes para verificar a súa robustez.",
    "STEP_1_TITLE_3": "Paso 3: Envío do Código Morse (Visual e Sonoro)",
    "STEP_1_TEXT_18": "Unha vez teñamos a mensaxe en código Morse, necesitamos unha maneira de enviala. Para facelo accesible, usaremos tanto a pantalla de LEDs da Micro:bit (visual) como o son (auditivo).",
    "STEP_1_TEXT_19": "Unha 'raia' (-)' representarase cun LED aceso máis longo e un ton de son máis longo. Un 'punto' ('.') cun LED aceso máis curto e un ton de son máis curto. Un espazo entre caracteres será unha pausa breve, e un espazo entre palabras, unha pausa máis longa.",
    "STEP_1_TEXT_20": "Aquí tes a función 'send_morse_signal':",
    "STEP_1_TEXT_21": "Esta función fará que a nosa Micro:bit se converta nun emisor de sinais Morse multisensorial.",
    "STEP_1_TEXT_22": "É importante axustar os tempos de duración para os puntos, raias e pausas para que sexan facilmente diferenciables.",
    "STEP_1_TEXT_23": "A combinación de sinais visuais e auditivos mellora significativamente a accesibilidade do proxecto.",
    "STEP_1_TEXT_24": "Esta é a función que transforma o código nunha experiencia interactiva.",
    "STEP_1_TITLE_4": "Paso 4: Recepción e Decodificación do Código Morse",
    "STEP_1_TEXT_25": "A parte máis desafiante é a recepción. Como a Micro:bit non ten unha entrada de micrófono para detectar sons Morse, simularemos a recepción cos botóns A e B, ou cun sensor de tacto.",
    "STEP_1_TEXT_26": "O botón A pode simular un 'punto' e o botón B unha 'raia'. Detectaremos as presións dos botóns e a duración de cada presión para reconstruír o código Morse.",
    "STEP_1_TEXT_27": "Tamén crearemos unha función 'morse_to_text' que fará o proceso inverso: coller unha secuencia de código Morse e convertela de novo en texto lexible.",
    "STEP_1_TEXT_28": "Aquí tes o código para a recepción e decodificación:",
    "STEP_1_TEXT_29": "Esta lóxica permitiranos 'ler' as mensaxes secretas que envían outras Micro:bits.",
    "STEP_1_TEXT_30": "A función de decodificación utilizará o dicionario Morse inverso para traducir as secuencias de puntos e raias a letras e palabras.",
    "STEP_1_TEXT_31": "É crucial xestionar correctamente os tempos entre as presións de botóns para diferenciar entre puntos, raias e espazos.",
    "STEP_1_TEXT_32": "Esta parte é a que nos permite descifrar as mensaxes.",
    "STEP_1_TITLE_5": "Paso 5: Interacción Completa con Radio (Opcional)",
    "STEP_1_TEXT_33": "Para unha experiencia de mensaxería secreta completa, dúas Micro:bits poden comunicarse por radio. Unha enviaría o código Morse e a outra o recibiría e o decodificaría.",
    "STEP_1_TEXT_34": "A Micro:bit emisora utilizaría 'radio.send()' e a receptora 'radio.receive()'. Isto engade un nivel de realismo e funcionalidade ao proxecto.",
    "STEP_1_TEXT_35": "Aquí tes o exemplo de como integrar a radio:",
    "STEP_1_TEXT_36": "Isto permitiría unha comunicación sen fíos entre dispositivos.",
    "STEP_1_TEXT_37": "É importante asegurarse de que ambas Micro:bits estean configuradas no mesmo grupo de radio e que a velocidade de transmisión sexa adecuada.",
    "STEP_1_TEXT_38": "A comunicación por radio abre a porta a moitas outras aplicacións.",
    "STEP_1_TITLE_6": "Paso 6: Melloras de Accesibilidade",
    "STEP_1_TEXT_39": "Para facer o comunicador Morse aínda máis accesible, poderiamos engadir:",
    "TRANSFORMANT_LIST": [
      "Vibración: Para usuarios con deficiencia auditiva, a Micro:bit podería vibrar en lugar de emitir un son.",
      "Pantalla ampliada: Mostrar a mensaxe decodificada nunha pantalla externa máis grande.",
      "Entrada alternativa: Utilizar sensores de movemento (acelerómetro) para simular puntos e raias, facilitando o uso a persoas con dificultades motrices finas."
    ],
    "STEP_1_TEXT_40": "Estas melloras garantirían que o proxecto sexa útil para unha gama máis ampla de usuarios.",
    "STEP_1_TEXT_41": "A implementación destas funcións require unha consideración coidadosa dos diferentes tipos de feedback que se poden proporcionar.",
    "STEP_1_TEXT_42": "A inclusión desde o deseño é a clave para proxectos exitosos.",
    "STEP_1_TITLE_7": "Paso 7: Depuración e Probas",
    "STEP_1_TEXT_43": "É vital probar cada parte do código de xeito independente e logo de xeito conxunto. Envía mensaxes de proba, tanto simples como complexas, para asegurarte de que a codificación, o envío, a recepción e a decodificación funcionan perfectamente.",
    "STEP_1_TEXT_44": "Axusta os tempos e as pausas segundo sexa necesario para optimizar a claridade dos sinais.",
    "STEP_1_TEXT_45": "A depuración é un proceso iterativo que asegura a calidade do teu comunicador Morse.",
    "STEP_1_TITLE_8": "Paso 8: Código Completo",
    "STEP_1_TEXT_46": "Aquí tes o código completo do proxecto 'Mensaxe Secreta' para a Micro:bit.",
    "STEP_1_TEXT_47": "Este código integra todas as funxios descritas en os pasos anteriores, desde a definición do alfabeto Morse hasta o envío e a recepción de mensaxes.",
    "STEP_1_TEXT_48": "Está deseñado para ser un punto de partida para experimentos e personalizacións futuras.",
    "STEP_1_TITLE_9": "Paso 9: Descargar o Arquivo .hex",
    "STEP_1_TEXT_49": "Se non queres programalo ti mesmo, podes descargar o arquivo .hex xa compilado para cargalo directamente na túa Micro:bit.",
    "STEP_1_TEXT_50": "Este arquivo contén o código do xogo 'Mensaxe Secreta' listo para usar. Só tes que conectar a Micro:bit ao ordenador e arrastrar o arquivo .hex á unidade que aparece.",
    "STEP_1_TEXT_51": "Isto permitirache probar o proxecto inmediatamente.",
    "STEP_2_TITLE": "Paso 10: Evoluciona o Código",
    "STEP_2_TEXT": "Modifica o código para crear un cifrado máis complexo, engadir novos métodos de entrada/saída, ou integralo con outros proxectos de comunicación."
  },
  "RPS_PAGE": {
    "TITLE": "Pedra, Papel, Tesoura",
    "VIDEO_NOT_SUPPORTED": "O teu navegador non soporta a etiqueta de vídeo.",
    "INTRODUCTION_TITLE": "Introdución",
    "INTRODUCTION_TEXT": "Este proxecto ensina a utilizar a Micro:bit para crear o clásico xogo de 'Pedra, Papel, Tesoura'. Prepárate para enfrontarte á intelixencia artificial!",
    "INTRODUCTION_TEXT_1": "Aprenderás a utilizar a pantalla de LEDs para mostrar as opcións (pedra, papel ou tesoura) e os botóns para facer a túa elección. Tamén incorporaremos un xerador de números aleatorios para a decisión da Micro:bit.",
    "MATERIALS_TITLE": "Materiais",
    "MATERIALS_LIST": [
      "1 Micro:bit",
      "Ordenador con conexión USB",
      "Cable USB de datos",
      "Editor de Python"
    ],
    "TARGET_TITLE": "Obxectivo",
    "TARGET_TEXT": "Crear un xogo de 'Pedra, Papel, Tesoura' accesible e funcional coa Micro:bit, utilizando sinais visuais e auditivos para a interacción.",
    "STEPS_TITLE": "Pasos para a Programación",
    "STEP_1_TITLE": "Paso 1: Configuración Inicial e Elección do Xogador",
    "STEP_1_TITLE_2": "Importacións necesarias",
    "STEP_1_TEXT_1": "Primeiro, importaremos os módulos necesarios para o funcionamento da Micro:bit e a xeración de números aleatorios.",
    "IMPORTS_LIST": [
      "import microbit",
      "import random"
    ],
    "STEP_1_TEXT_2": "Estas liñas permitirannos interactuar cos compoñentes da Micro:bit e obter resultados aleatorios.",
    "STEP_1_TITLE_3": "Elección do xogador con botóns",
    "STEP_1_TEXT_3": "O xogador fará a súa elección premendo os botóns A ou B. O botón A pode ser 'Pedra' e o botón B pode ser 'Papel'. A 'Tesoura' elixirémola se se premen ambos os botóns.",
    "STEP_1_TEXT_4": "Implementaremos unha función que detecte que botóns se premen e asigne un valor numérico (0 para Pedra, 1 para Papel, 2 para Tesoura).",
    "STEP_1_TITLE_4": "Definición das figuras",
    "STEP_1_TEXT_5": "Definiremos as imaxes que representarán a pedra, o papel e a tesoura na pantalla LED da Micro:bit. Utilizaremos a matriz de LEDs para debuxalas de forma sinxela.",
    "STEP_1_TEXT_6": "Aquí tes como definir as imaxes:",
    "CODE_1_LIST": [
      "pedra = microbit.Image.SQUARE",
      "papel = microbit.Image.CHESSBOARD",
      "tesoura = microbit.Image.SCISSORS"
    ],
    "STEP_1_TEXT_7": "Estas imaxes farán o xogo máis visual e intuitivo.",
    "STEP_1_TITLE_5": "Lóxica do xogo: elección da Micro:bit",
    "STEP_1_TEXT_8": "A Micro:bit deberá facer a súa propia elección de xeito aleatorio. Utilizaremos a función 'random.randint(0, 2)' para obter un número entre 0 e 2, que representarán a pedra, o papel ou a tesoura.",
    "STEP_1_TEXT_9": "Esta elección farase cada vez que o xogador faga a súa elección, asegurando que o xogo sexa impredicible.",
    "STEP_1_TEXT_10": "Aquí tes o código para a elección da Micro:bit:",
    "STEP_1_TEXT_11": "Esta parte é crucial para a interactividade do xogo.",
    "STEP_1_TITLE_6": "Determinar o gañador",
    "STEP_1_TEXT_12": "Agora implementaremos a lóxica para determinar quen gaña a rolda. Lembramos as regras: Pedra gaña a Tesoura, Tesoura gaña a Papel, e Papel gaña a Pedra.",
    "STEP_1_TEXT_13": "Utilizaremos unha serie de condicionais (if/elif/else) para comparar as eleccións do xogador e da Micro:bit.",
    "STEP_1_TEXT_14": "Aquí tes a función 'determine_winner':",
    "STEP_1_TITLE_7": "Mostrar o resultado",
    "STEP_1_TEXT_15": "Unha vez determinado o gañador, mostraremos o resultado na pantalla LED da Micro:bit. Podemos utilizar iconas (por exemplo, unha cara feliz para gañar, unha triste para perder, e unha neutra para empatar).",
    "STEP_1_TEXT_16": "Ademais da icona, podemos facer que a Micro:bit emita un son diferente para cada resultado, mellorando a accesibilidade para usuarios con dificultades visuales.",
    "STEP_1_TITLE_8": "Bucle principal do xogo",
    "STEP_1_TEXT_17": "O xogo repetirase continuamente ata que o usuario decida detelo. Utilizaremos un bucle 'while True' para manter o xogo activo.",
    "STEP_1_TEXT_18": "Dentro do bucle, esperaremos a entrada do xogador, faremos a elección da Micro:bit, determinaremos o gañador e mostraremos o resultado.",
    "STEP_1_TEXT_19": "Aquí tes a estrutura básica do bucle principal:",
    "STEP_1_TITLE_9": "Retroalimentación multisensorial",
    "STEP_1_TEXT_20": "Para mellorar a accesibilidade, engadiremos sons para cada acción e resultado. Por exemplo, un son curto ao elixir unha opción, un son de vitoria, un de derrota e un de empate.",
    "STEP_1_TEXT_21": "Utilizaremos o módulo 'music' para reproducir melodías sinxelas.",
    "STEP_1_TEXT_22": "Isto permitirá que os usarios con discapacidade visual poidan gozar plenamente do xogo.",
    "STEP_1_TITLE_10": "Implementación do son",
    "STEP_1_TEXT_23": "Integraremos as funcións de son na lóxica do xogo. Por exemplo, cando o xogador gañe, reproducirase a melodia de vitoria, e así sucesivamente.",
    "STEP_1_TEXT_24": "É importante que os sons sexan distintivos e fáciles de recoñecer.",
    "STEP_1_TEXT_25": "Esta adición aumentará significativamente a inmersión e a accesibilidade do xogo.",
    "STEP_1_TITLE_11": "Detección de xestos (Opcional)",
    "STEP_1_TEXT_26": "Como alternativa aos botóns, poderiamos utilizar o acelerómetro da Micro:bit para detectar xestos. Por exemplo, sacudir a Micro:bit podería significar unha elección aleatoria, ou inclinala cara a un lado para elixir pedra, papel ou tesoura.",
    "STEP_1_TEXT_27": "Isto ofrece unha opción de entrada máis accesible para usuarios con dificultades motrices.",
    "STEP_1_TITLE_12": "Código completo con xestos",
    "STEP_1_TEXT_28": "Aquí tes un exemplo de como poderiamos integrar a detección de xestos no noso xogo 'Pedra, Papel, Tesoura':",
    "STEP_1_TEXT_29": "Este código substitúe ou complementa as entradas dos botóns por xestos.",
    "STEP_1_TEXT_30": "A función 'gest_detection' sería responsable de ler o acelerómetro e traducir os movementos en eleccións de xogo.",
    "STEP_1_TEXT_31": "Esta funcionalidade faría o xogo máis versátil e adaptable a diferentes necesidades.",
    "STEP_1_TEXT_32": "Así é como as adaptacións poden mellorar a experiencia de xogo para todos.",
    "STEP_1_TEXT_33": "Consideraremos a implementación dunha función 'on_shake' para detectar o movemento da Micro:bit.",
    "STEP_1_TEXT_34": "Esta función devolvería unha das tres opcións (Pedra, Papel ou Tesoura) de forma aleatoria ou baseada na intensidade da sacudida.",
    "STEP_1_TEXT_35": "O uso do acelerómetro permite unha interación máis dinámica e menos dependente dos controis físicos.",
    "STEP_1_TEXT_36": "Esta é unha gran adición para a inclusión de todos os xogadores.",
    "STEP_1_TITLE_13": "Comunicación con outra Micro:bit (Multixogador)",
    "STEP_1_TEXT_37": "Para xogar contra un amigo, podemos facer que dúas Micro:bits se comuniquen por radio. Cada xogador faría a súa elección na súa Micro:bit, e esta enviaría a súa elección á outra Micro:bit.",
    "STEP_1_TEXT_38": "A Micro:bit receptora compararía as dúas eleccións e mostraría o resultado.",
    "STEP_1_TEXT_39": "Isto abre a porta a un modo multixogador interactivo e accesible.",
    "STEP_1_TITLE_14": "Implementación do multixogador",
    "STEP_1_TEXT_40": "Aquí tes como poderiamos modificar o código para permitir o modo multixogador vía radio:",
    "STEP_1_TEXT_41": "Unha Micro:bit enviaría unha mensaxe coa súa elección e a outra recibiría a mensaxe e faría a comparación.",
    "STEP_1_TEXT_42": "É importante configurar o mesmo grupo de radio en ambas Micro:bits.",
    "STEP_1_TEXT_43": "A comunicación por radio é unha ferramenta potente para a creación de xogos interactivos.",
    "STEP_1_TEXT_44": "Esta é a clave para xogar con amigos e familiares.",
    "STEP_1_TITLE_15": "Melloras na interface de usuario",
    "STEP_1_TEXT_45": "Para facer a interface de usuario máis clara e accesible, poderiamos:",
    "STEP_1_TEXT_46": "Mostrar animacións máis elaboradas para a pedra, o papel e a tesoura.",
    "STEP_1_TEXT_47": "Utilizar diferentes tons de son para cada elección do xogador (Pedra, Papel, Tesoura).",
    "STEP_1_TEXT_48": "Isto faría a experiencia máis rica e visualmente atractiva.",
    "STEP_1_TITLE_16": "Puntuación e roldas",
    "STEP_1_TEXT_49": "Poderiamos engadir un sistema de puntuación para levar un rexistro de quen gaña máis roldas. Tamén se poderían implementar múltiples roldas, e o xogo finalizaría cando un xogador chegase a unha puntuación predeterminada.",
    "STEP_1_TEXT_50": "Isto aumentaría a rejugabilidade e a competitividade do xogo.",
    "STEP_1_TEXT_51": "A puntuación visible na Micro:bit podería motivar os xogadores.",
    "STEP_1_TITLE_17": "Código para a puntuación",
    "STEP_1_TEXT_52": "Aquí tes como poderiamos implementar a puntuación no noso xogo:",
    "STEP_1_TEXT_53": "As variables 'player_score' e 'microbit_score' poderíanse actualizar despois de cada rolda.",
    "STEP_1_TITLE_18": "Finalización do xogo",
    "STEP_1_TEXT_54": "Unha vez xogadas un número determinado de roldas, o xogo debería anunciar un gañador final. Poderiamos facer que a Micro:bit mostre unha mensaxe de '¡GAÑACHES!' ou '¡PERDECHES!' cunha aniación.",
    "STEP_1_TEXT_55": "Tamén se podería reproducir unha melodía final diferente para cada resultado.",
    "STEP_1_TEXT_56": "Isto proporciona un final satisfactorio ao xogo.",
    "STEP_1_TITLE_19": "Código de finalización",
    "STEP_1_TEXT_57": "Aquí tes un exemplo de como xestionar a finalización do xogo:",
    "STEP_1_TEXT_58": "Esta lóxica asegura que o xogo teña un principio e un final claros.",
    "STEP_1_TITLE_20": "Depuración e probas",
    "STEP_1_TEXT_59": "Como con calquera proxecto de programación, é esencial depurar e probar o xogo a fondo. Asegúrate de que todas as regras funcionan correctamente, que os sons e as animacións se reproducen como se espera, e que a interacción co usuario é fluída.",
    "STEP_1_TEXT_60": "A depuración regular garantece un xogo de calidade.",
    "STEP_2_TITLE": "Paso 2: O Código Completo",
    "STEP_2_TEXT": "Se non queres programalo ti mesmo, podes descargar o arquivo .hex xa compilado para cargalo directamente na túa Micro:bit.",
    "STEP_3_TITLE": "Paso 3: Evoluciona o Código",
    "STEP_3_TEXT": "Modifica o código para crear novas opçios de xogo, engadir un modo multixogador máis avanzado, ou integralo con outros proxectos da Micro:bit."
  },
  "COUNTDOWN_PAGE": {
    "TITLE": "A Conta Atrás Final",
    "VIDEO_NOT_SUPPORTED": "O teu navegador non soporta a etiqueta de vídeo.",
    "INTRODUCTION_H2": "Introdución",
    "INTRODUCTION_P": [
      "Este proxecto é a programación dunha conta atrás desde 10 ata 0. A conta atrás mostrarase na pantalla da Micro:bit e irá acompañada dunha pulsación, a mesma que se fixo no proxecto O latexado da Micro:bit, para ter unha estimulación sonora ademais dunha visual.",
      "No proxecto verase un novo tipo de bucle, un bucle for, e verase como declarar unha variable que utilizaremos para realizar a conta atrás.",
      "Comecemos a conta atrás!"
    ],
    "MATERIALS_H2": "Materiais",
    "MATERIAL_MICROBIT": "1 Micro:bit.",
    "MATERIAL_ITEM_1": "Portátil.",
    "MATERIAL_ITEM_2": "Cable USB-A",
    "MATERIAL_ITEM_3": "Editor de Python.",
    "STEPS_H2": "Pasos",
    "STEP_1_H3": "Paso 1: Desenvolvendo o Código",
    "STEP_1_H4": "Declarando unha variable",
    "STEP_1_P": [
      "O código da conta atrás é, posiblemente, máis sinxelo que o código do proxecto anterior, aínda que tamén ten as súas peculiaridades. A primeira é a declaración dunha variable.",
      "Cando falamos de variables, debemos saber distinguir entre unha variable de ámbito global e unha de ámbito local. Polo momento, o único que hai que saber é que as variables de ámbito global, como a que utilizaremos neste proxecto, decláranse xusto despois da liña dos imports e faise da seguinte maneira:"
    ],
    "STEP_1_P_2": "[nome variable] = [valor variable]",
    "STEP_1_P_3": "Un exemplo de declaración sería:",
    "STEP_1_P_4": "Dito isto, xusto ao inicio do noso proxecto escribiremos:",
    "STEP_1_P_5": "Na liña 6 realizamos a declaración da variable i e o seu valor: 10.",
    "STEP_1_H4_1": "Bucle for",
    "STEP_1_P_6": "Despois da declaración da variable iniciamos o bucle for, que é o bucle principal do proxecto.",
    "STEP_1_H4_2": "Explicación do código",
    "STEP_1_P_7": [
      "Neste proxecto debemos explicar o bucle for. Un bucle for execútase un determinado número de veces. Para decidir cantas veces se executa un bucle for tende a incluírse un algoritmo que modifica o valor da variable que controla o bucle cada vez que se executa o bucle. Neste caso modifícase o valor da variable step.",
      "Na liña 9 declaramos o bucle for e establecemos que se executará 11 veces (index in range(11)). Expliquemos un pouco máis esta última sentenza:",
      "index: É o valor que se irá modificando.",
      "in; vincular index co seu rango de valores.",
      "range(): Indica o rango de valores, ou os pasos a realizar polo bucle.",
      "11: É o número de veces (pasos) que se executará o bucle for."
    ],
    "CODE_ITEM_1": "index: É o valor que se irá modificando.",
    "CODE_ITEM_2": "in; vincular index co seu rango de valores.",
    "CODE_ITEM_3": "range(): Indica o rango de valores, ou os pasos a realizar polo bucle.",
    "CODE_ITEM_4": "11: É o número de veces (pasos) que se executará o bucle for.",
    "STEP_1_P_8": [
      "As liñas 10 e 11 xa as coñecemos do proxecto anterior. Na liña 12 o que estamos facendo é reducir nun valor a variable i cada vez que se executa o bucle for.",
      "Por último, na liña 13 facemos que o código se deteña 1 segundo antes de volverse a executar o bucle for."
    ],
    "STEP_1_H4_3": "Concepto",
    "STEP_1_P_9": [
      "Non chamou a atención algo do código? Fixácheste en que o valor da variable i é de 10 e executamos o bucle for 11 veces? Esta “inconsistencia” débese a que o 0 é un número e polo tanto débese ter en conta á hora de programar. Se facemos que o bucle for se execute só 10 veces o último número que alcanzará a variable i será 1 e non 0.",
      "Fai a proba!"
    ],
    "STEP_2_H3": "Paso 2: O código",
    "STEP_2_P": "Descarga do arquivo hex.",
    "STEP_3_H3": "Paso 3: Evoluciona o código",
    "STEP_3_P": "Modifica o código engadindo unha animación final, ou empregando a conta atrás para iniciar algún proceso na Micro:bit. Esta conta atrás pode ser a primeira pedra dun proxecto máis grande!'"
  },
  "SETTINGS": {
    "TITLE": "Configuración",
    "DESCRIPTION": "Aquí podes axustar as configuracións da aplicación.",
    "THEME_TITLE": "Apariencia",
    "DARK_MODE": "Modo Escuro",
    "DARK_MODE_TOGGLE": "Modo Escuro",
    "FONT_FAMILY_SELECT": "Tipo de Letra",
    "FONT_SIZE_SELECT": "Tamaño de Letra",
    "FONT_SIZE_SMALL": "Pequeno",
    "FONT_SIZE_MEDIUM": "Mediano",
    "FONT_SIZE_LARGE": "Grande",
    "ANIMATIONS_TOGGLE": "Desactivar Animacións",
    "LANGUAGE_SELECT": "Idioma"
  },
  "ACCESSIBLE_PROGRAMMING": {
    "TITLE": "Programación Accesible",
    "H1": "Programación Accesible con Micro:bit",
    "INTRO_P1": "A programación con Micro:bit ofrece unha excelente oportunidade para introducir a persoas de todas as idades e habilidades no mundo da tecnoloxía. Con todo, para asegurar que sexa verdadeiramente inclusiva, é fundamental considerar a accesibilidade desde a fase de deseño dos proxectos.",
    "INTRO_P2": "A accesibilidade non pode ser un parche que se engade ao final do proxecto para intentar cumprir cun requisito ou obter beneficios.",
    "CREATION_TITLE": "Creación de Proxectos Accesibles para Micro:bit",
    "CREATION_P1": "Para crear proxectos accesibles con Micro:bit, é importante ter en conta varios aspectos:",
    "CREATION_LI1_TITLE": "Feedback Multisensorial:",
    "CREATION_LI1_TEXT": "Utilizar non só a pantalla de LEDs, senón tamén o son (se o modelo de Micro:bit o permite ou se conecta a un altofalante) para proporcionar información. Por exemplo, un xogo pode emitir un son ao acertar e outro diferente ao fallar.",
    "CREATION_LI2_TITLE": "Entradas Alternativas:",
    "CREATION_LI2_TEXT": "Considerar opcións máis alá dos botóns A e B. Os pines da Micro:bit poden conectarse a sensores externos ou pulsadores adaptados, facilitando a interacción para persoas con mobilidade reducida. Outra opción é utilizar o acelerómetro da Micro:bit.",
    "CREATION_LI3_TITLE": "Claridade e Simplicidade:",
    "CREATION_LI3_TEXT": "Manter os programas tan simples e claros como sexa posible. Evitar secuencias de accións complexas que poidan confundir a usuarios con dificultades cognitivas ou de memoria.",
    "CREATION_LI4_TITLE": "Documentación Clara:",
    "CREATION_LI4_TEXT": "Proporcionar instrucións detalladas e fáciles de entender, idealmente en múltiples formatos (text, audio, pictogramas).",
    "BLOCKLY_TITLE": "Programación por Bloques (Blockly) e Discapacidade",
    "BLOCKLY_P1": "As interfaces de programación por bloques, como a que utiliza MakeCode para Micro:bit, son unha ferramenta potente para a accesibilidade. A súa natureza visual e intuitiva reduce barreiras importantes:",
    "BLOCKLY_OVERCOME_TITLE": "Barreiras que Supera:",
    "BLOCKLY_OVERCOME_LI1_TITLE": "Discapacidade visual (baixa visión):",
    "BLOCKLY_OVERCOME_LI1_TEXT": "Aínda que as interfaces visuais poden ser un reto, o uso de bloques con códigos de cor permite que os usuarios con baixa visión recoñezan o tipo de bloque que se está utilizando de maneira máis rápida e sinxela.",
    "BLOCKLY_OVERCOME_LI2_TITLE": "Discapacidade motriz:",
    "BLOCKLY_OVERCOME_LI2_TEXT": "A manipulación de bloques adoita ser máis sinxela que a escritura de código, especialmente con adaptacións de rato ou teclado. A función de arrastrar e soltar pode ser substituída pola navegación con teclado para quen non poden usar un rato.",
    "BLOCKLY_OVERCOME_LI3_TITLE": "Discapacidade cognitiva e da aprendizaxe:",
    "BLOCKLY_OVERCOME_LI3_TEXT": "A representación visual do código reduce a carga cognitiva, ao non requirir a memorización de sintaxes complexas. Os bloques guían ao usuario na estrutura lóxica do programa.",
    "BLOCKLY_CHALLENGES_TITLE": "Desafíos Actuais:",
    "BLOCKLY_CHALLENGES_LI1_TITLE": "Lectores de Pantalla:",
    "BLOCKLY_CHALLENGES_LI1_TEXT": "A miúdo, as interfaces de arrastrar e soltar non son completamente compatibles cos lectores de pantalla, o que dificulta a interacción para persoas cegas ou con baixa visión severa.",
    "BLOCKLY_CHALLENGES_LI2_TITLE": "Navegación por Teclado:",
    "BLOCKLY_CHALLENGES_LI2_TEXT": "A navegación completa e eficiente só con teclado non sempre está implementada á perfección en todas as plataformas de programación por bloques.",
    "BLOCKLY_CHALLENGES_LI3_TITLE": "Personalización:",
    "BLOCKLY_CHALLENGES_LI3_TEXT": "A falta de opcións de personalización (tamaño de fonte, contraste de color, eliminación de animacións) pode afectar a usuarios con diversas necesidades visuais ou cognitivas.",
    "BLOCKLY_CHALLENGES_LI4_TITLE": "Documentación e Exemplos:",
    "BLOCKLY_CHALLENGES_LI4_TEXT": "Non sempre se dispón de documentación e exemplos de proxectos deseñados especificamente con a accesibilidade en mente.",
    "PYTHON_TITLE": "Programación por Código (Editor Micro:bit Python)",
    "PYTHON_P1": "Como alternativa á programación por bloques pódese utilizar a programación por código (microPython ou JavaScript). Este tipo de programación, ao ser texto plano, é altamente accesible para os lectores de pantalla.",
    "PYTHON_P2": "O problema deste tipo de programación é que os usuarios deben ter un coñecemento mínimo da linguaxe de programación, polo que se lles ten que ensinar a linguaxe e os conceptos ao mesmo tempo. Isto non sucede con la programación por bloques, xa que o coñecemento da linguaxe non é necesario e os conceptos principais que se traballan son os conceptos de programación como variables, constantes, bucles, etc.",
    "PYTHON_P3": "O único procedemento que existe actualmente para minimizar esta barreira (coñecemento da linguaxe) é a creación de bloques de programación onde o alumno só debe substituír ou completar unha parte do código. A creación do esqueleto dos bloques de programación en código sería a única opción actual para garantir un acceso do 100% mediante un lector de pantalla.",
    "PYTHON_P4": "Fomentar a programación accesible non só beneficia ás persoas con discapacidade, senón que tamén mellora a experiencia para todos os usuarios, promovendo unha cultura de deseño inclusivo no ámbito da tecnoloxía.",
    "PYTHON_P5": "A continuación móstranse dous exemplos, un exemplo onde a resposta da Micro:bit só se realiza a través da pantalla e outro, máis accesible, onde a saída de información se realiza a través da pantalla e se reforza cunha saída de son.",
    "MODAL_NON_ACCESSIBLE_TITLE": "Exemplo non Accesible",
    "MODAL_CLOSE": "Pechar",
    "MODAL_NON_ACCESSIBLE_H2": "Videoclip (Non Accesible)",
    "MODAL_NON_ACCESSIBLE_P": "O videoclip do exemplo non accesible iría aquí.",
    "MODAL_VIEW_CODE": "Ver Código",
    "MODAL_ACCESSIBLE_TITLE": "Exemplo Accesible",
    "MODAL_ACCESSIBLE_H2": "Videoclip (Accesible)",
    "MODAL_ACCESSIBLE_P": "O videoclip do exemplo accesible iría aquí.",
    "MODAL_CODE_TITLE": "Código",
    "NON_ACCESSIBLE_EXAMPLE_BUTTON": "Exemplo non accesible",
    "ACCESSIBLE_EXAMPLE_BUTTON": "Exemplo Accesible"
  },
  "ACCESSIBILITY_EVALUATOR_TITLE": "Avaliador de accesibilidade",
  "COMPROBAR_ACCESIBILIDAD_TITLE": "Comprobar Accesibilidade (Automática)",
  "COMPROBAR_ACCESIBILIDAD_MANUAL_TITLE": "Comprobar Accesibilidade (Manual)",
  "MICROPYTHON_PAGE": {
    "H1": "Curso de Programación en MicroPython para Micro:bit (Énfase en Accesibilidade)",
    "H2_INTRO": "Introdución a MicroPython e Micro:bit",
    "P_INTRO": "Este curso introducirache no emocionante mundo da programación con MicroPython na placa Micro:bit. Aprenderás a crear proxectos interactivos, cun enfoque especial en como facelos accesibles para todos os usuarios, independentemente das súas capacidades. A Micro:bit é unha pequena computadora programable deseñada para facer que a aprendizaxe da programación sexa divertida e accesible. Con MicroPython, un dialecto optimizado de Python para microcontroladores, poderás escribir código de xeito sinxelo e eficiente.",
    "H2_MODULE1": "Módulo 1: Primeiros Pasos e Saídas Accesibles",
    "H3_MODULE1_BASIC": "Conceptos Básicos de MicroPython",
    "P_MODULE1_BASIC": "Lorem ipsum dolor sit amet, consectetur adipiscing elit. Sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercicio ullamco laboris nisi ut aliquip ex ea commodo consequat.",
    "H3_MODULE1_LED": "Mostrando Texto na Pantalla LED (con consideracións de Accesibilidade)",
    "P_MODULE1_LED": "Aprenderemos a usar a matriz de LEDs da Micro:bit para mostrar mensaxes. É crucial considerar que os usuarios con discapacidade visual poderían non percibir esta saída. Máis adiante, exploraremos métodos alternativos para comunicar a información.",
    "H2_MODULE2": "Módulo 2: Entradas Interactivas e Retroalimentación Multisensorial",
    "H3_MODULE2_INPUTS": "Uso de Botóns e Entradas Dixitais",
    "P_MODULE2_INPUTS": "Exploraremos como os botóns A e B, así como as entradas dixitais, poden ser utilizados para interactuar cos nosos programas. Para a accesibilidade, consideraremos como estas entradas poden ser adaptadas ou complementadas.",
    "H3_MODULE2_SOUND": "Integrando Son para Retroalimentación",
    "P_MODULE2_SOUND": "A retroalimentación auditiva é fundamental para a accesibilidade. Aprenderemos a usar o zumbador (ou altofalante externo) para proporcionar sons que reforcen a información visual ou a substitúan completamente para usuarios con discapacidade visual. Por exemplo, se un xogo require que o usuario pulse un botón, unha combinación dunha frecha visual na pantalla LED e un son distintivo ao pulsar o botón pode mellorar significativamente a experiencia para todos.",
    "H2_MODULE3": "Módulo 3: Sensores e Adaptacións para a Diversidade Funcional",
    "H3_MODULE3_SENSORS": "Lectura de Sensores (Acelerómetro, Brúxula, Temperatura)",
    "P_MODULE3_SENSORS": "A Micro:bit conta con varios sensores incorporados que nos permiten interactuar coa contorna. Aprenderemos a ler datos do acelerómetro (para detectar movemento), a brúxula (para a orientación) e o sensor de temperatura.",
    "H3_MODULE3_ADAPTATIONS": "Adaptacións de Sensores para a Accesibilidade",
    "P_MODULE3_ADAPTATIONS": "Analizaremos como os datos dos sensores poden ser utilizados para crear interaccións alternativas. Por exemplo, un programa que se activa ao inclinar a Micro:bit podería ser máis accesible para persoas con mobilidade reducida que un botón tradicional. Ademais, veremos como a información obtida dos sensores pode ser traducida a saídas multisensoriais (visual, auditiva, táctil).",
    "H2_CONCLUSIONS": "Conclusións e Próximos Pasos",
    "P_CONCLUSIONS": "Este curso cubriu as bases da programación en MicroPython cun forte énfase no deseño accesible. Lembra que a accesibilidade non é unha característica adicional, senón un principio fundamental para crear tecnoloxía inclusiva. Animámoste a explorar máis proxectos e a seguir aprendendo como facer a tecnoloxía accesible para todos!"
  },
  "REPOSITORIO_PAGE": {
    "CONTENT": "Contido da páxina Repositorio.",
    "HEADER": {
      "HOME": "Inicio",
      "REPOSITORY": "Repositorio",
      "DOCUMENTATION": "Documentación",
      "COMMUNITY": "Comunidade"
    },
    "HERO": {
      "TITLE": "Repositorio de Proxectos Accesibles",
      "SUBTITLE": "Explora, comparte e aprende con proxectos de Micro:bit deseñados con accesibilidade en mente",
      "UPLOAD_PROJECT_BUTTON": "Subir o teu Proxecto"
    },
    "STATS": {
      "PROJECTS_PUBLISHED": "Proxectos publicados",
      "TOTAL_DOWNLOADS": "Descargas totais",
      "CONTRIBUTORS": "Colaboradores",
      "CATEGORIES": "Categorías"
    },
    "FILTERS": {
      "LABEL": "Filtrar por:",
      "ALL": "Todos",
      "SEARCH_PLACEHOLDER": "Buscar proxectos..."
    },
    "CATEGORIES": {
      "ACCESSIBILITY": "Accesibilidade",
      "SENSORS": "Sensores",
      "COMMUNICATION": "Comunicación",
      "EDUCATION": "Educación",
      "ENTERTAINMENT": "Entretenimiento"
    },
    "PROJECTS_GRID": {
      "EMPTY_STATE_TITLE": "Non se atoparon proxectos",
      "EMPTY_STATE_SUBTITLE": "Intenta con outros filtros ou sé o primeiro en subir un proxecto"
    },
    "UPLOAD_MODAL": {
      "TITLE": "Subir Novo Proxecto",
      "SUBTITLE": "Comparte o teu proxecto accesible coa comunidade",
      "PROJECT_TITLE_LABEL": "Título do proxecto *",
      "PROJECT_TITLE_PLACEHOLDER": "Ex: Semáforo sonoro accesible",
      "CATEGORY_LABEL": "Categoría *",
      "SELECT_CATEGORY_PLACEHOLDER": "Selecciona unha categoría",
      "DESCRIPTION_LABEL": "Descrición *",
      "DESCRIPTION_PLACEHOLDER": "Describe o teu proxecto, que fai e como axuda á accesibilidade...",
      "AUTHOR_NAME_LABEL": "O teu nome *",
      "AUTHOR_NAME_PLACEHOLDER": "Ex: María García",
      "TAGS_LABEL": "Etiquetas (preme Enter para engadir)",
      "TAGS_PLACEHOLDER": "Ex: son, LED, vibración...",
      "CODE_LABEL": "Código do proxecto (.py) *",
      "DRAG_FILE_TEXT_BOLD": "Arrastra o teu ficheiro .py aquí",
      "CLICK_TO_SELECT_TEXT": "ou fai clic para seleccionar",
      "PUBLISH_BUTTON": "Publicar Proxecto"
    },
    "DETAIL_MODAL": {
      "DESCRIPTION_SECTION_TITLE": "Descrición",
      "TAGS_SECTION_TITLE": "Etiquetas",
      "CODE_SECTION_TITLE": "Código do proxecto",
      "COPY_CODE_BUTTON": "Copiar",
      "COPIED_CODE_BUTTON": "✓ Copiado",
      "DOWNLOAD_FULL_PROJECT_BUTTON": "Descargar proxecto completo"
    },
    "PROJECT_CARD": {
      "DOWNLOAD_BUTTON": "Descargar",
      "VIEW_CODE_BUTTON": "Ver código"
    },
    "TOAST": {
      "PROJECT_PUBLISHED_SUCCESS": "Proxecto publicado con éxito! 🎉"
    }
  },
  "ACCESSIBILITY_EVALUATOR_TITLE": "Avaliador de accesibilidade",
  "COMPROBAR_ACCESIBILIDAD_TITLE": "Comprobar Accesibilidade (Automática)",
  "COMPROBAR_ACCESIBILIDAD_MANUAL_TITLE": "Comprobar Accesibilidade (Manual)",
  "MICROPYTHON_PAGE": {
    "H1": "Curso de Programación en MicroPython para Micro:bit (Énfase en Accesibilidade)",
    "H2_INTRO": "Introdución a MicroPython e Micro:bit",
    "P_INTRO": "Este curso introducirache no emocionante mundo da programación con MicroPython na placa Micro:bit. Aprenderás a crear proxectos interactivos, cun enfoque especial en como facelos accesibles para todos os usuarios, independentemente das súas capacidades. A Micro:bit é unha pequena computadora programable deseñada para facer que a aprendizaxe da programación sexa divertida e accesible. Con MicroPython, un dialecto optimizado de Python para microcontroladores, poderás escribir código de xeito sinxelo e eficiente.",
    "H2_MODULE1": "Módulo 1: Primeiros Pasos e Saídas Accesibles",
    "H3_MODULE1_BASIC": "Conceptos Básicos de MicroPython",
    "P_MODULE1_BASIC": "Lorem ipsum dolor sit amet, consectetur adipiscing elit. Sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercicio ullamco laboris nisi ut aliquip ex ea commodo consequat.",
    "H3_MODULE1_LED": "Mostrando Texto na Pantalla LED (con consideracións de Accesibilidade)",
    "P_MODULE1_LED": "Aprenderemos a usar a matriz de LEDs da Micro:bit para mostrar mensaxes. É crucial considerar que os usuarios con discapacidade visual poderían non percibir esta saída. Máis adiante, exploraremos métodos alternativos para comunicar a información.",
    "H2_MODULE2": "Módulo 2: Entradas Interactivas e Retroalimentación Multisensorial",
    "H3_MODULE2_INPUTS": "Uso de Botóns e Entradas Dixitais",
    "P_MODULE2_INPUTS": "Exploraremos como os botóns A e B, así como as entradas dixitais, poden ser utilizados para interactuar cos nosos programas. Para a accesibilidade, consideraremos como estas entradas poden ser adaptadas ou complementadas.",
    "H3_MODULE2_SOUND": "Integrando Son para Retroalimentación",
    "P_MODULE2_SOUND": "A retroalimentación auditiva é fundamental para a accesibilidade. Aprenderemos a usar o zumbador (ou altofalante externo) para proporcionar sons que reforcen a información visual ou a substitúan completamente para usuarios con discapacidade visual. Por exemplo, se un xogo require que o usuario pulse un botón, unha combinación dunha frecha visual na pantalla LED e un son distintivo ao pulsar o botón pode mellorar significativamente a experiencia para todos.",
    "H2_MODULE3": "Módulo 3: Sensores e Adaptacións para a Diversidade Funcional",
    "H3_MODULE3_SENSORS": "Lectura de Sensores (Acelerómetro, Brúxula, Temperatura)",
    "P_MODULE3_SENSORS": "A Micro:bit conta con varios sensores incorporados que nos permiten interactuar coa contorna. Aprenderemos a ler datos do acelerómetro (para detectar movemento), a brúxula (para a orientación) e o sensor de temperatura.",
    "H3_MODULE3_ADAPTATIONS": "Adaptacións de Sensores para a Accesibilidade",
    "P_MODULE3_ADAPTATIONS": "Analizaremos como os datos dos sensores poden ser utilizados para crear interaccións alternativas. Por exemplo, un programa que se activa ao inclinar a Micro:bit podería ser máis accesible para persoas con mobilidade reducida que un botón tradicional. Ademais, veremos como a información obtida dos sensores pode ser traducida a saídas multisensoriais (visual, auditiva, táctil).",
    "H2_CONCLUSIONS": "Conclusións e Próximos Pasos",
    "P_CONCLUSIONS": "Este curso cubriu as bases da programación en MicroPython cun forte énfase no deseño accesible. Lembra que a accesibilidade non é unha característica adicional, senón un principio fundamental para crear tecnoloxía inclusiva. Animámoste a explorar máis proxectos e a seguir aprendendo como facer a tecnoloxía accesible para todos!"
  },
  "REPOSITORIO_PAGE": {
    "CONTENT": "Contido da páxina Repositorio.",
    "HEADER": {
      "HOME": "Inicio",
      "REPOSITORY": "Repositorio",
      "DOCUMENTATION": "Documentación",
      "COMMUNITY": "Comunidade"
    },
    "HERO": {
      "TITLE": "Repositorio de Proxectos Accesibles",
      "SUBTITLE": "Explora, comparte e aprende con proxectos de Micro:bit deseñados con accesibilidade en mente",
      "UPLOAD_PROJECT_BUTTON": "Subir o teu Proxecto"
    },
    "STATS": {
      "PROJECTS_PUBLISHED": "Proxectos publicados",
      "TOTAL_DOWNLOADS": "Descargas totais",
      "CONTRIBUTORS": "Colaboradores",
      "CATEGORIES": "Categorías"
    },
    "FILTERS": {
      "LABEL": "Filtrar por:",
      "ALL": "Todos",
      "SEARCH_PLACEHOLDER": "Buscar proxectos..."
    },
    "CATEGORIES": {
      "ACCESSIBILITY": "Accesibilidade",
      "SENSORS": "Sensores",
      "COMMUNICATION": "Comunicación",
      "EDUCATION": "Educación",
      "ENTERTAINMENT": "Entretenimiento"
    },
    "PROJECTS_GRID": {
      "EMPTY_STATE_TITLE": "Non se atoparon proxectos",
      "EMPTY_STATE_SUBTITLE": "Intenta con outros filtros ou sé o primeiro en subir un proxecto"
    },
    "UPLOAD_MODAL": {
      "TITLE": "Subir Novo Proxecto",
      "SUBTITLE": "Comparte o teu proxecto accesible coa comunidade",
      "PROJECT_TITLE_LABEL": "Título do proxecto *",
      "PROJECT_TITLE_PLACEHOLDER": "Ex: Semáforo sonoro accesible",
      "CATEGORY_LABEL": "Categoría *",
      "SELECT_CATEGORY_PLACEHOLDER": "Selecciona unha categoría",
      "DESCRIPTION_LABEL": "Descrición *",
      "DESCRIPTION_PLACEHOLDER": "Describe o teu proxecto, que fai e como axuda á accesibilidade...",
      "AUTHOR_NAME_LABEL": "O teu nome *",
      "AUTHOR_NAME_PLACEHOLDER": "Ex: María García",
      "TAGS_LABEL": "Etiquetas (preme Enter para engadir)",
      "TAGS_PLACEHOLDER": "Ex: son, LED, vibración...",
      "CODE_LABEL": "Código do proxecto (.py) *",
      "DRAG_FILE_TEXT_BOLD": "Arrastra o teu ficheiro .py aquí",
      "CLICK_TO_SELECT_TEXT": "ou fai clic para seleccionar",
      "PUBLISH_BUTTON": "Publicar Proxecto"
    },
    "DETAIL_MODAL": {
      "DESCRIPTION_SECTION_TITLE": "Descrición",
      "TAGS_SECTION_TITLE": "Etiquetas",
      "CODE_SECTION_TITLE": "Código do proxecto",
      "COPY_CODE_BUTTON": "Copiar",
      "COPIED_CODE_BUTTON": "✓ Copiado",
      "DOWNLOAD_FULL_PROJECT_BUTTON": "Descargar proxecto completo"
    },
    "PROJECT_CARD": {
      "DOWNLOAD_BUTTON": "Descargar",
      "VIEW_CODE_BUTTON": "Ver código"
    },
    "TOAST": {
      "PROJECT_PUBLISHED_SUCCESS": "Proxecto publicado con éxito! 🎉"
    }
  },
  "ACCESSIBILITY_EVALUATOR_TITLE": "Avaliador de accesibilidade",
  "COMPROBAR_ACCESIBILIDAD_TITLE": "Comprobar Accesibilidade (Automática)",
  "COMPROBAR_ACCESIBILIDAD_MANUAL_TITLE": "Comprobar Accesibilidade (Manual)",
  "MICROPYTHON_PAGE": {
    "H1": "Curso de Programación en MicroPython para Micro:bit (Énfase en Accesibilidade)",
    "H2_INTRO": "Introdución a MicroPython e Micro:bit",
    "P_INTRO": "Este curso introducirache no emocionante mundo da programación con MicroPython na placa Micro:bit. Aprenderás a crear proxectos interactivos, cun enfoque especial en como facelos accesibles para todos os usuarios, independentemente das súas capacidades. A Micro:bit é unha pequena computadora programable deseñada para facer que a aprendizaxe da programación sexa divertida e accesible. Con MicroPython, un dialecto optimizado de Python para microcontroladores, poderás escribir código de xeito sinxelo e eficiente.",
    "H2_MODULE1": "Módulo 1: Primeiros Pasos e Saídas Accesibles",
    "H3_MODULE1_BASIC": "Conceptos Básicos de MicroPython",
    "P_MODULE1_BASIC": "Lorem ipsum dolor sit amet, consectetur adipiscing elit. Sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercicio ullamco laboris nisi ut aliquip ex ea commodo consequat.",
    "H3_MODULE1_LED": "Mostrando Texto na Pantalla LED (con consideracións de Accesibilidade)",
    "P_MODULE1_LED": "Aprenderemos a usar a matriz de LEDs da Micro:bit para mostrar mensaxes. É crucial considerar que os usuarios con discapacidade visual poderían non percibir esta saída. Máis adiante, exploraremos métodos alternativos para comunicar a información.",
    "H2_MODULE2": "Módulo 2: Entradas Interactivas e Retroalimentación Multisensorial",
    "H3_MODULE2_INPUTS": "Uso de Botóns e Entradas Dixitais",
    "P_MODULE2_INPUTS": "Exploraremos como os botóns A e B, así como as entradas dixitais, poden ser utilizados para interactuar cos nosos programas. Para a accesibilidade, consideraremos como estas entradas poden ser adaptadas ou complementadas.",
    "H3_MODULE2_SOUND": "Integrando Son para Retroalimentación",
    "P_MODULE2_SOUND": "A retroalimentación auditiva é fundamental para a accesibilidade. Aprenderemos a usar o zumbador (ou altofalante externo) para proporcionar sons que reforcen a información visual ou a substitúan completamente para usuarios con discapacidade visual. Por exemplo, se un xogo require que o usuario pulse un botón, unha combinación dunha frecha visual na pantalla LED e un son distintivo ao pulsar o botón pode mellorar significativamente a experiencia para todos.",
    "H2_MODULE3": "Módulo 3: Sensores e Adaptacións para a Diversidade Funcional",
    "H3_MODULE3_SENSORS": "Lectura de Sensores (Acelerómetro, Brúxula, Temperatura)",
    "P_MODULE3_SENSORS": "A Micro:bit conta con varios sensores incorporados que nos permiten interactuar coa contorna. Aprenderemos a ler datos do acelerómetro (para detectar movemento), a brúxula (para a orientación) e o sensor de temperatura.",
    "H3_MODULE3_ADAPTATIONS": "Adaptacións de Sensores para a Accesibilidade",
    "P_MODULE3_ADAPTATIONS": "Analizaremos como os datos dos sensores poden ser utilizados para crear interaccións alternativas. Por exemplo, un programa que se activa ao inclinar a Micro:bit podería ser máis accesible para persoas con mobilidade reducida que un botón tradicional. Ademais, veremos como a información obtida dos sensores pode ser traducida a saídas multisensoriais (visual, auditiva, táctil).",
    "H2_CONCLUSIONS": "Conclusións e Próximos Pasos",
    "P_CONCLUSIONS": "Este curso cubriu as bases da programación en MicroPython cun forte énfase no deseño accesible. Lembra que a accesibilidade non é unha característica adicional, senón un principio fundamental para crear tecnoloxía inclusiva. Animámoste a explorar máis proxectos e a seguir aprendendo como facer a tecnoloxía accesible para todos!"
  },
  "ACCESSIBILITY_EVALUATOR_PAGE": {
    "H2": "Comprobador de Accesibilidade do código",
    "P": "Introduce o teu código de MicroPython para a Micro:bit na área de texto. O editor axudarache a visualizar como se ve o código e permitirache comprobar a súa accesibilidade.",
    "BTN": "Comprobar a Accesibilidade",
    "TEXTAREA_PLACEHOLDER": "Escribe o teu código MicroPython aquí...",
    "EVALUATION_RESULTS_H3": "Resultado da avaliación",
    "SCORE": "Puntuación",
    "IMPROVEMENT": "Mellora",
    "REDUNDANCY_DETECTED": "Redundancia de entrada detectada",
    "YES": "Si",
    "NO": "Non",
    "NO_BUTTONS_USED": "Non se utilizan os botóns",
    "ERRORS": "Erros",
    "WARNINGS": "Advertencias",
    "CODE_PREVIEW_H3": "Suxestión de corrección de código"
  },
  "VALIDATOR": {
    "AUDIO_FEEDBACK": {
      "SUCCESS_MESSAGE": "Multimodalidade: Detectouse importación de audio.",
      "SUCCESS_MESSAGE_2": "Multimodalidade: Detectouse saída de audio.",
      "ERROR_MESSAGE": "Falta saída sonora.",
      "ERROR_SUGGESTION": "Engade 'speech.say(\"[string]\")', 'music.play(music.[song])' ou 'music.([number])' para que usuarios con discapacidade visual reciban información.",
      "ERROR_SUGGESTION_2": "Importa 'speech' ou 'music' para que usuarios con discapacidade visual reciban información.",
      "MISSING_AUDIO_OUTPUT_WITH_DISPLAY_SHOW": "Só usas display.show() sen saída de audio.",
      "SUGGEST_AUDIO_OUTPUT_WITH_DISPLAY_SHOW": "Engade 'import speech' ou 'import music' e utiliza 'speech.say()' ou 'music.play()' para proporcionar retroalimentación auditiva aos usuarios con discapacidade visual."
    },
    "BLOCKING_LOOPS": {
      "WARNING_MESSAGE": "Bucle bloqueante detectado.",
      "WARNING_SUGGESTION": "Usas sleep() moi longos. Isto impide que a Micro:bit reaccione a botóns ou comandos de voz rapidamente."
    },
    "INPUT_REDUNDANCY": {
      "SUCCESS_MESSAGE": "Entrada accesible: Usas sensores táctiles ou de movemento.",
      "ERROR_MESSAGE": "Só usas botóns físicos.",
      "ERROR_SUGGESTION": "Engade 'pin_logo.is_touched()' para facilitar o uso a persoas con dificultade motriz."
    },
    "COMPLEX_PRESSES": {
      "WARNING_MESSAGE": "Pulsación complexa detectada.",
      "WARNING_SUGGESTION": "Evita solicitar a pulsación simultánea de dous botóns ou un botón e o logotipo, xa que dificulta a interacción para usuarios con certas discapacidades motrices.",
      "SUCCESS_MESSAGE": "Pulsacións simples: Non se detectaron pulsacións complexas."
    },
    "CODE_SEMANTICS": {
      "SUCCESS_MESSAGE": "Semántica: As variables teñen nomes descritivos.",
      "WARNING_MESSAGE": "Nomes de variables xenéricos.",
      "WARNING_SUGGESTION": "Usa nomes como 'estado_alarma' en lugar de 'a' para facilitar a lectura con lectores de pantalla."
    }
  },
  "MANUAL_CHECK_MODAL_TITLE": "Verificación Manual de Accesibilidade",
  "MANUAL_CHECK_MODAL_QUESTION_1": "Os textos ou iconas en pantalla LED son claros e lexibles",
  "MANUAL_CHECK_MODAL_QUESTION_2": "Non depende unicamente de luces ou cores para transmitir información",
  "MANUAL_CHECK_MODAL_QUESTION_3": "O brillo da pantalla LED é adecuado",
  "MANUAL_CHECK_MODAL_QUESTION_4": "Ofrécense alternativas ao uso exclusivo da pantalla",
  "MANUAL_CHECK_MODAL_QUESTION_5": "Os sinais sonoros teñen alternativa visual",
  "MANUAL_CHECK_MODAL_QUESTION_6": "O volume é suficiente",
  "MANUAL_CHECK_MODAL_QUESTION_7": "Non require movementos finos",
  "MANUAL_CHECK_MODAL_QUESTION_8": "Os botóns A e B non son a única forma de interacción",
  "MANUAL_CHECK_MODAL_QUESTION_9": "Pódese usar con adaptacións (pulsadores externos, pinzas de crocodilo, etc.)",
  "MANUAL_CHECK_MODAL_QUESTION_10": "Non require axitar con forza se usa sensor de movemento",
  "MANUAL_CHECK_MODAL_QUESTION_11": "As instrucións son claras e simples",
  "MANUAL_CHECK_MODAL_QUESTION_12": "O proxecto ten retroalimentación inmediata",
  "MANUAL_CHECK_MODAL_QUESTION_13": "Non sobrecarga con demasiados sinais simultáneos",
  "MANUAL_CHECK_MODAL_QUESTION_14": "O comportamento do programa é predicible",
  "MANUAL_CHECK_MODAL_QUESTION_15": "Pódese usar sentado/a ou con soporte fixo",
  "MANUAL_CHECK_MODAL_QUESTION_16": "A documentación explica como adaptalo",
  "MANUAL_CHECK_MODAL_QUESTION_17": "Foi probado por usuarios con diferentes necesidades",
  "MANUAL_CHECK_MODAL_OPTION_YES": "Si",
  "MANUAL_CHECK_MODAL_OPTION_PARTIAL": "Parcial",
  "MANUAL_CHECK_MODAL_OPTION_NO": "Non",
  "MANUAL_CHECK_MODAL_SUBMIT": "Enviar",
  "MANUAL_CHECK_MODAL_CANCEL": "Cancelar",
  "RESULTS_MODAL_TITLE": "Resultados da Avaliación de Accesibilidade",
  "RESULTS_MODAL_SCORE": "Puntuación Total",
  "RESULTS_MODAL_FEEDBACK_0_17": "Necesita melloras importantes",
  "RESULTS_MODAL_FEEDBACK_18_27": "Accesibilidade media (mellorable)",
  "RESULTS_MODAL_FEEDBACK_28_36": "Proxecto altamente accesible",
  "RESULTS_MODAL_ACCEPT": "Aceptar",
  "MANUAL_CHECK_MODAL_HEADER_QUESTION": "Pregunta"
}